Repository: aspschn/d-i
Catalog: packages/arcboot-installer/debian/po/*.po
Languages: kn

source: Install the Arcboot boot loader on a hard disk
kn: ಅರ್ಕ್ ಬೂಟ್ ಬೂಟ್ ಲೋಡರನ್ನು ಹಾರ್ಡ್ ಡಿಸ್ಕ್ ಮೇಲೆ ಇನ್ಸ್ಟಾಲ್ ಮಾಡಿ

source: Disk for boot loader installation:
kn: ಡಿಸ್ಕ್ , ಬೂಟ್ ಲೋಡರ್ ಇನ್ಸ್ಠಾಲ್ ಲೇಶನ್ ಗಾಗಿ

source: Arcboot must be installed into the volume header of a disk with a SGI disklabel. Usually the volume header of /dev/sda is used. Please give the device name of the disk on which to put arcboot.
kn: SGI ಡಿಸ್ಕ್ ಲೇಬೆಲ್ ಹೆಸರಿರುವ ವಾಲ್ಯೂಮ್ ಹೆಡರ್ ಡಿಸ್ಕ್ ನಲ್ಲಿ Arcboot ಇನ್ಸ್ಟಾಲ್ ಆಗಿರಬೆಕು ಸಾಮಾನ್ಯವಾಗಿ /dev/sda ಉಪಯೊಗಿಸಲಾಗುವುದುಡಯಮಾಡಿ arcboot ಹಾಕಲು ಡಿಸ್ಕ್ ನ ಡೆವೈಸ್ ಹೆಸರು ನೀಡಿರಿ

source: Arcboot configured to use a serial console
kn: ಅರ್ಕ್ ಬೂಟ್ ಸೀರಿಯಲ್ ಕನ್ಸೋಲೆ ಗಾಗಿ ವಿನ್ಯಸಗೊಂಡಿದೆ

source: Arcboot is configured to use the serial port ${PORT} as the console. The serial port speed is set to ${SPEED}.
kn: ಅರ್ಕ್ ಬೂಟ್ ಸೀರಿಯಲ್ ಪೊರ್ಟ್ಕ ${PORT} ನ್ಸೋಲೆ ಆಗಿ ವಿನ್ಯಸಗೊಂಡಿದೆಸೀರಿಯಲ್ ಪೊರ್ಟ್ಕ ವೆಗವು ${SPEED} ಗೆ ಸ್ಥಿರವಾಗಿಸಿದೆ

source: Arcboot installation failed. Continue anyway?
kn: ಅರ್ಕ್ ಬೂಟ್ ಇನ್ಸ್ಠಾಲ್ ಲೇಶನ್ ವಿಫಲಗೊಂಡಿದೆ. ಮಂದುವರೆಯಬೆಕೇ ?

source: The arcboot package failed to install into /target/. Installing Arcboot as a boot loader is a required step. The install problem might however be unrelated to Arcboot, so continuing the installation may be possible.
kn: /target/ ನೊಳಗೆ ಇನ್ಸ್ಟಾಲ್ ಆಗಲು arcboot ಪ್ಯಾಕೇಜ್ ವಿಫಲವಾಗಿದೆ. arcboot ಅನ್ನು ಒಂದು ಬೂಟ್ ಲೋಡರ್ ಆಗಿ ಇನ್ಸ್ಟಾಲ್ ಮಾಡುವುದು ಒಂದು ಅವಶ್ಯಕ ಹೆಜ್ಜೆಯಾಗಿದೆ. ಇನ್ಸ್ಟಾಲ್ ಸಮಸ್ಯೆಯು arcboot ಗೆ ಸಂಬಂಧಪಡದೆ ಇರಬಹುದು. ಆದ್ದರಿಂದ ಇನ್ಸ್ಟಾಲೇಶನ್ ಅನ್ನು ಮುಂದುವರೆಸುವುದುಸಾಧ್ಯವಿದೆ.

source: Setting PROM variables for Arcboot
kn: PROM ಚರಗಳನ್ನು ಅರ್ಕ್ ಬೂಟ್ ಗಾಗಿ ಸ್ಥಿರಗೊಳಿಸಲಾಗಿದೆ

source: If this is the first Linux installation on this machine, or if the hard drives have been repartitioned, some variables need to be set in the PROM before the system is able to boot normally.
kn: ಇದು ಈ ಯಂತ್ರಡ ಮೇಲೆ ಮೊದಲನೆಯ ಲಿನಕ್ಸ್ ಇನ್ಸ್ಟಾಲ್ ಆದರೆ ಅಥವಾ ಡ್ರೈವ್ ಗಲು ಮರೂ ವಿಭಜನೆಯಾದರೆ ಕೆಲವು ಚರಗಲನ್ನು PROM ನಲ್ಲಿ ಸ್ಥಪಿಸಬೇಕಾಹುತ್ತದೆ ಮತ್ತು ಸಿಸ್ಟಮ್ ರೂಧಿಯಾಗಿ ನಡೆಯುವ ಮೊದಲು

source: At the end of this installation stage, the system will reboot. After this, enter the command monitor from the "Stop for Maintenance" option, and enter the following commands:
kn: ಇನ್ಸ್ಠಾಲ್ ಲೇಶನ್ ನ ಅಂತ್ಯದಲ್ಲಿ ವ್ಯವಸ್ಥೆಯು ಪುನಃ ಬೂಟ್ ಆಗುವುದುಅನಂತರ ಸೂಚನೆ ಮಾನಿಟರ್ ಗೆ "Stop for Maintenance" ಆಇಕೆ ಮಾಡಿ ಪ್ರವೆಶಿಸಬೇಕುಮತ್ತು ಇತರ ಸೂಚನೆಗಲನ್ನು ಪ್ರವೆಶಿಸಬೇಕು

source: You will only need to do this once. Afterwards, enter the "boot" command or reboot the system to proceed to your newly installed system.
kn: ಇದು ಒಂದು ಬಾರಿ ಸಾಕಾಗುತ್ತದೆ, ಆನಂತರದಲ್ಲಿ "boot" ಸೂಚನೆಯೊಂದಿಗೆಅಥವಾ ಪುನಃ ಬೂಟ್ ನೊಂದಿಗೆ ಹೊಸ ವ್ಯವಸ್ಥೆ ಆರಂಭವಾಗುವುದು
