Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: The installation files for the QNAP Turbo Station consist of a kernel and ramdisk as well as a script to write these images to flash. You can obtain the installation files for QNAP TS-11x/TS-12x, HS-210, TS-21x/TS-22x and TS-41x/TS-42x models from &qnap-kirkwood-firmware-img;.
de: Die Installationsdateien für die QNAP Turbo Station bestehen aus einem Kernel, einer Ramdisk sowie einem Skript, um diese Images auf das Flash zu schreiben. Sie können die Installationsdateien für die Modelle QNAP TS-11x/TS-12x, HS-210, TS-21x/TS-22x und TS-41x/TS-42x unter &qnap-kirkwood-firmware-img; herunterladen.
it: I file per l'installazione su QNAP Turbo Station consistono in un kernel, un ramdisk e gli script necessari per scrivere queste immagini sulla flash. È possibile recuperare i file per l'installazione sui modelli QNAP TS-11x/TS-12x, HS-210, TS-21x/TS-22x e TS-41x/TS-42x sono scaricabili da &qnap-kirkwood-firmware-img;.
nl: De installatiebestanden voor het QNAP Turbo Station bestaan uit een kernel en een ramschijf samen met een script om deze images in het flashgeheugen te schrijven. De installatiebestanden voor de modellen QNAP TS-11x/TS-12x, HS-210, TS-21x/TS-22x en TS-41x/TS-41x kunt u vinden op &qnap-kirkwood-firmware-img;.

source: Plug Computer and OpenRD Installation Files
ca: Fitxers d'instal·lació de Plug Computer i OpenRD
de: Installationsdateien für Plug-Computer und OpenRD
it: File d'installazione per plug computer e OpenRD
nl: Installatiebestanden voor Plug Computer en OpenRD

source: The installation files for plug computers (SheevaPlug, GuruPlug, DreamPlug etc) and OpenRD devices consist of a kernel and initrd for U-Boot. You can obtain these files from &kirkwood-marvell-firmware-img;.
ca: Els fitxers d'instal·lació per als ordinadors d'endoll, «plug computers», (SheevaPlug, GuruPlug, DreamPlug, etc) i OpenRD consisteixen en un nucli i un «initrd» per a U-Boot. Podeu obtenir aquests fitxers de &kirkwood-marvell-firmware-img;.
de: Die Installationsdateien für Plug-Computer (SheevaPlug, GuruPlug, DreamPlug etc.) und OpenRD-Geräte bestehen aus einem Kernel und einer Initrd für U-Boot. Sie können diese Dateien von &kirkwood-marvell-firmware-img; herunterladen.
it: I file per l'installazione su dispositivi quali i plug computer (SheevaPlug, GuruPlug, DreamPlug, ecc.) e OpenRD consistono di un kernel e un initrd per U-Boot. È possibile recuperare questi file da &kirkwood-marvell-firmware-img;.
nl: De installatiebestanden voor plug computers (SheevaPlug, GuruPlug, DreamPlug, enz.) en OpenRD-apparaten bestaan uit een kernel en initrd voor U-Boot. U kunt deze bestanden ophalen van &kirkwood-marvell-firmware-img;.

source: LaCie NASes Installation Files
ca: Fitxes d'instal·lació per a «LaCie NASes»
de: Installationsdateien für LaCie-NAS-Geräte
it: File d'installazione per NAS LaCie
nl: Installatiebestanden voor LaCie NAS'en

source: The installation files for LaCie NASes (Network Space v2, Network Space Max v2, Internet Space v2, d2 Network v2, 2Big Network v2 and 5Big Network v2) consist of a kernel and initrd for U-Boot. You can obtain these files from &lacie-kirkwood-firmware-img;.
ca: Els fitxers d'instal·lació per a LaCie NASes (Network Space v2, Network Space Max v2, Internet Space v2, d2 Network v2, 2Big Network v2 i 5Big Network v2) consisteixen en un nucli i el «initrd» per a U-Boot. Podeu aconseguir aquests fitxers des de &lacie-kirkwood-firmware-img;.
de: Die Installationsdateien für LaCie-NAS-Geräte (Network Space v2, Network Space Max v2, Internet Space v2, d2 Network v2, 2Big Network v2 und 5Big Network v2) bestehen aus einem Kernel und einer Initrd für U-Boot. Sie können diese Dateien von &lacie-kirkwood-firmware-img; herunterladen.
it: I file per l'installazione su NAS LaCie (Network Space v2, Network Space Max v2, Internet Space v2, d2 Network v2, 2Big Network v2 e 5Big Network v2) consistono di un kernel e un initrd per U-Boot. È possibile recuperare questi file da &lacie-kirkwood-firmware-img;.
nl: De installatiebestanden voor LaCie NAS'en (Network Space v2, Network Space Max v2, Internet Space v2, d2 Network v2, 2Big Network v2 en 5Big Network v2) bestaan uit een kernel en initrd voor U-Boot. U kunt deze bestanden ophalen van &lacie-kirkwood-firmware-img;.

source: Armhf Multiplatform Installation Files
ca: Fitxers d'instal·lació multiplataforma per a Armhf
de: Installationsdateien für Armhf-Multiplattform
it: File d'installazione per Armhf Multipiattaforma
nl: Installatiebestanden voor het Armhf Multiplatform

source: The installation files for systems supported by the armhf multiplatform kernel (see <xref linkend="armhf-armmp-supported-platforms"/>) consist of a standard Linux kernel image, a standard Linux initial ramdisk image and a system-specific device-tree blob. The kernel and the initial ramdisk image for tftp-booting can be obtained from &armmp-firmware-img; and the device-tree blob can be obtained from &armmp-dtb-img;. The tar archive for creating a bootable USB stick with the installer can be obtained from &armmp-hd-media-tarball;.
ca: Els fitxers d'instal·lació per a sistemes admesos pel nucli multiplataforma «armhf» (vegeu <xref linkend="armhf-armmp-supported-platforms"/>) consisteixen en una imatge del nucli estàndard de Linux, una imatge del disc de memòria inicial de Linux i un arbre de dispositius («device-tree blob») específic del sistema. El nucli i el disc de memòria inicial per arrencar amb tftp està disponible a &armmp-firmware-img; i l'arbre de dispositius a &armmp-dtb-img;. L'arxiu comprimit tipus «tar» per a preparar una memòria USB arrencable amb l'instal·lador està disponible a &armmp-hd-media-tarball;.
de: Die Installationsdateien für Systeme, welche vom armhf-Multiplattform-Kernel unterstützt werden (Näheres in <xref linkend="armhf-armmp-supported-platforms"/>), bestehen aus einem standardmäßigen Linux-Kernel-Image, einem standardmäßigen Linux-Initial-Ramdisk-Image und einem systemspezifischen Gerätebaum-Abbild. Den Kernel und das Initial-Ramdisk-Image für TFTP-Boot können Sie von &armmp-firmware-img; herunterladen, das Gerätebaum-Abbild finden Sie unter &armmp-dtb-img;, und das tar-Archiv zur Erstellung eines boot-fähigen USB-Sticks mit dem Installer unter &armmp-hd-media-tarball;.
it: I file per l'installazione su sistemi supportati dal kernel multipiattaforma armhf (vedere <xref linkend="armhf-armmp-supported-platforms"/>) consistono di un'immagine del kernel Linux, dell'immagine di un ramdisk iniziale e di blob con il device-tree specifico del sistema. Le immagini di kernel e ramdisk iniziale per l'avvio da tftp possono essere recuperate da &armmp-firmware-img; e il blob con il device-tree può essere recuperato da &armmp-dtb-img;. L'archivio tar per creare una chiavetta USB di avvio con l'installatore può essere recuperato da &armmp-hd-media-tarball;.
nl: De installatiebestanden voor systemen die ondersteund worden door de armhf multiplatform kernel (zie <xref linkend="armhf-armmp-supported-platforms"/>) bestaan uit een standaard Linux kernel-image, een standaard Linux initieel ramschijf-image en een systeemspecifieke blob (binair bestand) met de apparatenboom. De kernel en het initiële ramschijf-image die nodig zijn om via tftp op te starten, kunnen opgehaald worden van &armmp-firmware-img; en de blob met de apparatenboom kan opgehaald worden van &armmp-dtb-img;. Het tar-archief om een opstartbare USB-stick aan te maken met het installatiesysteem kan opgehaald worden van &armmp-hd-media-tarball;.

source: U-boot images for various armhf platforms are available at &armmp-uboot-img;.
ca: Imatges U-Boot per a diverses plataformes «armhf» estan disponibles a &armmp-uboot-img;.
de: U-boot-Images für verschiedene armhf-Plattformen sind unter &armmp-uboot-img; verfügbar.
it: Le immagini U-Boot per varie piataforme armhf sono disponibili su &armmp-uboot-img;.
nl: U-boot-images voor verschillende armhf-platformen kunnen opgehaald worden van &armmp-uboot-img;.

source: Creating Floppies from Disk Images
ca: Creació de disquets a partir d'imatges de disquet
de: Disketten erstellen aus den Disk-Images
it: Creazione dei dischetti partendo dalle immagini
nl: Diskettes maken met schijf-images

source: Bootable floppy disks are generally used as a last resort to boot the installer on hardware that cannot boot from CD or by other means.
ca: Normalment, els disquets arrencables es fan servir com a darrer recurs per arrencar l'instal·lador en maquinari que no pot arrencar des del CD o per altres mitjans.
de: Boot-fähige Disketten sind generell der letzte Ausweg, den Installer auf Hardware zu starten, auf der er nicht von CD oder auf anderem Wege gebootet werden kann.
it: I dischetti d'avvio sono generalmente l'ultima risorsa per far partire l'installatore sull'hardware che non può essere avviato da CD o da altri supporti.
nl: Opstartbare diskettes zijn over het algemeen een laatste redmiddel om het installatiesysteem op te starten op hardware waarmee men niet vanaf een CD of via andere methodes kan opstarten.

source: Booting the installer from floppy disk reportedly fails on Mac USB floppy drives.
ca: L'arrencada de l'instal·lador amb disquets falla en les unitats de disquet USB dels Mac.
de: Einen Mac per USB-Floppy-Laufwerk zu booten, schlägt fehl, wurde uns berichtet.
it: È stato riscontrato che su Mac l'avvio dell'installatore dal dischetto non funziona con i lettori USB.
nl: Het installatiesysteem opstarten vanaf een diskette mislukt naar verluidt bij USB diskettestations op de Mac.

source: Disk images are files containing the complete contents of a floppy disk in <emphasis>raw</emphasis> form. Disk images, such as <filename>boot.img</filename>, cannot simply be copied to floppy drives. A special program is used to write the image files to floppy disk in <emphasis>raw</emphasis> mode. This is required because these images are raw representations of the disk; it is required to do a <emphasis>sector copy</emphasis> of the data from the file onto the floppy.
ca: Les imatges de disquet són fitxers que contenen, <emphasis>en pla (raw)</emphasis>, el contingut sencer d'un disquet. Igual com en el cas del fitxer <filename>boot.img</filename>, no hi ha prou de copiar-les al disquet. Cal fer servir un programa que escriu la imatge <emphasis>en pla</emphasis> al disquet. Això és així perquè aquestes imatges són representacions exactes del disquet; cal fer una <emphasis>còpia per sectors</emphasis> de les dades del fitxer al disquet.
de: Disk-Images sind Dateien, die den kompletten Inhalt einer Diskette (Floppy) in <emphasis>roher</emphasis> Form enthalten. Disk-Images wie <filename>boot.img</filename> können nicht einfach auf eine Diskette kopiert werden. Es wird ein spezielles Programm benutzt, um die Image-Datei in <emphasis>roher</emphasis> Form auf die Diskette zu schreiben, da es erforderlich ist, eine <emphasis>Sektor-Kopie (sector copy)</emphasis> der Daten aus der Datei auf die Diskette zu machen.
it: Le immagini del disco sono dei file che hanno tutto il contenuto di un dischetto in formato <emphasis>raw</emphasis>. Le immagini dei dischi, come <filename>boot.img</filename>, non possono essere semplicemente copiate sul dischetto. Per scrivere i file immagine in formato <emphasis>raw</emphasis> è necessario usare un programma speciale perché le immagini sono la rappresentazione grezza del disco e quindi si deve fare una <emphasis>copia per settori</emphasis> dei dati dal file sul dischetto.
nl: Schijf-images zijn bestanden die de volledige inhoud van een diskette in <emphasis>ruwe</emphasis> vorm bevatten. Schijf-images, zoals <filename>boot.img</filename>, kunnen niet gewoon gekopieerd worden naar een diskette. Er wordt een speciaal programma gebruikt om de image-bestanden naar diskette te schrijven in <emphasis>ruwe</emphasis> modus. Dit is noodzakelijk omdat deze images een afbeelding zijn van de schijf in ruwe vorm. Het is nodig dat het image-bestand <emphasis>sector per sector gekopieerd wordt</emphasis> naar de diskette.

source: There are different techniques for creating floppies from disk images. This section describes how to create floppies from disk images on different platforms.
ca: Hi ha mètodes diferents per preparar disquets d'imatges de disquet. Aquesta secció descriu com fer-ho des de les imatges de disc en diverses plataformes.
de: Es gibt unterschiedliche Techniken, Disketten aus Disk-Images zu erzeugen. Dieses Kapitel beschreibt für verschiedene Plattformen, wie man aus Disk-Images Disketten erstellt.
it: Ci sono varie tecniche per creare i dischetti dalle immagini. In questa sezione è descritto come creare i dischetti a partire dalle immagini su diverse piattaforme.
nl: Er bestaan verschillende technieken om op basis van een schijf-image een diskette te maken. Dit onderdeel beschrijft hoe u op verschillende platformen van een schijf-image een diskette maakt.

source: Before you can create the floppies, you will first need to download them from one of the &debian; mirrors, as explained in <xref linkend="downloading-files"/>. <phrase arch="i386">If you already have an installation CD-ROM or DVD, the floppy images may also be included on the CD/DVD.</phrase>
ca: Abans de preparar els disquets, haureu de descarregar-los primer des de les repliques de &debian;, com s'explica a <xref linkend="downloading-files"/>. <phrase arch="i386">Si ja teniu un CD-ROM o DVD d'instal·ació, les imatges dels disquets poden estar també incloses al CD/DVD.</phrase>
de: Bevor Sie die Disketten erstellen können, müssen Sie die Images von einem der &debian;-Spiegel-Server herunterladen, wie in <xref linkend="downloading-files"/> beschrieben. <phrase arch="i386">Falls Sie bereits eine Installations-CD-ROM oder -DVD vorliegen haben, könnten die Disketten-Images bereits auf dieser CD/DVD enthalten sein.</phrase>
it: Prima di poter creare i dischetti è necessario scaricarli da uno dei mirror &debian; come spiegato in <xref linkend="downloading-files"/>. <phrase arch="i386">Se si dispone di un CD-ROM o di un DVD d'installazione, le immagini dei dischetti potrebbero essere presenti anche sul CD/DVD.</phrase>
nl: Vooraleer u de diskettes kunt maken, zult u ze eerste moeten downloaden van een van de &debian; spiegelservers, zoals uitgelegd wordt in <xref linkend="downloading-files"/>. <phrase arch="i386">Indien u al een installatie-CD of -DVD heeft, kunnen de diskette-images ook op de CD/DVD staan.</phrase>

source: No matter which method you use to create your floppies, you should remember to flip the write-protect tab on the floppies once you have written them, to ensure they are not damaged unintentionally.
ca: Independentment del mètode emprat, recordeu que hauríeu de blocar els disquets contra l'escriptura una vegada els hàgiu escrit, per cerciorar-vos que no s'espatllen accidentalment.
de: Unabhängig davon, welche Methode Sie benutzen: sobald das Image auf die Disk geschrieben wurde, sollten Sie den Schreibschutz der Diskette aktivieren, um ein unbeabsichtigtes Überschreiben zu vermeiden.
it: Indipendentemente dal metodo usato per creare i dischetti è importante ricordarsi di spostare la linguetta di protezione dalla scrittura una volta che sono stati scritti per essere sicuri di non danneggiarli inavvertitamente.
nl: Ongeacht de gebruikte methode om uw diskettes aan te maken, moet u eraan denken om het lipje om de diskettes tegen schrijven te beveiligen, te sluiten nadat u ze beschreven heeft, zodat u zeker bent dat ze niet onbedoeld beschadigd kunnen worden.

source: Writing Disk Images From a Linux or Unix System
ca: Confecció de les imatges de disquet en un sistema Linux o Unix
de: Disk-Images mittels eines Linux- oder Unix-Systems schreiben
it: Scrittura delle immagini dei dischi da sistemi Linux o Unix
nl: Schijf-images schrijven met een Linux- of Unix-systeem

source: To write the floppy disk image files to the floppy disks, you will probably need root access to the system. Place a good, blank floppy in the floppy drive. Next, use the command <informalexample><screen> $ dd if=<replaceable>filename</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> where <replaceable>filename</replaceable> is one of the floppy disk image files. <filename>/dev/fd0</filename> is a commonly used name of the floppy disk device, it may be different on your workstation<phrase arch="sparc"> (on Solaris, it is <filename>/dev/fd/0</filename>)</phrase>. The command may return to the prompt before Unix has finished writing the floppy disk, so look for the disk-in-use light on the floppy drive and be sure that the light is out and the disk has stopped revolving before you remove it from the drive. On some systems, you'll have to run a command to eject the floppy from the drive <phrase arch="sparc"> (on Solaris, use <command>eject</command>, see the manual page)</phrase>.
ca: Per a escriure imatges de disquet als disquets, probablement us caldrà tenir accés de superusuari al sistema. Poseu un disquet verge i en bon estat a la disquetera. Després, feu servir l'ordre <informalexample><screen> $ dd if=<replaceable>nom-de-fitxer</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> on <replaceable>nom-de-fitxer</replaceable> és un dels fitxers imatge del disquet. <filename>/dev/fd0</filename> és el nom usual de dispositiu per a la disquetera, però podria ser diferent en la vostra màquina <phrase arch="sparc"> (a Solaris, és <filename>/dev/fd/0</filename>)</phrase>. Potser se us retornarà a l'indicador abans que Unix haja acabat el procés d'escriptura del disquet, per tant mireu el pilot de la disquetera per assegurar-vos que el llum està apagat i que el disquet ha parat de fer voltes abans d'extraure'l. En alguns sistemes cal una ordre per expulsar-lo<phrase arch="sparc"> (a Solaris, empreu <command>eject</command>, consulteu el manual)</phrase>.
de: Um ein Floppy-Disk-Image auf die Diskette zu schreiben, benötigen Sie unter Umständen root-Rechte auf dem System. Legen Sie eine unbeschädigte, leere Diskette in das Laufwerk ein. Nutzen Sie dann den Befehl <informalexample><screen> $ dd if=<replaceable>filename</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> wobei <replaceable>filename</replaceable> eine der Floppy-Disk-Imagedateien ist. <filename>/dev/fd0</filename> ist eine allgemein benutzte Bezeichnung für das Diskettenlaufwerk; auf Ihrem Rechner könnte sie sich jedoch unterscheiden<phrase arch="sparc"> (auf Solaris-Maschinen ist es <filename>/dev/fd/0</filename>)</phrase>. Das Kommando könnte bereits auf den Prompt zurückkehren, bevor der Schreibvorgang abgeschlossen ist, also achten Sie auf die Laufwerkszugriffs-Leuchte am Gerät und entfernen Sie die Disk erst, wenn die Lampe aus ist und nicht mehr auf die Diskette zugegriffen wird/ wenn sie sich nicht mehr dreht. Auf einigen Systemen müssen Sie einen Befehl ausführen, um die Disk auszuwerfen<phrase arch="sparc"> (auf Solaris-Maschinen benutzen Sie dazu <command>eject</command>, siehe die entsprechende Handbuchseite)</phrase>.
it: Per scrivere i file con le immagini dei dischetti potrebbe essere necessario avere accesso al sistema come root. Inserire un dischetto vergine nel lettore e poi usare il comando <informalexample><screen> $ dd if=<replaceable>nomefile</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> dove <replaceable>nomefile</replaceable> è uno dei file immagine del dischetto. <filename>/dev/fd0</filename> è comunemente il nome del device del dischetto, sulla propria macchina potrebbe essere diverso<phrase arch="sparc"> (su Solaris è <filename>/dev/fd/0</filename>)</phrase>. Il comando potrebbe restituire il prompt dei comandi prima che Unix abbia finito di scrivere sul dischetto quindi prima di rimuoverlo dal lettore assicurarsi che la spia sia spenta e che il dischetto si sia fermato. Su alcuni sistemi è necessario usare un comando per far uscire il dischetto dal lettore<phrase arch="sparc"> (su Solaris usare <command>eject</command>, si consulti la pagina man)</phrase>.
nl: Om de image-bestanden van de diskettes op een diskette te schrijven, zult u wellicht over beheerdersrechten op het systeem moeten beschikken. Plaats een goede, lege diskette in het diskettestation. Gebruik vervolgens het commando<informalexample><screen> $ dd if=<replaceable>bestandsnaam</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample>, waarbij <replaceable>bestandsnaam</replaceable> één van de image-bestanden voor de diskettes is. <filename>/dev/fd0</filename> is een gebruikelijke naam voor het diskettestation, maar het kan op uw werkstation anders zijn<phrase arch="sparc"> (op Solaris is het <filename>/dev/fd/0</filename>)</phrase>. Het commando kan naar de prompt terugkeren vooraleer Unix klaar is met het schrijven van de diskette. U moet dus het lampje dat aangeeft dat het diskettestation in gebruik is, in het oog houden en er zeker van zijn dat het lampje uit is en het schijfje niet meer draait, vooraleer u het uit het station haalt. Op sommige systemen zult u een commando moeten geven om de diskette uit het diskettestation te werpen <phrase arch="sparc"> (op Solaris moet u het commando <command>eject</command> gebruiken; raadpleeg de man-pagina)</phrase>.
