Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: One free software DHCP server is ISC <command>dhcpd</command>. For &debian-gnu;, the <classname>isc-dhcp-server</classname> package is recommended. Here is a sample configuration file for it (see <filename>/etc/dhcp/dhcpd.conf</filename>):
ca: Un servidor que és programari gratuït de DHCP és el <command>dhcpd</command> d'ISC. A &debian-gnu;, es recomana utilitzar el paquet <classname>isc-dhcp-server</classname>. Hi ha un fitxer d'exemple de configuració per utilitzar-lo (normalment <filename>/etc/dhcpd3/dhcpd.conf</filename>):
de: Ein Free-Software-DHCP-Server ist der ISC-<command>dhcpd</command>. Für &debian-gnu; wird das <classname>isc-dhcp-server</classname>-Paket empfohlen. Hier eine beispielhafte Konfigurationsdatei (siehe <filename>/etc/dhcp/dhcpd.conf</filename>):
it: Un server DHCP libero è <command>dhcpd</command> di ISC. In &debian-gnu; si raccomanda il pacchetto <classname>isc-dhcp-server</classname>. Segue un esempio del file di configurazione per questo server (di solito <filename>/etc/dhcp/dhcpd.conf</filename>):
nl: Een DHCP-server uit vrije software is ISC <command>dhcpd</command>. Voor &debian-gnu; wordt het pakket <classname>isc-dhcp-server</classname> aanbevolen. Hierna volgt een voorbeeld van een configuratiebestand ervoor (zie <filename>/etc/dhcp/dhcpd.conf</filename>):

source: option domain-name "example.com"; option domain-name-servers ns1.example.com; option subnet-mask 255.255.255.0; default-lease-time 600; max-lease-time 7200; server-name "servername"; subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option routers 192.168.1.1; } host clientname { filename "/tftpboot.img"; server-name "servername"; next-server servername; hardware ethernet 01:23:45:67:89:AB; fixed-address 192.168.1.90; }
nl: option domain-name "example.com"; option domain-name-servers ns1.example.com; option subnet-mask 255.255.255.0; default-lease-time 600; max-lease-time 7200; server-name "servernaam"; subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option routers 192.168.1.1; } host cliëntnaam { filename "/tftpboot.img"; server-name "servernaam"; next-server servernaam; hardware ethernet 01:23:45:67:89:AB; fixed-address 192.168.1.90; }

source: In this example, there is one server <replaceable>servername</replaceable> which performs all of the work of DHCP server, TFTP server, and network gateway. You will almost certainly need to change the domain-name options, as well as the server name and client hardware address. The <replaceable>filename</replaceable> option should be the name of the file which will be retrieved via TFTP.
ca: En aquest exemple, hi ha un servidor <replaceable>servername</replaceable> que fa tota la feina del servidor DHCP, servidor de TFTP i passarel·la de xarxa. És quaasi segur que necessitareu canviar les opcions «domain-name», i també el nom del servidor i l'adreça màquina del client. L'opció <replaceable>filename</replaceable> hauria de ser el nom del fitxer que es descarregarà per TFTP.
de: In diesem Beispiel gibt es einen Server <replaceable>servername</replaceable>, der alle Aufgaben von DHCP-Server, TFTP-Server und Netzwerk-Gateway übernimmt. Sie müssen natürlich die Domain-Namen-Einträge ändern wie auch den Servernamen und die Hardware-Adresse der Clients. Der Eintrag <replaceable>filename</replaceable> sollte der Name der Datei sein, die per TFTP abgerufen wird.
it: In questo esempio c'è una macchina <replaceable>servername</replaceable> che fa da server DHCP, da server TFTP e da gateway di rete. Sicuramente è necessario cambiare le opzioni domain-name, il nome del server e anche l'indirizzo hardware del client. Il valore dell'opzione <replaceable>filename</replaceable> deve essere il nome del file che verrà recuperato tramite TFTP.
nl: In dit voorbeeld is er één server <replaceable>servernaam</replaceable> die als DHCP-server, TFTP-server en netwerk-gateway fungeert. U zult bijna zeker de 'domain-name' opties moeten aanpassen, evenals de servernaam en het hardware-adres van de cliënt. De optie <replaceable>filename</replaceable> moet de naam vermelden van het bestand dat via TFTP opgehaald zal worden.

source: After you have edited the <command>dhcpd</command> configuration file, restart it with <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.
ca: Després d'editar el fitxer de configuració del <command>dhcpd</command>, reengegueu-lo amb <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.
de: Nachdem Sie die Konfigurationsdatei des <command>dhcpd</command> verändert haben, starten Sie ihn mit <userinput>/etc/init.d/isc-dhcp-server restart</userinput> neu.
it: Dopo aver modificato il file di configurazione di <command>dhcpd</command> riavviarlo con <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.
nl: Nadat u het configuratiebestand voor <command>dhcpd</command> aangepast heeft, moet u de achtergronddienst herstarten met <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.

source: Enabling PXE Booting in the DHCP configuration
ca: Habilitar l'arrencada amb PXE a la configuració del servidor de DHCP
de: PXE-Boot aktivieren in der DHCP-Konfiguration
it: Abilitare l'avvio PXE nella configurazione di DHCP
nl: In de configuratie van DHCP het opstarten via PXE aanzetten

source: Here is another example for a <filename>dhcp.conf</filename> using the Pre-boot Execution Environment (PXE) method of TFTP. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # The next paragraph needs to be modified to fit your case subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # the gateway address which can be different # (access to the internet for instance) option routers 192.168.1.1; # indicate the dns you want to use option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "pxelinux.0"; } } </screen></informalexample> Note that for PXE booting, the client filename <filename>pxelinux.0</filename> is a boot loader, not a kernel image (see <xref linkend="tftp-images"/> below).
ca: Aquí teniu un altre exemple de <filename>dhcp.conf</filename> que fa servir el mètode Pre-boot Execution Environment (PXE) de TFTP. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # El paràgraf següent necessita modificar per ajustar-lo al vostre cas subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # la adreça de la passarel·la podria ser diferent # (l'accés a Internet de exemple) option routers 192.168.1.1; # poseu el dns que utilitzeu option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # adreça màquina del client tftp hardware ethernet 00:10:DC:27:6C:15; filename "pxelinux.0"; } } </screen></informalexample> Adoneu-vos que en l'arrencada amb PXE, el fitxer client de nom <filename>pxelinux.0</filename> és el carregador de l'arrencada, no una imatge del nucli (vegeu <xref linkend="tftp-images"/> més endevant).
de: Hier ein weiteres Beispiel der <filename>dhcpd.conf</filename>, das die Pre-Boot-Execution-Environment-(PXE)Methode von TFTP nutzt: <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # Der nächste Abschnitt muss unter Umständen an Ihre # Situation angepasst werden. subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # die Gateway-Adresse, die bei Ihnen unterschiedlich sein kann # (z.B. für den Zugriff auf das Internet) option routers 192.168.1.1; # Geben Sie die DNS an, die Sie nutzen möchten option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # Hardware-Adresse des tftp-Clients hardware ethernet 00:10:DC:27:6C:15; filename "pxelinux.0"; } } </screen></informalexample> Beachten Sie, dass im Fall von PXE die Client-Datei <filename>pxelinux.0</filename> ein Bootloader ist, kein Kernel-Image (siehe <xref linkend="tftp-images"/> weiter unten).
it: Questo è un altro esempio di <filename>dhcp.conf</filename> che usa il metodo PXE (Pre-boot Execution Environment) di TFTP. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # The next paragraph needs to be modified to fit your case subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # the gateway address which can be different # (access to the internet for instance) option routers 192.168.1.1; # indicate the dns you want to use option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "pxelinux.0"; } } </screen></informalexample> Notare che con l'avvio PXE, il nome del file client <filename>pxelinux.0</filename> è il bootloader, non l'immagine del kernel (si consulti <xref linkend="tftp-images"/>).
nl: Hier volgt nog een voorbeeld van het bestand <filename>dhcp.conf</filename> waarin de methode Pre-boot Execution Environment (PXE) van TFTP gebruikt wordt. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # De volgende paragraaf moet aangepast worden aan uw geval subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # het gateway-adres kan anders zijn # (bijvoorbeeld toegang tot het internet) option routers 192.168.1.1; # vermeld de dns-server die u wilt gebruiken option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # hardware-adres van de tftp-cliënt hardware ethernet 00:10:DC:27:6C:15; filename "pxelinux.0"; } } </screen></informalexample> Merk op dat bij het opstarten via PXE het bestand <filename>pxelinux.0</filename> een opstartlader is voor de cliënt en geen kernel-image (zie <xref linkend="tftp-images"/> hieronder).

source: If your machine uses UEFI to boot, you will have to specify a boot loader appropriate for UEFI machines, for example
de: Wenn Ihr Rechner per UEFI bootet, müssen Sie einen für UEFI passenden Bootloader angeben, z.B. mit
it: Chi utilizza una macchina con avvio UEFI deve indicare un boot loader idoneo, per esempio
nl: Indien uw computer gebruik maakt van UEFI bij het opstarten, zult u een voor UEFI-machines geschikte opstartlader moeten opgeven, bijvoorbeeld

source: group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "debian-installer/amd64/bootnetx64.efi"; } }
nl: group { next-server 192.168.1.3; host tftpclient { # hardware-adres van de tftp-cliënt hardware ethernet 00:10:DC:27:6C:15; filename "debian-installer/amd64/bootnetx64.efi"; } }

source: Setting up a BOOTP server
ca: Configurar un servidor BOOTP
de: Einen BOOTP-Server einrichten
it: Attivazione di un server BOOTP
nl: Een BOOTP-server opzetten

source: There are two BOOTP servers available for GNU/Linux. The first is CMU <command>bootpd</command>. The other is actually a DHCP server: ISC <command>dhcpd</command>. In &debian-gnu; these are contained in the <classname>bootp</classname> and <classname>isc-dhcp-server</classname> packages respectively.
ca: Hi ha dos servidors de BOOTP a GNU/Linux. El primér és el <command>bootpd</command> de CMU. L'altre és també un servidor de DHCP, el <command>dhcpd</command> de ISC. A &debian-gnu; són als paquets <classname>bootp</classname> i <classname>isc-dhcp-server</classname> respectivament.
de: Es gibt für GNU/Linux zwei BOOTP-Server: erstens den <command>bootpd</command> (CMU) und der zweite ist eigentlich ein DHCP-Server, der <command>dhcpd</command> (ISC). Sie sind in den &debian-gnu;-Paketen <classname>bootp</classname> bzw. <classname>isc-dhcp-server</classname> enthalten.
it: Per GNU/Linux sono disponibili due server BOOTP. Il primo è <command>bootpd</command> di CMU, l'altro è un server DHCP: <command>dhcpd</command> di ISC. Questi server sono rispettivamente contenuti nei pacchetti &debian-gnu; <classname>bootp</classname> e <classname>isc-dhcp-server</classname>.
nl: Voor GNU/Linux zijn twee BOOTP-servers beschikbaar. De eerste is CMU <command>bootpd</command>. De andere is in feite een DHCP-server: ISC <command>dhcpd</command>. In &debian-gnu; zijn ze respectievelijk te vinden in het pakket <classname>bootp</classname> en het pakket <classname>isc-dhcp-server</classname>.

source: To use CMU <command>bootpd</command>, you must first uncomment (or add) the relevant line in <filename>/etc/inetd.conf</filename>. On &debian-gnu;, you can run <userinput>update-inetd --enable bootps</userinput>, then <userinput>/etc/init.d/inetd reload</userinput> to do so. Just in case your BOOTP server does not run &debian;, the line in question should look like: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> Now, you must create an <filename>/etc/bootptab</filename> file. This has the same sort of familiar and cryptic format as the good old BSD <filename>printcap</filename>, <filename>termcap</filename>, and <filename>disktab</filename> files. See the <filename>bootptab</filename> manual page for more information. For CMU <command>bootpd</command>, you will need to know the hardware (MAC) address of the client. Here is an example <filename>/etc/bootptab</filename>: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> You will need to change at least the <quote>ha</quote> option, which specifies the hardware address of the client. The <quote>bf</quote> option specifies the file a client should retrieve via TFTP; see <xref linkend="tftp-images"/> for more details. <phrase arch="mips"> On SGI machines you can just enter the command monitor and type <userinput>printenv</userinput>. The value of the <userinput>eaddr</userinput> variable is the machine's MAC address. </phrase>
ca: Per fer servir el <command>bootpd</command> de CMU, elimineu el comentari (o bé afegiu) la línia important al <filename>/etc/inetd.conf</filename>. A &debian-gnu;, podeu executar <userinput>update-inetd --enable bootps</userinput>, i després <userinput>/etc/init.d/inetd reload</userinput> per aconseguir-ho. En el cas que el servidor BOOTP no utilitze &debian;, la línia en qüestió seria com aquesta: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> Ara, podeu generar un fitxer <filename>/etc/bootptab</filename>. Aquest té el mateix tipus de format críptic i familiar que els antics fitxers de BSD <filename>printcap</filename>, <filename>termcap</filename>, i <filename>disktab</filename>. Vegeu la pàgina de manual del <filename>bootptab</filename> per obtenir més informació. Pel <command>bootpd</command> de CMU, necessitareu saber l'adreça màquina (MAC) del client. A continuació teniu exemple de <filename>/etc/bootptab</filename>: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> Necessitareu canviar al menys l'opció <quote>ha</quote>, que especifica l'adreça màquina del client. L'opció <quote>bf</quote> especifica quin fitxer hauria de descarregar un client via TFTP; per a més detalls, vegeu <xref linkend="tftp-images"/>. <phrase arch="mips"> En màquines SGI tan sols heu d'introduir l'ordre monitor i escriure <userinput>printenv</userinput>. El valor de la variable <userinput>eaddr</userinput> és l'adreça màquina (MAC).</phrase>
de: Um den <command>bootpd</command> (CMU) zu nutzen, müssen Sie als erstes für die entsprechende Zeile in <filename>/etc/inetd.conf</filename> das Kommentarzeichen entfernen (bzw. die Zeile hinzufügen, falls noch nicht vorhanden). Unter &debian-gnu; erledigen Sie das mit <userinput>update-inetd --enable bootps</userinput> und anschließendem <userinput>/etc/init.d/inetd reload</userinput>. Für den Fall, dass Ihr Bootp-Server nicht unter &debian; läuft, sollte die fragliche Zeile so aussehen: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> Jetzt müssen Sie die Datei <filename>/etc/bootptab</filename> erstellen. Sie hat das gewohnte kryptische Format wie die guten alten BSD-Dateien <filename>printcap</filename>, <filename>termcap</filename> und <filename>disktab</filename>. Mehr Informationen bekommen Sie in der Handbuchseite von <filename>bootptab</filename>. Beim CMU-<command>bootpd</command> müssen Sie die Hardware-(MAC-)Adresse des Clients kennen. Hier ein Beispiel für <filename>/etc/bootptab</filename>: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> Sie müssen zumindest den Eintrag <quote>ha</quote> anpassen, der die Hardware-Adresse des Clients angibt. Der Eintrag <quote>bf</quote> legt fest, welche Datei der Client per TFTP bezieht; <xref linkend="tftp-images"/> enthält mehr Details. <phrase arch="mips"> Auf SGI-Maschinen können Sie einfach den Command Monitor benutzen und dort <userinput>printenv</userinput> eingeben. Der Wert der Variable <userinput>eaddr</userinput> ist die MAC-Adresse des Rechners. </phrase>
it: Per usare <command>bootpd</command> di CMU è necessario togliere i commenti (o aggiungere) la relativa riga in <filename>/etc/inetd.conf</filename>. Su &debian-gnu; è possibile usare <userinput>update-inetd --enable bootps</userinput> e poi <userinput>/etc/init.d/inetd reload</userinput> per fare questa operazione. Solo nel caso in cui il proprio server BOOTP non sia &debian;, la riga in questione dovrebbe essere simile a questa: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> Adesso è necessario creare il file <filename>/etc/bootptab</filename>. Questo file ha lo stesso formato criptico dei file <filename>printcap</filename>, <filename>termcap</filename> e <filename>disktab</filename> di BSD. Vedere la pagina di manuale di <filename>bootptab</filename> per maggiori informazioni. Per <command>bootpd</command> di CMU è necessario conoscere qual è l'indirizzo hardware (MAC) del client. Questo è un esempio di <filename>/etc/bootptab</filename>: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> È necessario cambiare almeno l'opzione <quote>ha</quote> che specifica l'indirizzo hardware del client. L'opzione <quote>bf</quote> specifica quale file deve essere recuperato dal client tramite TFTP; si consulti <xref linkend="tftp-images"/> per ulteriori dettagli. <phrase arch="mips"> Sulle macchine SGI si può usare il commando monitor e inserire <userinput>printenv</userinput>. Il valore della variabile <userinput>eaddr</userinput> è l'indirizzo MAC della macchina. </phrase>
nl: Om de CMU <command>bootpd</command> te gebruiken, moet u eerst in het bestand <filename>/etc/inetd.conf</filename> de juiste regel toevoegen of het commentaarteken dat aan het begin ervan staat, wegnemen. Op &debian-gnu; kunt u daarvoor het commando <userinput>update-inetd --enable bootps</userinput> geven en dan het commando <userinput>/etc/init.d/inetd reload</userinput>. In het geval uw BOOTP-server niet op een &debian;-systeem staat, moet de regel in kwestie er zo uitzien: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> Nu moet u een bestand <filename>/etc/bootptab</filename> aanmaken. Dit heeft hetzelfde soort bekende en cryptische indeling als de goede oude BSD-bestanden <filename>printcap</filename>, <filename>termcap</filename> en <filename>disktab</filename>. Raadpleeg de man-pagina van <filename>bootptab</filename> voor meer informatie. Voor CMU <command>bootpd</command> moet u het hardware-adres (MAC) van de cliënt kennen. Hierna is een voorbeeld van een <filename>/etc/bootptab</filename>-bestand: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> U zult minstens de optie<quote>ha</quote> moeten aanpassen. Die preciseert het hardware-adres van de cliënt. De optie <quote>bf</quote> preciseert het bestand dat de cliënt moet ophalen via TFTP. Zie <xref linkend="tftp-images"/> voor verdere details. <phrase arch="mips"> Op SGI-machines kunt u gewoon naar de 'command monitor' (hulpmiddel voor het superviseren en manipuleren van de opstartomgeving) gaan en <userinput>printenv</userinput> typen. De waarde van de variabele <userinput>eaddr</userinput> is het MAC-adres van de machine. </phrase>
