Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: An alternative way to set up your USB stick is to manually copy the installer files, and also a CD image to it. Note that the USB stick should be at least 1 GB in size (smaller setups are possible if you follow <xref linkend="usb-copy-flexible"/>).
ca: Una possibilitat alternativa per a preparar la vostra memòria USB és copiant-hi els fitxers de l'instal·lador i també una imatge de CD. Fixeu-vos que el llapis USB ha de tenir una mida mínima de 1 GiB (és possible configurar un llapis amb menys capacitat com es descriu a la <xref linkend="usb-copy-flexible"/>).
de: Ein alternativer Weg zur Einrichtung des USB-Sticks ist das manuelle Kopieren der Installer-Dateien und eines CD-Images auf den Stick. Beachten Sie, dass der USB-Stick idealerweise mindestens 1 GB groß sein sollte (kleinere Setups sind möglich, wenn Sie gemäß <xref linkend="usb-copy-flexible"/> vorgehen).
it: Un metodo alternativo per preparare la chiavetta USB è copiare manualmente i file dell'installatore e l'immagine del CD sulla chiavetta. Notare che la chiavetta USB deve essere da almeno 1&nbsp;GB (è possibile fare anche installazioni più piccole seguendo <xref linkend="usb-copy-flexible"/>).
nl: Een andere manier om uw USB-stick klaar te maken, is door er handmatig de bestanden van het installatiesysteem op te plaatsen samen met een CD-image. Merk op dat de USB-stick minstens 1 GB groot moet zijn (het kan met een kleinere grootte als u de richtlijnen in <xref linkend="usb-copy-flexible"/> volgt).

source: There is an all-in-one file <filename>hd-media/boot.img.gz</filename> which contains all the installer files (including the kernel) <phrase arch="x86">as well as <classname>syslinux</classname> and its configuration file</phrase> <phrase arch="powerpc">as well as <classname>yaboot</classname> and its configuration file</phrase>.
ca: Hi ha un fitxer complet <filename>hd-media/boot.img.gz</filename> que conté tots el fitxers de l'instal·lador (incloent el nucli) <phrase arch="x86"> així com <command>syslinux</command> i el seu fitxer de configuració</phrase><phrase arch="powerpc">així com <classname>yaboot</classname> i el seu fitxer de configuració</phrase>.
de: Es gibt ein Komplett-Image <filename>hd-media/boot.img.gz</filename>, das alle Dateien des Installers enthält (inklusive Kernel)<phrase arch="x86"> sowie den Bootloader <classname>syslinux</classname> mit der zugehörigen Konfigurationsdatei</phrase><phrase arch="powerpc"> sowie den Bootloader <classname>yaboot</classname> mit der zugehörigen Konfigurationsdatei</phrase>.
it: C'è un file all-in-one <filename>hd-media/boot.img.gz</filename> che contiene non solo tutti i file dell'installatore (kernel compreso) <phrase arch="x86">ma anche <classname>syslinux</classname> e il suo file di configurazione.</phrase> <phrase arch="powerpc">ma anche <classname>yaboot</classname> e il suo file di configurazione.</phrase>
nl: Er bestaat een alles-in-één bestand <filename>hd-media/boot.img.gz</filename> dat al de bestanden van het installatiesysteem bevat (met inbegrip van de kernel) <phrase arch="x86">evenals <classname>syslinux</classname> en zijn configuratiebestand</phrase> <phrase arch="powerpc">evenals <classname>yaboot</classname> en zijn configuratiebestand</phrase>.

source: Note that, although convenient, this method does have one major disadvantage: the logical size of the device will be limited to 1 GB, even if the capacity of the USB stick is larger. You will need to repartition the USB stick and create new file systems to get its full capacity back if you ever want to use it for some different purpose.
ca: Fixeu-vos que, tot i semblar còmode, aquest mètode té un desavantatge: la mida lògica del dispositiu estarà limitada a 1 GiB, encara que la capacitat del llapis USB sigui superior. Si voleu utilitzar-lo per a altres propòsits haureu de tornar a partir el llapis USB i generar nous sistemes de fitxers per disposar de tota la seva capacitat.
de: Bedenken Sie, dass diese Methode, obwohl sie bequem ist, einen gravierenden Nachteil hat: die logische Größe des Sticks ist auf 1 GB begrenzt, auch wenn die Kapazität des USB-Sticks eigentlich größer ist. Falls Sie den Stick jemals wieder für einen anderen Zweck verwenden und die volle Kapazität zurückbekommen möchten, müssen Sie ihn neu paritionieren und die Dateisysteme neu erstellen.
it: Notare che, nonostante la sua comodità, questo metodo ha lo svantaggio che la dimensione logica del device è limitata a 1&nbsp;GB anche quando la capacità della chiavetta USB è superiore. Per poter ripristinare la capacità reale della chiavetta USB è necessario ripartizionarla e creare dei nuovi filesystem.
nl: Merk op dat hoewel deze methode handig is, ze een belangrijk nadeel heeft: de logische grootte van het apparaat wordt beperkt tot 1 GB, zelfs als de USB-stick een grotere capaciteit heeft. U zult de USB-stick opnieuw moeten indelen in partities en er opnieuw een bestandssysteem op moeten creëren om zijn volledige capaciteit terug te winnen, als u hem ooit voor andere doeleinden wilt gebruiken.

source: To use this image simply extract it directly to your USB stick:
ca: Per utilitzar aquesta imatge heu d'extreure-la directament al llapis USB:
de: Um oben erwähntes Komplett-Image zu verwenden, extrahieren Sie es einfach direkt auf Ihren USB-Stick:
it: Per utilizzare questa immagine è sufficiente estrarla direttamente sulla chiavetta USB:
nl: Om dit image te gebruiken, moet u het gewoon direct naar uw USB-stick uitpakken:

source: Create a partition of type "Apple_Bootstrap" on your USB stick using <command>mac-fdisk</command>'s <userinput>C</userinput> command and extract the image directly to that:
ca: Feu una partició de tipus «Apple_Bootstrap» al vostre llapis USB utilitzant l'ordre <userinput>C</userinput> del <command>mac-fdisk</command> i extraieu-hi la imatge directament:
de: Erstellen Sie eine Partition des Typs <quote>Apple_Bootstrap</quote> auf Ihrem USB-Stick, indem Sie das Kommando <userinput>C</userinput> von <command>mac-fdisk</command> verwenden. Entpacken Sie dann das Image direkt dorthin:
it: Creare una partizione di tipo <quote>Apple_Bootstrap</quote> sulla chiavetta USB usando il comando <userinput>C</userinput> di <command>mac-fdisk</command> ed estrarre l'immagine direttamente sulla chiavetta USB:
nl: Maak op uw USB-stick een partitie van het type "Apple_Bootstrap" aan met het commando <userinput>C</userinput> van <command>mac-fdisk</command> en pak het image er rechtstreeks naar uit:

source: After that, mount the USB memory stick <phrase arch="x86">(<userinput>mount /dev/<replaceable>sdX</replaceable> /mnt</userinput>),</phrase> <phrase arch="powerpc">(<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>),</phrase> which will now have <phrase arch="x86">a FAT filesystem</phrase> <phrase arch="powerpc">an HFS filesystem</phrase> on it, and copy a &debian; ISO image (netinst or full CD) to it. Unmount the stick (<userinput>umount /mnt</userinput>) and you are done.
ca: Després d'això, munteu el llapis de memòria USB <phrase arch="x86">(<userinput>mount /dev/<replaceable>sdX</replaceable> /mnt</userinput>),</phrase><phrase arch="powerpc">(<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>),</phrase> que ara tindrà <phrase arch="x86">un sistema de fitxers FAT,</phrase><phrase arch="powerpc">un sistema de fitxers HFS,</phrase> i copieu-hi una imatge &debian; ISO («netinst» o un CD complet). Finalment, desmunteu el llapis (<userinput>umount /mnt</userinput>) i ja esteu preparats.
de: Binden Sie danach den USB-Memory-Stick ins Dateisystem ein<phrase arch="x86"> (<userinput>mount /dev/<replaceable>sdX</replaceable> /mnt</userinput>)</phrase><phrase arch="powerpc"> (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>)</phrase>, der jetzt ein <phrase arch="x86">FAT-Dateisystem</phrase><phrase arch="powerpc">HFS-Dateisystem</phrase> enthält, und kopieren Sie ein &debian; ISO-Image (Netinst oder eine Komplett-CD) dorthin. Lösen Sie die Laufwerkseinbindung des Sticks (<userinput>umount /mnt</userinput>) &ndash; das war's.
it: Poi montare la chiavetta USB <phrase arch="x86">(<userinput>mount /dev/<replaceable>sdX</replaceable> /mnt</userinput>),</phrase> <phrase arch="powerpc">(<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>),</phrase> che adesso avrà <phrase arch="x86">un filesystem FAT,</phrase> <phrase arch="powerpc">un filesystem HFS,</phrase> e copiarci l'immagine ISO di &debian; (netinst o un CD completo). Infine smontare la chiavetta (<userinput>umount /mnt</userinput>).
nl: Koppel nadien de USB-geheugenstick aan <phrase arch="x86">(<userinput>mount /dev/<replaceable>sdX</replaceable> /mnt</userinput>),</phrase> <phrase arch="powerpc">(<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>),</phrase> waarop nu <phrase arch="x86">een FAT-bestandssysteem</phrase> <phrase arch="powerpc">een HFS-bestandssysteem</phrase> zal staan en kopieer er een &debian; ISO-image (netinst of de volledige CD) naartoe. Koppel de stick af (<userinput>umount /mnt</userinput>) en u bent klaar.

source: Manually copying files to the USB stick &mdash; the flexible way
ca: Còpia dels fitxers &mdash; la manera flexible
de: Dateien manuell auf den USB-Stick kopieren &ndash; der flexible Weg
it: Copia manuale dei file sulla chiavetta USB &mdash; il modo flessibile
nl: Handmatig bestanden naar de USB-stick kopiëren &mdash; de flexibele manier

source: If you like more flexibility or just want to know what's going on, you should use the following method to put the files on your stick. One advantage of using this method is that &mdash; if the capacity of your USB stick is large enough &mdash; you have the option of copying any ISO image, even a DVD image, to it.
ca: Si voleu més flexibilitat o voleu saber que esteu fent, heu de seguir aquest mètode per posar els fitxers al vostre llapis. Un avantatge d'utilitzar aquest mètode és que, si el llapis USB té prou capacitat, podreu copiar-hi una imatge ISO, fins i tot una imatge DVD,
de: Wenn Sie flexibler sein oder einfach nur wissen möchten, was passiert, sollten Sie folgende Methode benutzen, um die Dateien auf den Stick zu befördern. Ein Vorteil dieser Methode ist, dass Sie &ndash; falls die Kapazität Ihres USB-Sticks dafür ausreicht &ndash; die Möglichkeit haben, jegliches ISO-Image (sogar ein DVD-Image) darauf zu kopieren.
it: Chi preferisce avere più flessibilità o semplicemente vuole capire cosa sta facendo, dovrebbe usare questo metodo per scrivere i file sulla chiavetta. Uno dei vantaggi di questo metodo è quello che se la chiavetta USB è sufficientemente capiente, è possibile copiarci qualsiasi immagine ISO, persino quella di un DVD.
nl: Indien u van meer flexibiliteit houdt of gewoon wilt weten hoe de zaak in mekaar zit, moet u de volgende methode gebruiken om de bestanden op de stick te plaatsen. Een voordeel van deze methode is dat &mdash; als uw USB-stick een voldoende grote capaciteit heeft &mdash; u de mogelijkheid heeft om er gelijk welk ISO-image naar te kopiëren, zelfs een DVD-image.

source: Partitioning the USB stick
ca: Fer particions a un llapis USB
de: Den USB-Stick partitionieren
it: Partizionamento della chiavetta USB
nl: De USB-stick indelen in partities

source: We will show how to set up the memory stick to use the first partition, instead of the entire device.
ca: Mostrarem com configurar un llapis de memòria per utilitzar la primera partició d'aquest, en comptes del dispositiu complet.
de: Wir werden hier erläutern, wie Sie den Memory-Stick einrichten, so dass nur die erste Partition genutzt wird statt des kompletten USB-Speichers.
it: Verrà spiegato come preparare la chiavetta per usare solo la prima partizione anziché l'intero dispositivo.
nl: We zullen u tonen hoe u de geheugenstick moet instellen om slechts de eerste partitie in plaats van het volledige apparaat te gebruiken.

source: Since most USB sticks come pre-configured with a single FAT16 partition, you probably won't have to repartition or reformat the stick. If you have to do that anyway, use <command>cfdisk</command> or any other partitioning tool to create a FAT16 partition<footnote> <para> Don't forget to set the <quote>bootable</quote> bootable flag. </para> </footnote>, install an MBR using: <informalexample><screen> # install-mbr /dev/<replaceable>sdX</replaceable> </screen></informalexample> The <command>install-mbr</command> command is contained in the <classname>mbr</classname> &debian; package. Then create the filesystem using: <informalexample><screen> # mkdosfs /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Take care that you use the correct device name for your USB stick. The <command>mkdosfs</command> command is contained in the <classname>dosfstools</classname> &debian; package.
ca: La major part dels llapis USB venen preconfigurats amb una única partició FAT16, així que en general no serà necessari tornar a partir o tornar a formatar-lo. Si heu de fer-ho, utilitzeu el <command>cfdisk</command> o qualsevol altra eina per fer la partició FAT16<footnote> <para>Recordeu-vos d'activar l’indicador de partició arrencable <quote>bootable</quote>.</para> </footnote>, i aleshores generau el sistema de fitxers fent: <informalexample><screen> # install-mbr /dev/<replaceable>sdX</replaceable> </screen></informalexample> L'ordre <command>install-mbr</command> està en el paquet <classname>mbr</classname> de &debian;. Per a generar el sistema de fitxers, feu servir: <informalexample><screen> # mkdosfs /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Aneu amb compte d'utilitzar el nom del dispositiu correcte pel vostre llapis USB. L'ordre <command>mkdosfs</command> és al paquet &debian; <classname>dosfstools</classname>.
de: Da die meisten USB-Sticks mit einer einzelnen FAT16-Partition vorkonfiguriert geliefert werden, müssen Sie den Stick möglicherweise nicht neu partitionieren oder formatieren. Falls es trotzdem nötig ist, nutzen Sie <command>cfdisk</command> oder ein anderes Partitionierungswerkzeug, um eine FAT16-Partition zu erzeugen<footnote> <para> Vergessen Sie nicht, die <quote>bootable</quote>-Markierung (Boot-Flag) zu setzen. </para> </footnote>, erzeugen Sie einen Master-Boot-Record (MBR), indem Sie Folgendes eingeben: <informalexample><screen> # install-mbr /dev/<replaceable>sdX</replaceable> </screen></informalexample> Das Programm <command>install-mbr</command> ist im &debian;-Paket <classname>mbr</classname> enthalten. Erstellen Sie dann ein Dateisystem: <informalexample><screen> # mkdosfs /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Achten Sie darauf, dass Sie den richtigen Gerätenamen für den USB-Stick verwenden. Das Programm <command>mkdosfs</command> ist im &debian;-Paket <classname>dosfstools</classname> enthalten.
it: Poiché la maggior parte delle chiavette USB viene venduta con una singola partizione FAT16 già configurata, probabilmente non sarà necessario partizionare né formattare la chiavetta. Invece, se fosse necessario preparare la chiavetta, usare <command>cfdisk</command> o un qualsiasi altro programma di partizionamento per creare una partizione FAT16<footnote> <para> Ricordarsi di attivare il flag <quote>bootable</quote>. </para> </footnote>, installare un MBR con: <informalexample><screen> # install-mbr /dev/<replaceable>sdX</replaceable> </screen></informalexample> Il comando <command>install-mbr</command> è contenuto nel pacchetto &debian; <classname>mbr</classname>. Infine creare il filesystem usando: <informalexample><screen> # mkdosfs /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Fare attenzione a usare il nome di device della chiavetta USB. Il comando <command>mkdosfs</command> è contenuto nel pacchetto &debian; <classname>dosfstools</classname>.
nl: Aangezien de meeste USB-sticks vooraf geconfigureerd zijn met één enkele FAT16-partitie, zult u de stick wellicht niet opnieuw moeten indelen of herformatteren. Als u dat toch moet doen, gebruik dan <command>cfdisk</command> of een ander partitiegereedschap om een FAT16-partitie te maken<footnote> <para> Vergeet niet om de <quote>bootable</quote> vlag in te stellen (dit maakt er een opstartpartitie van). </para> </footnote>, installeer een MBR met: <informalexample><screen> # install-mbr /dev/<replaceable>sdX</replaceable> </screen></informalexample> Het commando <command>install-mbr</command> is te vinden in het &debian; pakket <classname>mbr</classname>. Creëer daarna het bestandssysteem met: <informalexample><screen> # mkdosfs /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Zorg ervoor om voor uw USB-stick de correcte apparaatnaam te gebruiken. Het commando <command>mkdosfs</command> is te vinden in het &debian; pakket <classname>dosfstools</classname>.

source: In order to start the kernel after booting from the USB stick, we will put a boot loader on the stick. Although any boot loader (e.g. <classname>lilo</classname>) should work, it's convenient to use <classname>syslinux</classname>, since it uses a FAT16 partition and can be reconfigured by just editing a text file. Any operating system which supports the FAT file system can be used to make changes to the configuration of the boot loader.
ca: Per arrencar el nucli després d'arrencar des del llapis USB, posarem un carregador d'arrencada al llapis. Malgrat que hauria de funcionar qualsevol carregador (p.ex. <command>LILO</command>), és convenient utilitzar <command>syslinux</command>, ja que utilitza una partició FAT16 i pot reconfigurar-se editant tan sols un fitxer de text. Qualsevol sistema operatiu que suporti el sistema de fitxers FAT pot utilitzar-se per canviar la configuració del carregador d'arrencada.
de: Um den Kernel starten zu können, nachdem vom USB-Stick gebootet wurde, werden wir einen Bootloader auf dem Stick ablegen. Obwohl jeder Bootloader (wie z.B. <classname>lilo</classname>) funktionieren sollte, wird empfohlen, <classname>syslinux</classname> zu verwenden, da er eine FAT16-Partition benutzt und über eine Textdatei konfiguriert werden kann. Jedes Betriebssystem, das das FAT-Dateisystem unterstützt, kann verwendet werden, um die Konfiguration des Bootloaders zu verändern.
it: Per far partire il kernel dopo aver avviato da un chiavetta USB è necessario mettere un bootloader sulla chiavetta. Nonostante il fatto che qualsiasi bootloader (p.e. <classname>lilo</classname>) dovrebbe funzionare è più comodo usare <classname>syslinux</classname> dato che utilizza una partizione FAT16 e può essere riconfigurato semplicemente modificando un file di testo. Qualsiasi sistema operativo con supporto per il filesystem FAT può essere usato per fare delle modifiche alla configurazione del bootloader.
nl: Om na het opstarten vanaf de USB-stick de kernel te starten, zullen we een opstartlader plaatsen op de stick. Hoewel elke opstartlader (bijv. <classname>lilo</classname>) zou moeten werken, is het handig om <classname>syslinux</classname> te gebruiken, omdat die een FAT16-partitie gebruikt en eenvoudig geconfigureerd kan worden door gewoon een tekstbestand te bewerken. Elk besturingssysteem dat het FAT-bestandssysteem ondersteunt, kan gebruikt worden om de configuratie van de opstartlader aan te passen.

source: To put <classname>syslinux</classname> on the FAT16 partition on your USB stick, install the <classname>syslinux</classname> and <classname>mtools</classname> packages on your system, and do: <informalexample><screen> # syslinux /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Again, take care that you use the correct device name. The partition must not be mounted when starting <command>syslinux</command>. This procedure writes a boot sector to the partition and creates the file <filename>ldlinux.sys</filename> which contains the boot loader code.
ca: Per posar el <command>syslinux</command> a la partició FAT16 del vostre llapis USB, instal·leu els paquets <classname>syslinux</classname> i <classname>mtools</classname> al vostre sistema i executeu: <informalexample><screen> # syslinux /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Altra vegada, aneu amb compte i utilitzeu el nom correcte per al dispositiu. La partició no hauria d'estar muntada quan executeu l'ordre <command>syslinux</command>. Aquest procediment escriu un sector d'arrencada a la partició i genera el fitxer <filename>ldlinux.sys</filename> que conté el codi del carregador d'arrencada.
de: Um <classname>syslinux</classname> auf die FAT16-Partition des USB-Sticks zu befördern, installieren Sie die Pakete <classname>syslinux</classname> und <classname>mtools</classname> auf Ihrem System und führen dann aus: <informalexample><screen> # syslinux /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Hier nochmals die Warnung, den richtigen Gerätenamen zu verwenden. Die Partition darf nicht ins Dateisystem eingebunden sein, wenn <classname>syslinux</classname> ausgeführt wird. Durch diese Prozedur wird ein Boot-Sektor auf die Partition geschrieben und die Datei <filename>ldlinux.sys</filename> erstellt, die den Bootloader-Code enthält.
it: Per collocare <classname>syslinux</classname> sulla partizione FAT16 della chiavetta USB installare i pacchetti <classname>syslinux</classname> e <classname>mtools</classname> ed eseguire: <informalexample><screen> # syslinux /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Di nuovo fare attenzione a usare il nome corretto del device. La partizione non deve essere montata quando si avvia <command>SYSLINUX</command>, la procedura scrive il settore di avvio sulla partizione e crea il file <filename>ldlinux.sys</filename> che contiene il codice del bootloader.
nl: Om <classname>syslinux</classname> op de FAT16-partitie van uw USB-stick te plaatsen, moet u de pakketten <classname>syslinux</classname> en <classname>mtools</classname> op uw systeem installeren en het volgende commando geven: <informalexample><screen> # syslinux /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Nogmaals, zorg ervoor dat u de juiste apparaatnaam gebruikt. De partitie mag niet aangekoppeld zijn als u <command>syslinux</command> start. Deze procedure schrijft een opstartsector naar de partitie en creëert het bestand <filename>ldlinux.sys</filename> dat de code van de opstartlader bevat.

source: Adding the installer image
ca: Com afegir la imatge de l'instal·lador
de: Ein Installer-Image auf den Stick kopieren
it: Aggiunta dell'immagine dell'installatore
nl: Het image van het installatiesysteem toevoegen
