Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: The <filename>yaboot.conf</filename> configuration file should contain the following lines: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000 read-only </screen></informalexample> Please note that the <userinput>initrd-size</userinput> parameter may need to be increased, depending on the image you are booting.
ca: El fitxer de configuració de <filename>yaboot.conf</filename> hauria de contenir les línies següents:<informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000 read-only </screen></informalexample> Adoneu-vos que el paràmetre <userinput>initrd-size</userinput> es podria incrementar, depenent de la imatge que esteu arrencant.
de: Die Konfigurationsdatei <filename>yaboot.conf</filename> sollte die folgenden Zeilen enthalten: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000 read-only </screen></informalexample> Beachten Sie bitte, dass der Wert für den Parameter <userinput>initrd-size</userinput> abhängig von dem Image, das Sie booten, eventuell noch erhöht werden muss.
it: Il file di configurazione <filename>yaboot.conf</filename> deve contenere le seguenti righe: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000 read-only </screen></informalexample> Notare che potrebbe essere necessario aumentare il valore del parametro <userinput>ramdisk_size</userinput> a seconda dell'immagine che si vuole avviare.
nl: Het configuratiebestand <filename>yaboot.conf</filename> moet de volgende regels bevatten: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000 read-only </screen></informalexample> Merk op dat het kan zijn dat, afhankelijk van het image dat u zult opstarten, de parameter <userinput>initrd-size</userinput> moet verhoogd worden.

source: Preparing Files for Hard Disk Booting
ca: Preparació dels fitxers per arrencar des del disc dur
de: Dateien vorbereiten für das Booten von Festplatte
it: Preparazione dei file per l'avvio da disco fisso
nl: Bestanden voorbereiden om vanaf een harde schijf op te starten

source: The installer may be booted using boot files placed on an existing hard drive partition, either launched from another operating system or by invoking a boot loader directly from the BIOS.
ca: L'instal·lador es pot arrencar fent ús de fitxers que són a una partició d'un disc dur: o bé llançat des d'un altre sistema operatiu, o bé cridant directament un carregador des de la BIOS.
de: Der Installer kann von Dateien auf einer bestehenden Festplattenpartition gebootet werden, entweder von einem anderen Betriebssystem aus oder direkt vom BIOS mittels eines Bootloaders.
it: L'installatore può essere fatto partire usando i file d'avvio scritti su una partizione già esistente del disco fisso, lanciandoli da un altro sistema operativo o richiamando un bootloader direttamente dal BIOS.
nl: Het installatiesysteem kan opgestart worden met opstartbestanden die op een bestaande partitie van een harde schijf geplaatst worden. Die worden dan gelanceerd ofwel vanuit een ander besturingssysteem, ofwel door rechtstreeks vanuit het BIOS een opstartlader aan te roepen.

source: A full, <quote>pure network</quote> installation can be achieved using this technique. This avoids all hassles of removable media, like finding and burning CD images or struggling with too numerous and unreliable floppy disks.
ca: Es pot aconseguir una instal·lació completa amb <quote>xarxa pura</quote> utilitzant aquesta tècnica. Açò evita tota la confusió de mitjans extraïbles, com trobar i gravar imatges de CD o barallar-se amb nombrosos i poc fiables disquets.
de: Man kann auf diese Weise eine <quote>reine Netzwerk</quote>-Installation durchführen. Dies vermeidet das ganze Theater mit den Wechselmedien, wie das Auffinden und Brennen von CD-Images oder den Kampf mit den vielen oder mit defekten Disketten.
it: Usando questo metodo è possibile realizzare una installazione completa puramente da rete evitando tutte le noie dei supporti rimovibili come la ricerca e la masterizzazione delle immagini dei CD o la lotta con troppi e inaffidabili dischetti.
nl: Met deze techniek kunt u een complete en <quote>zuivere netwerk</quote>-installatie realiseren. Dit vermijdt alle rompslomp van verwijderbare media, zoals het zoeken en branden van CD-images of het gevecht met de veel te talrijke en onbetrouwbare diskettes.

source: The installer cannot boot from files on an HFS+ file system. MacOS System 8.1 and above may use HFS+ file systems; NewWorld PowerMacs all use HFS+. To determine whether your existing file system is HFS+, select <userinput>Get Info</userinput> for the volume in question. HFS file systems appear as <userinput>Mac OS Standard</userinput>, while HFS+ file systems say <userinput>Mac OS Extended</userinput>. You must have an HFS partition in order to exchange files between MacOS and Linux, in particular the installation files you download.
ca: L'instal·lador no pot arrencar des d'un sistema de fitxers HFS+. Els MacOS System 8.1 i posteriors poden utilitzar el sistema de fitxers HFS+; tots els NewWorld PowerMacs utilitzen HFS+. Per determinar si el vostre sistema de fitxers és HFS+, seleccioneu <userinput>Get Info</userinput> pel volum en qüestió. El sistema de fitxers HFS apareix com <userinput>Mac OS Standard</userinput>, mentre que al HFS+ diu <userinput>Mac OS Extended</userinput>. Hauríeu de tenir una partició HFS per poder intercanviar fitxers entre MacOS i Linux, en particular els fitxers d'instal·lació que descarregueu.
de: Der Installer kann jedoch nicht von Dateien auf einem <quote>HFS+</quote>-Dateisystem booten. Systeme mit MacOS 8.1 und höher benutzen unter Umständen ein Dateisystem im Format HFS+; NewWorld-PowerMacs benutzen alle HFS+. Um herauszufinden, ob Ihr Dateisystem vom Typ HFS+ ist, verwenden Sie <userinput>Get Info</userinput> für die fragliche Partition. HFS-Dateisysteme erscheinen als <userinput>Mac OS Standard</userinput>, während HFS+ <userinput>Mac OS Extended</userinput> ausgeben. Sie benötigen eine HFS-Partition, um Dateien zwischen MacOS und Linux auszutauschen, speziell die Installationsdateien, die Sie herunterladen.
it: L'installatore non può essere avviato usando file su un file system HFS+. MacOS System 8.1 e successivi potrebbero usare un filesystem HFS+, tutti i PowerMac NewWorld usano HFS+. Per determinare se il proprio filesystem è HFS+ scegliere <userinput>Get Info</userinput> per il volume in questione, i file system HFS sono mostrati come <userinput>Mac OS Standard</userinput>, invece i filesystem HFS+ sono mostrati come <userinput>Mac OS Extended</userinput>. È necessario avere una partizione HFS per poter scambiare file fra MacOS e Linux, in particolare per i file d'installazione.
nl: Het installatiesysteem kan niet opstarten vanaf bestanden op een HFS+-bestandssysteem. MacOS System 8.1 en recenter kunnen dit bestandssysteem gebruiken en alle NewWorld PowerMacs gebruiken HFS+. Om te weten te komen of uw bestandssysteem van het type HFS+ is, moet u voor de schijf in kwestie <userinput>Get Info</userinput> (Info tonen) selecteren. Een HFS-bestandssysteem wordt als <userinput>Mac OS Standard</userinput> aangeduid, terwijl een HFS+-bestandssysteem aangeduid wordt met <userinput>Mac OS Extended</userinput>. U heeft een HFS-partitie nodig om bestanden te kunnen uitwisselen tussen MacOS en Linux, in het bijzonder de installatiebestanden die u downloadt.

source: Different programs are used for hard disk installation system booting, depending on whether the system is a <quote>NewWorld</quote> or an <quote>OldWorld</quote> model.
ca: S'utilitzen programes diferents pel sistema d'arrencada amb disc dur depenent de si el sistema és un model <quote>NewWorld</quote> o un <quote>OldWorld</quote>.
de: Es werden unterschiedliche Programme benutzt, um das Installationssystem von Festplatte zu booten, abhängig davon, ob es ein <quote>NewWorld</quote>- oder ein <quote>OldWorld</quote>-Modell ist.
it: Per far partire l'installazione da disco fisso si possono usare diversi programmi a seconda che si disponga di un sistema <quote>NewWorld</quote> o <quote>OldWorld</quote>.
nl: Diverse programma's worden gebruikt voor het opstarten van het installatiesysteem vanaf een harde schijf. Dit is afhankelijk van het feit of het systeem een <quote>NewWorld</quote> of een <quote>OldWorld</quote> model is.

source: Hard disk installer booting from Linux using <command>LILO</command> or <command>GRUB</command>
ca: Arrencada de l'instal·lador des de disc dur fent ús de <command>LILO</command> o <command>GRUB</command>
de: Booten des Installers von Festplatte unter Linux mittels <command>LILO</command> oder <command>GRUB</command>
it: Avvio da Linux dell'installatore da disco fisso con <command>LILO</command> o <command>GRUB</command>
nl: Het opstarten van het installatiesysteem vanaf een harde schijf in Linux met behulp van <command>LILO</command> of <command>GRUB</command>

source: This section explains how to add to or even replace an existing linux installation using either <command>LILO</command> or <command>GRUB</command>.
ca: Aquesta secció explica com afegir o com reemplaçar una instal·lació existent utilitzant <command>LILO</command> o <command>GRUB</command>.
de: Dieser Abschnitt beschreibt, wie Sie &debian; mit <command>lilo</command> oder <command>grub</command> dem System hinzufügen bzw. eine bestehende Linux-Installation komplett ersetzen.
it: Questa sezione spiega come aggiungere o sostituire una installazione di Linux esistente usando <command>LILO</command> o <command>GRUB</command>.
nl: In dit deel wordt uitgelegd hoe u met behulp van <command>LILO</command> of <command>GRUB</command> een nieuw systeem kunt toevoegen aan een bestaand Linux-systeem of hoe u zelfs dat bestaand systeem kunt vervangen.

source: At boot time, both bootloaders support loading in memory not only the kernel, but also a disk image. This RAM disk can be used as the root file-system by the kernel.
ca: Al moment d'arrencar, ambdós carregadors suporten carregar a memòria no tan sols el nucli, sinó també una imatge del disc. Aquest disc RAM pot ser utilitzat pel nucli com el sistema de fitxers arrel.
de: Beide Bootloader unterstützen es, zum Zeitpunkt des Bootens nicht nur den Kernel zu laden, sondern auch ein komplettes Disk-Image. Diese RAM-Disk kann vom Kernel als Root-Dateisystem genutzt werden.
it: All'avvio entrambi i bootloader supportano il caricamento in memoria non solo del kernel ma anche di un'immagine del disco. Questo RAM disk può essere usato come filesystem di root dal kernel.
nl: Beide opstartladers ondersteunen bij het opstarten niet enkel het in het geheugen laden van de kernel, maar ook van een schijf-image. Deze kan door de kernel gebruikt worden als root-bestandssysteem.

source: Copy the following files from the &debian; archives to a convenient location on your hard drive (note that LILO can not boot from files on an NTFS file system), for instance to <filename>/boot/newinstall/</filename>.
ca: Copieu els fitxers següents des dels arxius de &debian; a un lloc còmode al vostre disc dur (teniu en compte que LILO no pot arrencar des de fitxers a un sistema de fitxers NTFS), per exemple a <filename>/boot/newinstall/</filename>.
de: Kopieren Sie die folgenden Dateien von einem &debian;-Archiv in ein passendes Verzeichnis auf Ihrer Festplatte, z.B. in <filename>/boot/newinstall/</filename> (beachten Sie, dass LILO nicht von Dateien auf einem NTFS-Dateisystem booten kann):
it: Copiare i seguenti file dagli archivi &debian; in una directory del proprio disco fisso (notare che LILO non è in grado di avviare il sistema da file su un file system NTFS), per esempio <filename>/boot/newinstall/</filename>.
nl: Kopieer de volgende bestanden vanuit de &debian; archieven naar een geschikte plaats op uw harde schijf (merk op dat LILO niet kan opstarten van bestanden op een NTFS-bestandssysteem), bijvoorbeeld in een map <filename>/boot/newinstall/</filename>.

source: <filename>vmlinuz</filename> (kernel binary)
ca: <filename>vmlinuz</filename> (imatge del nucli)
de: <filename>vmlinuz</filename> (Kernel-Binär-Datei)
it: <filename>vmlinuz</filename> (kernel)
nl: <filename>vmlinuz</filename> (het binaire kernel-bestand)

source: <filename>initrd.gz</filename> (ramdisk image)
ca: <filename>initrd.gz</filename> (imatge del disc RAM)
it: <filename>initrd.gz</filename> (immagine del ramdisk)
nl: <filename>initrd.gz</filename> (ramschijf-image)

source: Finally, to configure the bootloader proceed to <xref linkend="boot-initrd"/>.
ca: Finalment, per configurar el carregador continueu a <xref linkend="boot-initrd"/>.
de: Um jetzt abschließend den Bootloader zu konfigurieren, springen Sie zu <xref linkend="boot-initrd"/>.
it: Infine, per configurare il bootloader procedere con <xref linkend="boot-initrd"/>.
nl: Om tot slot de opstartlader te configureren, gaat u te werk zoals beschreven in <xref linkend="boot-initrd"/>.

source: Hard disk installer booting from DOS using <command>loadlin</command>
ca: Iniciar la instal·lació des del disc dur amb DOS fent servir <command>loadlin</command>
de: Booten des Installers von Festplatte unter DOS mittels <command>loadlin</command>
it: Avvio da DOS dell'installatore da disco fisso con <command>loadlin</command>
nl: Het opstarten van het installatiesysteem vanaf een harde schijf vanuit DOS met <command>loadlin</command>

source: This section explains how to prepare your hard drive for booting the installer from DOS using <command>loadlin</command>.
ca: Aquesta secció explica com preparar el vostre disc dur per a iniciar la instal·lació des de DOS fent servir <command>loadlin</command>.
de: Dieser Abschnitt beschreibt, wie Sie Ihre Festplatte vorbereiten, um den Installer von DOS aus mittels <command>loadlin</command> zu starten.
it: In questa sezione è spiegato come preparare il proprio disco fisso per avviare l'installatore da DOS usando <command>loadlin</command>.
nl: In dit deel wordt uitgelegd hoe u de harde schijf voorbereidt om het installatiesysteem op te starten vanuit DOS met <command>loadlin</command>.

source: Copy the following directories from a &debian; CD image to <filename>c:\</filename>.
ca: Copia els següent directoris des de la imatge de Debian en CD a <filename>c:\</filename>.
de: Kopieren Sie die folgenden Verzeichnisse von einem &debian;-CD-Image nach <filename>c:\</filename>:
it: Copiare le seguenti directory dall'immagine del CD &debian; in <filename>c:\</filename>.
nl: Kopieer de volgende mappen van een &debian; CD-image naar <filename>c:\</filename>.

source: <filename>/&x86-install-dir;</filename> (kernel binary and ramdisk image)
ca: <filename>/&x86-install-dir;</filename> (binari del nucli i imatge del disc de memòria)
de: <filename>/&x86-install-dir;</filename> (Kernel-Binärdatei und Ramdisk-Image)
it: <filename>/&x86-install-dir;</filename> (binari del kernel e immagine del ramdisk)
nl: <filename>/&x86-install-dir;</filename> (het binaire kernel-bestand en het ramschijf-image)

source: <filename>/tools</filename> (loadlin tool)
ca: <filename>/tools</filename> (eina «loadlin»)
de: <filename>/tools</filename> (Hilfsprogramm loadlin)
it: <filename>/tools</filename> (programma loadlin)
nl: <filename>/tools</filename> (het gereedschap loadlin)

source: Hard Disk Installer Booting for OldWorld Macs
ca: Arrencar l'instal·lador des de disc dur per a Macs OldWorld
de: Booten des Installers von Festplatte auf OldWorld-Macs
it: Avvio dell'installatore da disco fisso su Mac OldWorld
nl: Het opstarten van het installatiesysteem vanaf harde schijf bij OldWorld Macs

source: The <filename>boot-floppy-hfs</filename> floppy uses <application>miBoot</application> to launch Linux installation, but <application>miBoot</application> cannot easily be used for hard disk booting. <application>BootX</application>, launched from MacOS, supports booting from files placed on the hard disk. <application>BootX</application> can also be used to dual-boot MacOS and Linux after your &debian; installation is complete. For the Performa 6360, it appears that <command>quik</command> cannot make the hard disk bootable. So <application>BootX</application> is required on that model.
ca: El disquet <filename>boot-floppy-hfs</filename> utilitza <application>miBoot</application> per arrencar la instal·lació, però <application>miBoot</application> no és fàcil d'utilitzar per arrencar des de disc dur. <application>BootX</application>, llançat des de MacOS, suporta arrencar des de fitxers al disc dur. També es pot utilitzar <application>BootX</application> per arrencada dual MacOS i Linux després d'haver completat la instal·lació del vostre &debian;. Pel Performa 6360, pareix que el <command>quik</command> no pot fer el disc arrencable. Així que per aquest model el <application>BootX</application> és imprescindible.
de: Die <filename>boot-floppy-hfs</filename>-Diskette benutzt <application>miBoot</application>, um die Linux-Installation zu starten, aber <application>miBoot</application> kann nicht so einfach verwendet werden, um von Festplatte zu booten. <application>BootX</application>, von MacOS aus gestartet, unterstützt aber das Booten von Dateien, die auf Festplatte liegen. <application>BootX</application> kann ebenso genutzt werden, um ein Dual-Boot-System mit MacOS und Linux zu starten, nachdem die &debian;-Installation beendet ist. Auf dem Performa 6360 ist es scheinbar so, dass <command>quik</command> nicht in der Lage ist, die Festplatte bootfähig zu machen. Deswegen wird auf diesem System <application>BootX</application> benötigt.
it: Il dischetto <filename>boot-floppy-hfs</filename> utilizza <application>miBoot</application> per lanciare l'installazione di Linux, ma l'uso di <application>miBoot</application> per l'avvio da un disco fisso potrebbe essere non semplice. <application>BootX</application>, avviato da MacOS, supporta l'avvio da file sul disco fisso e sempre <application>BootX</application> può essere usato per gestire l'avvio di due sistemi operativi, MacOS e Linux, una volta completata l'installazione di &debian;. Sui Performa 6360, <command>quik</command> non è in grado di fare l'avvio da disco fisso e quindi su questo modello è necessario usare <application>BootX</application>.
nl: De diskette <filename>boot-floppy-hfs</filename> gebruikt <application>miBoot</application> om een installatie van Linux te lanceren, maar <application>miBoot</application> kan niet gemakkelijk gebruikt worden om van een harde schijf op te starten. <application>BootX</application>, dat vanuit MacOS opgestart wordt, ondersteunt wel het opstarten van bestanden die op de harde schijf geplaatst werden. <application>BootX</application> kan na het beëindigen van de installatie van &debian; ook gebruikt worden om zowel MacOS als Linux op te starten bij een 'dual-boot' systeem. Het blijkt dat bij de Performa 6360 <command>quik</command> niet in staat is de harde schijf opstartbaar te maken. Op dat model is <application>BootX</application> dus verplicht.

source: Download and unstuff the <application>BootX</application> distribution, available from <ulink url="&url-powerpc-bootx;"></ulink>, or in the <filename>dists/woody/main/disks-powerpc/current/powermac</filename> directory on &debian; http/ftp mirrors and official &debian; CDs. Use <application>Stuffit Expander</application> to extract it from its archive. Within the package, there is an empty folder called <filename>Linux Kernels</filename>. Download <filename>linux.bin</filename> and <filename>ramdisk.image.gz</filename> from the <filename>disks-powerpc/current/powermac</filename> folder, and place them in the <filename>Linux Kernels</filename> folder. Then place the <filename>Linux Kernels</filename> folder in the active System Folder.
ca: Descarregueu i desempaqueteu el <application>BootX</application>, disponible a <ulink url="&url-powerpc-bootx;"></ulink>, o al directori <filename>dists/woody/main/disks-powerpc/current/powermac</filename> a les rèpliques http/ftp oficials i als CD oficials de &debian;. Utilitzeu <application>Stuffit Expander</application> per extraure aquest arxiu. Dins el paquet, hi ha una carpeta buida amb el nom <filename>Linux Kernels</filename>. Descarregueu el <filename>linux.bin</filename> i el <filename>ramdisk.image.gz</filename> des del directori <filename>disks-powerpc/current/powermac</filename>, i poseu-los a la carpeta <filename>Linux Kernels</filename>. Aleshores poseu la carpeta <filename>Linux Kernels</filename> al Sistema de Carpetes actiu.
de: Laden Sie die <application>BootX</application>-Distribution von <ulink url="&url-powerpc-bootx;"></ulink> herunter und entpacken Sie sie (<application>BootX</application> ist ebenfalls im Verzeichnis <filename>dists/woody/main/disks-powerpc/current/powermac</filename> eines &debian;-HTTP- oder FTP-Spiegel-Servers verfügbar sowie auf offiziellen &debian;-CDs). Benutzen Sie <application>Stuffit Expander</application>, um das Archiv zu entpacken. In diesem Paket gibt es einen leeren Ordner namens <filename>Linux Kernels</filename>. Laden Sie die Dateien <filename>linux.bin</filename> und <filename>ramdisk.image.gz</filename> aus dem <filename>disks-powerpc/current/powermac</filename>-Verzeichnis herunter und speichern Sie sie im Verzeichnis <filename>Linux Kernels</filename> ab. Legen Sie dann das Verzeichnis <filename>Linux Kernels</filename> im aktiven Systemverzeichnis ab.
it: Scaricare e decomprimere <application>BootX</application>, disponibile da <ulink url="&url-powerpc-bootx;"></ulink> o nella directory <filename>dists/woody/main/disks-powerpc/current/powermac</filename> dei mirror http/ftp &debian; e dei CD Ufficiali &debian;. Si usi <application>Stuffit Expander</application> per estrarlo dall'archivio. All'interno del pacchetto c'è una cartella vuota con nome <filename>Linux Kernels</filename>. Copiare <filename>linux.bin</filename> e <filename>ramdisk.image.gz</filename> dalla cartella <filename>disks-powerpc/current/powermac</filename> alla cartella <filename>Linux Kernels</filename> e poi posizionare la cartella <filename>Linux Kernels</filename> nella cartella System Folder attiva.
nl: U moet de distributie <application>BootX</application>, die u vindt op <ulink url="&url-powerpc-bootx;"></ulink> of in de map <filename>dists/woody/main/disks-powerpc/current/powermac</filename> op de &debian; http/ftp-spiegelservers en op de officiële &debian; CD's, downloaden en uitladen (unstuff). Gebruik <application>Stuffit Expander</application> om het uit te pakken uit zijn archief. In het pakket ziet u een lege map met de naam <filename>Linux Kernels</filename>. Download <filename>linux.bin</filename> en <filename>ramdisk.image.gz</filename> uit de map <filename>disks-powerpc/current/powermac</filename> en plaats ze in de map <filename>Linux Kernels</filename>. Plaats vervolgens de map <filename>Linux Kernels</filename> in de actieve Systeemmap (System Folder).

source: Hard Disk Installer Booting for NewWorld Macs
ca: Arrencar l'instal·lador des de disc dur per a Macs NewWorld
de: Booten des Installers von Festplatte auf NewWorld-Macs
it: Avvio dell'installatore da disco fisso su Mac NewWorld
nl: Het opstarten van het installatiesysteem vanaf harde schijf bij NewWorld Macs
