Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: Obtaining System Installation Media
ca: Obtenir el suport d'instal·lació del sistema
de: Systeminstallations-Medien beschaffen
it: Recupero dei supporti per l'installazione
nl: Media met het installatiesysteem verkrijgen

source: Official &debian-gnu; CD/DVD-ROM Sets
ca: Conjunt de CD-ROM oficials de &debian-gnu;
de: Offizielle &debian-gnu;-CD/DVD-ROMs
it: Set ufficiale di CD/DVD-ROM &debian-gnu;
nl: Officiële &debian-gnu; CD/DVD-sets

source: By far the easiest way to install &debian-gnu; is from an Official &debian; CD/DVD-ROM Set. You can buy a set from a vendor (see the <ulink url="&url-debian-cd-vendors;">CD vendors page</ulink>). You may also download the CD/DVD-ROM images from a &debian; mirror and make your own set, if you have a fast network connection and a CD/DVD burner (see the <ulink url="&url-debian-cd;">Debian CD page</ulink> and <ulink url="&url-debian-cd-faq;">Debian CD FAQ</ulink> for detailed instructions). If you have a &debian; CD/DVD set and CDs/DVDs are bootable on your machine<phrase arch="x86">, which is the case on all modern PCs</phrase>, you can skip right to <xref linkend="boot-installer"/>. Much effort has been expended to ensure the most-used files are on the first CDs and DVDs, so that a basic desktop installation can be done with only the first DVD or - to a limited extent - even with only the first CD.
ca: Sens dubte la manera més senzilla d'instal·lar &debian-gnu; és fent servir un lot de CD-ROM oficials de &debian;. Podeu adquirir-ne un a un distribuïdor (vegeu la <ulink url="&url-debian-cd-vendors;">pàgina de venedors dels CD</ulink>). També podeu descarregar les imatges dels CD-ROM allotjades a una rèplica de &debian; i fer-vos el vostre lot propi, si teniu una connexió de xarxa ràpida i una gravadora de CD (vegeu la <ulink url="&url-debian-cd;">pàgina dels CD de Debian</ulink> per a instruccions detallades). Si ja disposeu d'un lot de CD de &debian; i podeu arrencar amb ells la vostra màquina, podeu anar a <xref linkend="boot-installer"/>. S'ha tingut molta cura a assegurar que els fitxers més importants són als primers CD i DVD, tot i què la instal·lació bàsica d'escriptori es pot fer només amb el primer DVD o - en una extensió limitada - només amb el primer CD.
de: Die bei weitem einfachste Methode, &debian-gnu; zu installieren, ist von einem Satz offizieller &debian-gnu;-CD/DVD-ROMs. Sie können solch einen Satz bei einem Händler kaufen (siehe die <ulink url="&url-debian-cd-vendors;">Verkäufer von Debian CDs</ulink>-Seite). Sie können sich auch die CD/DVD-ROM-Images von einem &debian;-Spiegel-Server herunterladen und Ihren eigenen Satz erstellen, wenn Sie eine schnelle Netzwerkverbindung und einen CD/DVD-Brenner haben (lesen Sie die <ulink url="&url-debian-cd;">Debian GNU/Linux auf CD</ulink>-Seite sowie die <ulink url="&url-debian-cd-faq;">Häufig gestellten Fragen (FAQ) über Debian-CDs</ulink> bezüglich weiterer Details). Wenn Sie einen Satz &debian;-CDs/DVDs haben und Ihr Rechner auch von CD/DVD booten kann<phrase arch="x86">, was auf allen modernen PCs der Fall ist</phrase>, können Sie direkt zum <xref linkend="boot-installer"/> springen. Es wurde ein großer Aufwand betrieben, um sicherzustellen, dass die meistverwendeten Dateien auf den ersten CDs/DVDs enthalten sind, so dass eine Standard-Desktop-Installation mit nur der ersten DVD &ndash; oder in einem gewissen Ausmaß sogar nur der ersten CD &ndash; durchgeführt werden kann.
it: Da sempre il modo più semplice per installare &debian-gnu; è usare un set ufficiale di CD/DVD-ROM &debian;. Si può comprare il set da uno dei distributori (si consulti la <ulink url="&url-debian-cd-vendors;">pagina dei distributori di CD</ulink>); se invece si dispone di una connessione veloce alla rete e di un masterizzatore è possibile scaricare le immagini dei CD/DVD-ROM da uno dei mirror &debian; e creare il proprio set (si consultino le istruzioni nella <ulink url="&url-debian-cd;">pagina dei CD Debian</ulink> e le <ulink url="&url-debian-cd-faq;">Debian CD FAQ</ulink>). Se si possiede il set di CD/DVD &debian; e se è possibile avviare la macchina da CD/DVD<phrase arch="x86">, di sicuro sui PC moderni</phrase>, si può passare direttamente a <xref linkend="boot-installer"/>; è stato fatto un lavoro molto accurato per assicurare che i file necessari alla maggioranza degli utenti si trovino sui primi CD e DVD, quindi l'installazione di un ambiente desktop di base può essere fatta con solo il primo DVD oppure persino solo con il primo CD.
nl: Veruit de gemakkelijkste manier om &debian-gnu; te installeren is vanaf een set officiële &debian; CD/DVD's. U kunt een set kopen bij een leverancier (zie de pagina <ulink url="&url-debian-cd-vendors;">Leveranciers van Debian installatiemedia</ulink>). Als u over een snelle netwerkverbinding en een CD/DVD-brander beschikt, kunt u ook de images van de CD/DVD's downloaden van een &debian; spiegelserver en uw eigen set aanmaken (zie de pagina <ulink url="&url-debian-cd;">Debian op CD's</ulink> en de <ulink url="&url-debian-cd-faq;">Debian CD FAQ</ulink> voor gedetailleerde instructies). Indien u een &debian; CD/DVD-set bezit en uw computer kan opstarten vanaf een CD/DVD<phrase arch="x86">, wat voor alle moderne PC's het geval is</phrase>, dan kunt u meteen doorgaan naar <xref linkend="boot-installer"/>. Er werd veel aandacht besteed aan het plaatsen van de meest gebruikte bestanden op de eerste CD's en DVD's, waardoor een basale installatie van een desktopomgeving uitgevoerd kan worden met alleen de eerste DVD of - mits zekere beperkingen - zelfs met enkel de eerste CD.

source: As CDs have a rather limited capacity by today's standards, not all graphical desktop environments are installable with only the first CD; for some desktop environments a CD installation requires either network connectivity during the installation to download the remaining files or additional CDs.
ca: Com què els CD tenen una capacitat limitada pels estàndards actuals, no és possible instal·lar qualsevol entorn d'escriptori fent servir només el primer CD; per a alguns entorns d'escriptori la instal·lació amb CD necessita connexió de xarxa en el procés d'instal·lació per a aconseguir fitxers o CD addicionals.
de: Da CDs verglichen mit den heutigen Standards eine eher eingeschränkte Kapazität haben, können nicht alle grafischen Arbeitsplatz-Umgebungen unter ausschließlicher Verwendung der ersten CD installiert werden; bei einigen Arbeitsplatz-Umgebungen erfordert eine CD-Installation zum Laden weiterer Daten entweder eine Netzwerkverbindung oder Sie benötigen zusätzliche CDs.
it: Poiché i CD hanno una capacità abbastanza limitata per gli standard di oggigiorno, non tutti gli ambienti grafici sono installabili usando solo il primo CD; per l'installazione di alcuni ambienti desktop, oltre al CD, è necessario essere connessi in rete per scaricare i file rimanenti o dei CD aggiuntivi.
nl: Aangezien de capaciteit van een CD volgens de huidige standaarden eerder beperkt is, is het niet bij alle grafische desktopomgevingen mogelijk om ze enkel met de eerste CD te installeren. Voor de installatie van sommige desktopomgevingen is ofwel een verbinding met het netwerk vereist om tijdens de installatie de resterende bestanden op te halen, ofwel bijkomende CD's.

source: Also, keep in mind: if the CDs/DVDs you are using don't contain some packages you need, you can always install those packages afterwards from your running new Debian system (after the installation has finished). If you need to know on which CD/DVD to find a specific package, visit <ulink url="https://cdimage-search.debian.org/">https://cdimage-search.debian.org/</ulink>.
de: Bedenken Sie auch: wenn die CDs/DVDs, die Sie verwenden, einige besondere Pakete nicht enthalten, die Sie benötigen, können Sie diese auch nach Abschluß der Installation aus dem laufenden neuen Debian-System heraus nachinstallieren. Falls Sie wissen möchten, auf welcher CD/DVD sich ein spezielles Paket befindet, besuchen Sie <ulink url="https://cdimage-search.debian.org/">https://cdimage-search.debian.org/</ulink>.
it: Inoltre, se i CD/DVD utilizzati non contengono alcuni pacchetti di cui si ha bisogno, è comunque possibile installare tali pacchetti in seguito quando il nuovo sistema sarà attivo (una volta completata l'installazione). Chi ha bisogno di conoscere su quale CD/DVD può trovare uno specifico pacchetto può visitare <ulink url="https://cdimage-search.debian.org/">https://cdimage-search.debian.org/</ulink>.
nl: Onthoud dat indien sommige pakketten die u nodig heeft, niet op de door u gebruikte CD's/DVD's staan, u deze pakketten altijd achteraf kunt installeren vanop uw operationeel nieuw Debian-systeem (na het beëindigen van de installatie). Indien u wilt weten op welke CD/DVD een specifiek pakket te vinden is, ga dan naar <ulink url="https://cdimage-search.debian.org/">https://cdimage-search.debian.org/</ulink>.

source: If your machine doesn't support CD booting<phrase arch="x86"> (only relevant on very old PC systems)</phrase>, but you do have a CD set, you can use an alternative strategy such as <phrase condition="supports-floppy-boot">floppy disk,</phrase> <phrase arch="s390">VM reader,</phrase> <phrase condition="bootable-disk">hard disk,</phrase> <phrase condition="bootable-usb">usb stick,</phrase> <phrase condition="supports-tftp">net boot,</phrase> or manually loading the kernel from the CD to initially boot the system installer. The files you need for booting by another means are also on the CD; the &debian; network archive and CD folder organization are identical. So when archive file paths are given below for particular files you need for booting, look for those files in the same directories and subdirectories on your CD.
ca: Si el vostre ordinador no permet l'arrencada des de CD<phrase arch="x86"> (només rellevant en sistemes molt antics)</phrase>, i en teniu un lot, podeu utilitzar una estratègia alternativa, com per exemple <phrase condition="supports-floppy-boot">els disquets,</phrase><phrase arch="s390">la cinta magnètica, la cinta magnètica emulada,</phrase><phrase condition="bootable-disk"> el disc dur,</phrase><phrase condition="bootable-usb"> el llapis usb,</phrase><phrase condition="supports-tftp"> l'arrencada en xarxa,</phrase> o la càrrega manual del nucli des del CD per arrencar inicialment l'instal·lador del sistema. Els fitxers que calen per arrencar d'altres maneres són també al CD; l'estructura de l'arxiu en xarxa de &debian; i la dels directoris dels CD és idèntica. Així, quan tot seguit s'indiquen els camins de fitxers específics que calen per arrencar, cerqueu-los als mateixos directoris i subdirectoris del CD.
de: Wenn Ihr Rechner nicht von CD booten kann<phrase arch="x86"> (nur relevant bei sehr alten PC-Systemen)</phrase>, Sie aber trotzdem einen Satz &debian;-CDs haben, können Sie eine alternative Strategie verfolgen, wie zum Beispiel <phrase condition="supports-floppy-boot">Diskette, </phrase><phrase arch="s390">Kartenleser der virtuellen Maschine, </phrase><phrase condition="bootable-disk">Festplatte, </phrase><phrase condition="bootable-usb">USB-Stick, </phrase><phrase condition="supports-tftp">Netzwerk-Boot, </phrase> oder Sie laden den Kernel manuell von der CD, um den Installer zu starten. Die Dateien, die Sie benötigen, um auf alternative Art zu booten, sind ebenfalls auf der CD. Das &debian;-Archiv im Netz und die Verzeichnisstruktur der CD sind identisch. Wenn also weiter unten Pfade zu Dateien im Archiv angegeben werden, können Sie diese Dateien auch im gleichen Verzeichnis/Unterverzeichnis auf der CD finden.
it: Se la propria macchina non supporta l'avvio da CD <phrase arch="x86">(rilevante solo su sistemi PC molto vecchi)</phrase> ma si possiede un set di CD è possibile usare una strategia alternativa come <phrase condition="supports-floppy-boot">dischetti,</phrase> <phrase arch="s390">VM-reader,</phrase> <phrase condition="bootable-disk">disco fisso,</phrase> <phrase condition="bootable-usb">chiavetta USB,</phrase> <phrase condition="supports-tftp">avvio da rete,</phrase> oppure caricare manualmente il kernel dal CD per avviare il sistema di installazione. Sul CD ci sono anche i file necessari per l'avvio da altri supporti. La struttura dell'archivio &debian; in rete e quella delle cartelle sul CD sono identiche, quindi i percorsi a specifici file necessari per l'avvio forniti di seguito sono cercati all'interno della stessa directory o sottodirectory sul proprio CD.
nl: Indien uw machine het opstarten vanaf een CD niet ondersteunt<phrase arch="x86"> (enkel toepasselijk op zeer oude PC-systemen)</phrase>, maar u wel een CD-set heeft, kunt u een andere werkwijze gebruiken, zoals <phrase condition="supports-floppy-boot">diskette,</phrase> <phrase arch="s390">VM-geheugenkaartlezer,</phrase> <phrase condition="bootable-disk">harde schijf,</phrase> <phrase condition="bootable-usb">usb-stick,</phrase> <phrase condition="supports-tftp">opstarten over het netwerk</phrase> of de kernel handmatig laden van de CD om het opstarten van het installatiesysteem te initiëren. De bestanden die u nodig heeft om via een andere methode op te starten bevinden zich ook op de CD. Het archief op het &debian; netwerk en de mappenindeling op de CD zijn identiek. Indien dus hierna paden vermeld worden naar specifieke bestanden uit het archief die u nodig heeft om op te starten, kunt u deze bestanden op uw CD in dezelfde mappen en onderliggende mappen vinden.

source: Once the installer is booted, it will be able to obtain all the other files it needs from the CD.
ca: Quan l'instal·lador s'haja arrencat, ja es podrà obtenir del CD la resta de fitxers necessaris.
de: Sobald der Installer gestartet ist, kann er alle anderen Dateien, die er benötigt, von der CD laden.
it: Una volta che l'installatore è partito, è in grado di recuperare tutti gli altri file necessari dal CD.
nl: Eens het installatiesysteem opgestart werd, zal het in staat zijn alle overige bestanden die het nodig heeft te vinden op de CD.

source: If you don't have a CD set, then you will need to download the installer system files and place them on the <phrase arch="s390">VM minidisk</phrase> <phrase condition="supports-floppy-boot">floppy disk or</phrase> <phrase condition="bootable-disk">hard disk or</phrase> <phrase condition="bootable-usb">usb stick or</phrase> <phrase condition="supports-tftp">a connected computer</phrase> so they can be used to boot the installer.
ca: Si no teniu cap lot de CD, haureu de descarregar els fitxers del sistema d'instal·lació i posar-los a<phrase arch="s390"> el mini dics VM</phrase><phrase condition="supports-floppy-boot"> el disquet o</phrase><phrase condition="bootable-disk"> el disc dur o</phrase><phrase condition="bootable-usb"> al llapis usb o</phrase><phrase condition="supports-tftp"> a un ordinador connectat</phrase> perquè puguen emprar-se per a arrencar l'instal·lador.
de: Wenn Sie keine CDs haben, müssen Sie die Installer-Systemdateien herunterladen und speichern, z.B. auf <phrase arch="s390">einer Minidisk der virtuellen Maschine,</phrase> <phrase condition="supports-floppy-boot">Diskette,</phrase> <phrase condition="bootable-disk">Festplatte,</phrase> <phrase condition="bootable-usb">USB-Stick,</phrase> <phrase condition="supports-tftp">einem per Netzwerk angebundenen Computer,</phrase> so dass der Installer sie nutzen kann.
it: Se non si possiede un set di CD è necessario scaricare i file dell'installatore e copiarli su <phrase arch="s390">minidisco per VM,</phrase> <phrase condition="supports-floppy-boot">un dischetto,</phrase> <phrase condition="bootable-disk">un disco fisso,</phrase> <phrase condition="bootable-usb">una chiavetta USB,</phrase> <phrase condition="supports-tftp">un computer in rete,</phrase> in modo da essere usati per avviare l'installatore.
nl: Indien u geen CD-set heeft, zult u de bestanden van het installatiesysteem moeten downloaden en ze moeten plaatsen op een <phrase arch="s390">VM minidisk</phrase> <phrase condition="supports-floppy-boot">diskette of</phrase> <phrase condition="bootable-disk">harde schijf of</phrase> <phrase condition="bootable-usb">usb-stick of</phrase> <phrase condition="supports-tftp">een verbonden computer</phrase>, zodat die gebruikt kunnen worden om het installatiesysteem op te starten.

source: Downloading Files from &debian; Mirrors
ca: Descarregar fitxers de les rèpliques de &debian;
de: Dateien von einem &debian;-Spiegel-Server herunterladen
it: Recupero dei file dai mirror &debian;
nl: Bestanden downloaden van &debian; spiegelservers

source: To find the nearest (and thus probably the fastest) mirror, see the <ulink url="&url-debian-mirrors;">list of &debian; mirrors</ulink>.
ca: Per trobar la rèplica més pròxima (i possiblement la més ràpida), mireu la <ulink url="&url-debian-mirrors;">llista de rèpliques de &debian;</ulink>.
de: Um den nächstliegenden (und damit vermutlich auch schnellsten) &debian;-Spiegel-Server zu finden, konsultieren Sie die <ulink url="&url-debian-mirrors;">Liste der &debian;-Spiegel</ulink>.
it: Per scoprire qual è il mirror più vicino (e quindi probabilmente il più veloce) si consulti l'<ulink url="&url-debian-mirrors;">elenco dei mirror &debian;</ulink>.
nl: Om de dichtstbijzijnde (en dus wellicht snelste) spiegelserver te vinden, kunt u de <ulink url="&url-debian-mirrors;">lijst met &debian; spiegelservers</ulink> raadplegen.

source: Where to Find Installation Images
ca: On trobar imatges d'instal·lació
de: Wo Sie die Installations-Images finden
it: Dove trovare le immagini per l'installazione
nl: Waar u installatie-images kunt vinden

source: The installation images are located on each &debian; mirror in the directory <ulink url="&url-debian-installer;images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; the <ulink url="&url-debian-installer;images/MANIFEST">MANIFEST</ulink> lists each image and its purpose.
ca: Les imatges d'instal·lació estan ubicades en cada rèplica de &debian; al directori <ulink url="&url-debian-installer;images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; el <ulink url="&url-debian-installer;images/MANIFEST">MANIFEST</ulink> llista cada imatge i el seu propòsit.
de: Die Installations-Images liegen auf jedem &debian;-Spiegel-Server im Verzeichnis <ulink url="&url-debian-installer;images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &ndash; das <ulink url="&url-debian-installer;images/MANIFEST">MANIFEST</ulink> listet alle Images samt ihrem Einsatzzweck auf.
it: Le immagini per l'installazione sono su tutti i mirror &debian; nella directory <ulink url="&url-debian-installer;images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink>; in <ulink url="&url-debian-installer;images/MANIFEST">MANIFEST</ulink> sono elencate tutte le immagini e il loro scopo.
nl: Op elke &debian; spiegelserver bevinden de installatiemedia zich in de map <ulink url="&url-debian-installer;images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; het bestand <ulink url="&url-debian-installer;images/MANIFEST">MANIFEST</ulink> somt elk image-bestand op en waarvoor het bedoeld is.

source: Kurobox Pro Installation Files
ca: Fitxers d'instal·lació del Kurobox Pro
de: Installationsdateien für Kurobox Pro
it: File d'installazione per Kurobox Pro
nl: Installatiebestanden voor de Kurobox Pro

source: The Kurobox Pro requires a kernel and ramdisk on an ext2 partition on the disk on which you intend to install &debian;. These images can be obtained from &kuroboxpro-firmware-img;.
ca: Kurobox Pro requereix un nucli i un disc RAM en una partició ext2 en el disc en el qual desitgeu instal·lar &debian;. Aquestes imatges les podeu trobar a &kuroboxpro-firmware-img;.
de: Der Kurobox Pro erfordert einen Kernel und eine Ramdisk auf einer ext2-Partition der Festplatte, auf der Sie &debian; installieren möchten. Diese Images können Sie von &kuroboxpro-firmware-img; herunterladen.
it: Il Kurobox Pro richiede che un kernel e ramdisk siano su una partizione ext2 del disco su cui si intende installare &debian;. Queste immagini possono essere recuperate da &kuroboxpro-firmware-img;.
nl: De Kurobox Pro heeft een kernel en een ramschijf nodig, die op een ext2-partitie staan op de schijf waarop u &debian; wenst te installeren. Die images kunnen opgehaald worden van &kuroboxpro-firmware-img;.

source: HP mv2120 Installation Files
ca: Fitxers d'instal·lació de l'HP mv2120
de: Installationsdateien für HP mv2120
it: File d'installazione per HP mv2120
nl: Installatiebestanden voor de HP mv2120

source: A firmware image is provided for the HP mv2120 which will automatically boot <classname>debian-installer</classname>. This image can be installed with uphpmvault on Linux and other systems and with the HP Media Vault Firmware Recovery Utility on Windows. The firmware image can be obtained from &mv2120-firmware-img;.
ca: Es proporciona una imatge del microprogramari per l'HP mv2120 que arrencarà automàticament el <classname>debian-installer</classname>. Aquesta imatge es pot instal·lar amb l'uphpmvault a Linux i altres sistemes, i amb l'HP Media Vault Firmware Recovery Utility a Windows. La imatge de microprogramari es pot obtenir a &mv2120-firmware-img;.
de: Für den HP mv2120 wird ein Firmware-Image angeboten, das automatisch den <classname>debian-installer</classname> bootet. Dieses Image kann mit uphpmvault unter Linux und anderen Betriebssystemen installiert werden oder über das HP Media Vault Firmware Recovery Utility unter Windows. Das Firmware-Image können Sie von &mv2120-firmware-img; herunterladen.
it: L'immagine del firmware fornita per i HP mv2120 avvia automaticamente il <classname>debian-installer</classname>. L'immagine può essere installata con uphpmvault da Linux o da altri sistemi operativi oppure con HP Media Vault Firmware Recovery Utility da Windows. L'immagine del firmware può essere recuperata da &mv2120-firmware-img;.
nl: Er wordt een firmware-image voor de HP mv2120 ter beschikking gesteld dat <classname>debian-installer</classname>, het installatiesysteem van &debian;, automatisch zal opstarten. Dit image kan geïnstalleerd worden met uphpmvault op Linux en andere systemen en met het "HP Media Vault Firmware Recovery Utility" op Windows. Het firmware-image kan opgehaald worden van &mv2120-firmware-img;.

source: QNAP Turbo Station Installation Files
ca: Fitxers d'instal·lació del QNAP Turbo Station
de: Installationsdateien für QNAP Turbo Station
it: File d'installazione per QNAP Turbo Station
nl: Installatiebestanden voor het QNAP Turbo Station
