Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: Some SPARC architectures add the subarchitecture names, such as <quote>SUN4M</quote> or <quote>SUN4C</quote>, to the filename. Thus, if your system's subarchitecture is a SUN4C, and its IP is 192.168.1.3, the filename would be <filename>C0A80103.SUN4C</filename>. However, there are also subarchitectures where the file the client looks for is just <filename>client-ip-in-hex</filename>. An easy way to determine the hexadecimal code for the IP address is to enter the following command in a shell (assuming the machine's intended IP is 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> To get to the correct filename, you will need to change all letters to uppercase and if necessary append the subarchitecture name.
ca: Algunes arquitectures SPARC afegeixen els noms de la subarquitectura, com ara <quote>SUN4M</quote> o <quote>SUN4C</quote> al fitxer. És a dir, si la subarquitectura del vostre sistema és un SUN4C, i la seva IP és 192.168.1.3, el fitxer serà <filename>C0A80103.SUN4C</filename>. Però, hi ha també subarquitectures on el fitxer del client és <filename>ip-del-client-en-hex</filename>. Per a determinar fàcilment el codi hexadecimal de l'adreça IP introduïu l'ordre següent a l'intèrpret d'ordres (suposant que la IP de la màquina és 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> Per obtenir el nom de fitxer correcte, canvieu totes les lletres a majúscules i afegiu-hi si cal el nom de la subarquitectura.
de: Einige SPARC-Architekturen fügen die Namen der Unterarchitekturen wie <quote>SUN4M</quote> oder <quote>SUN4C</quote> zum Dateinamen hinzu; wenn Sie also ein System der Unterarchitektur SUN4C haben und die IP-Adresse ist 192.168.1.3, wäre der Dateiname <filename>C0A80103.SUN4C</filename>. Allerdings gibt es auch Unterarchitekturen, wo die Datei, nach der der Client sucht, einfach <filename>client-ip-in-hex</filename> ist. Ein einfacher Weg den Hexadezimal-Code für die IP-Adresse herauszufinden ist, den folgenden Befehl in eine Shell einzugeben (angenommen, die IP-Adresse der Maschine wäre 10.0.0.4): <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> Um den korrekten Dateinamen zu bekommen, müssen Sie alle Buchstaben in Großbuchstaben ändern und falls nötig den Namen der Unterarchitektur hinzufügen.
it: Alcune architetture SPARC aggiungono il nome della sottoarchitettura al nome del file, per esempio <quote>SUN4M</quote> o <quote>SUN4C</quote>. Di conseguenza se la sottoarchitettura del proprio sistema è SUN4C e il suo indirizzo IP è 192.168.1.3, il nome del file dovrebbe essere <filename>C0A80103.SUN4C</filename>. Purtroppo ci sono anche altre sottoarchitetture che usano file il cui nome è semplicemente <filename>ip-del-client-in-hex</filename>. Un modo semplice per determinare il codice in esadecimale dell'indirizzo IP è eseguire il seguente comando nella shell (si suppone che l'IP della macchina sia 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> Per ottenere il corretto nome del file è necessario cambiare tutte le lettere in maiuscole e, se necessario, aggiungere il nome della sottoarchitettura.
nl: Bij sommige SPARC-architecturen wordt de naam van de subarchitectuur, zoals <quote>SUN4M</quote> of <quote>SUN4C</quote>, toegevoegd aan de bestandsnaam. Dus, indien de subarchitectuur van uw systeem SUN4C was en zijn IP 192.168.1.3, dan zou de naam van het bestand <filename>C0A80103.SUN4C</filename> zijn. Nochtans zijn er ook subarchitecturen waarbij het bestand waarnaar de cliënt vraagt, gewoon <filename>het-ip-v/d-cliënt-in-hex</filename> is. Een gemakkelijke manier om de hexadecimale code voor het IP-adres vast te stellen, is om het volgende commando in een shell uit te voeren (in de veronderstelling dat het IP dat bedoeld is voor de machine, 10.0.0.4 is): <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> Om de correcte bestandsnaam te bekomen, zult u alle letters naar hoofdletters moeten omzetten en zo nodig de naam van de subarchitectuur toevoegen.

source: If you've done all this correctly, giving the command <userinput>boot net</userinput> from the OpenPROM should load the image. If the image cannot be found, try checking the logs on your tftp server to see which image name is being requested.
ca: Si ho heu fet tot bé, posant l'ordre <userinput>boot net</userinput> a l'OpenPROM hauria de carregar la imatge. Si la imatge no es troba, proveu de comprovar els fitxers de registre del vostre servidor tftp per veure quin és el nom de la imatge que s'ha demanat.
de: Wenn Sie all dies korrekt erledigt haben, sollte der Befehl <userinput>boot net</userinput> unter OpenPROM das Image laden. Falls das Image nicht gefunden werden kann, versuchen Sie, die Protokolle auf Ihrem tftp-Server zu kontrollieren, um herauszufinden, welcher Image-Name angefordert wurde.
it: Se tutti i passi sono stati eseguiti correttamente, usando il comando <userinput>boot net</userinput> da OpenPROM dovrebbe iniziare il caricamento dell'immagine. Se non è possibile trovare l'immagine, controllare nei log del server tftp quale nome è stato usato per richiederla.
nl: Indien u dit allemaal correct uitgevoerd heeft, zou het image geladen moeten woerden als u het commando <userinput>boot net</userinput> geeft vanuit de OpenPROM. Indien het image niet gevonden kan worden, probeer dan op de tftp-server de logbestanden te controleren om na te gaan naar welke imagenaam gevraagd wordt.

source: You can also force some sparc systems to look for a specific file name by adding it to the end of the OpenPROM boot command, such as <userinput>boot net my-sparc.image</userinput>. This must still reside in the directory that the TFTP server looks in.
ca: També podeu obligar alguns sistemes sparc a cercar un nom específic afegint-lo al final de l'ordre d'arrencada de l'OpenPROM, p.ex. <userinput>boot net my-sparc.image</userinput>. Aquest ha de ser-hi al directori on cerca el servidor TFTP.
de: Manche Sparc-Systeme kann man zwingen, nach einem bestimmten Dateinamen zu suchen, indem man ihn ans Ende des OpenPROM-Boot-Befehls anhängt, z.B. <userinput>boot net my-sparc.image</userinput>. Die Datei muss dabei immer in dem Verzeichnis liegen, in dem der TFTP-Server sucht.
it: È anche possibile forzare alcuni sistemi sparc a cercare un particolare file aggiungendone il nome alla fine del comando boot di OpenPROM, per esempio <userinput>boot net my-sparc.image</userinput>. Questo file deve essere nella directory in cui il server TFTP ricerca i file.
nl: Sommige sparc-systemen kunt u ook dwingen om te vragen naar een specifieke bestandsnaam door het toe te voegen aan het einde van het OpenPROM commando, zoals<userinput>boot net mijn-sparc.image</userinput>. Dat moet zich nog steeds in de map bevinden waarin de TFTP-server gaat kijken.

source: SGI TFTP Booting
ca: Arrencada TFTP dels SGI
de: TFTP-Boot von SGI-Systemen
it: Avvio di macchine SGI con TFTP
nl: Opstarten via TFTP met SGI

source: On SGI machines you can rely on the <command>bootpd</command> to supply the name of the TFTP file. It is given either as the <userinput>bf=</userinput> in <filename>/etc/bootptab</filename> or as the <userinput>filename=</userinput> option in <filename>/etc/dhcpd.conf</filename>.
ca: En màquines SGI, el <command>bootpd</command> proporciona el nom del fitxer TFTP. Es dóna o com a <userinput>bf=</userinput> en <filename>/etc/bootptab</filename> o com a opció <userinput>filename=</userinput> en <filename>/etc/dhcpd.conf</filename>.
de: Auf SGI-Maschinen können Sie den <command>bootpd</command>-Dienst verwenden, um den Namen der TFTP-Datei festzulegen. Er wird entweder als Wert für <userinput>bf=</userinput> in <filename>/etc/bootptab</filename> oder als Angabe für <userinput>filename=</userinput> in <filename>/etc/dhcpd.conf</filename> angegeben.
it: Sulle macchine SGI si può fare affidamento su <command>bootpd</command> per avere il nome del file TFTP; infatti può essere fornito con l'opzione <userinput>bf=</userinput> in <filename>/etc/bootptab</filename> oppure con l'opzione <userinput>filename=</userinput> in <filename>/etc/dhcpd.conf</filename>.
nl: Op SGI-machines kunt u vertrouwen op de <command>bootpd</command> om de naam van het TFTP-bestand te geven. Het wordt ofwel vermeld in <filename>/etc/bootptab</filename> als <userinput>bf=</userinput> of in <filename>/etc/dhcpd.conf</filename> met de optie <userinput>filename=</userinput>.

source: Automatic Installation
ca: Instal·lació automàtica
de: Automatische Installation
it: Installazione automatizzata
nl: Automatische installatie

source: For installing on multiple computers it's possible to do fully automatic installations. &debian; packages intended for this include <classname>fai-quickstart</classname> (which can use an install server) and the &debian; Installer itself. Have a look at the <ulink url="http://fai-project.org">FAI home page</ulink> for detailed information.
ca: Si heu d'instal·lar a molts ordinadors, és possible fer instal·lacions completament automatitzades. Els paquets dels que es disposa a &debian; per fer-ho són <classname>fai-quickstart</classname> (que pot utilitzar un servidor d'instal·lació) i el mateix instal·lador de &debian;. Vegeu la <ulink url="http://fai-project.org">pàgina de FAI</ulink> per informació més detallada.
de: Um &debian; auf einer größeren Anzahl von Rechnern zu installieren, kann man vollautomatische Installationen durchführen. Neben dem <classname>&debian;-Installer</classname> selbst ist dafür auch das Paket <classname>fai-quickstart</classname> vorgesehen (FAI kann einen Installationsserver nutzen). Schauen Sie auf die <ulink url="http://fai-project.org">FAI-Homepage</ulink> bezüglich detaillierter Informationen.
it: È possibile effettuare installazioni su parecchi computer attraverso procedure completamente automatizzate. I pacchetti &debian; adatti a questo scopo sono <classname>fai-quickstart</classname> (che usa un server di installazione) e lo stesso Installatore &debian;. Consultare la <ulink url="http://fai-project.org">pagina web di FAI </ulink> per informazioni più dettagliate.
nl: Om op verschillende computers een installatie uit te voeren is het mogelijk om de installatie volledig automatisch te laten verlopen. &debian; pakketten die hiervoor bedoeld zijn, zijn onder meer <classname>fai-quickstart</classname> (dat gebruik kan maken van een installatieserver) en het installatiesysteem zelf van &debian;. Kijk op de <ulink url="http://fai-project.org">FAI-website</ulink> voor gedetailleerde informatie.

source: Automatic Installation Using the &debian; Installer
ca: Instal·lació automàtica utilitzant l'instal·lador de &debian;
de: Automatische Installation mit dem &debian;-Installer
it: Installazione automatizzata usando l'Installatore &debian;
nl: Automatisch installeren met het installatiesysteem van &debian;

source: The &debian; Installer supports automating installs via preconfiguration files. A preconfiguration file can be loaded from the network or from removable media, and used to fill in answers to questions asked during the installation process.
ca: L'instal·lador de &debian; suporta l'automatització de la instal·lació utilitzant fitxers de preconfiguració. Es pot carregar un fitxer de preconfiguració des de la xarxa o des d'un mitjà extraïble i es fa servir per escriure-hi les respostes a totes les preguntes fetes en el procés d'instal·lació.
de: Der &debian;-Installer bietet automatische Installationen über Voreinstellungs-Dateien an. Eine solche Voreinstellungs-Datei kann über das Netzwerk oder von einem Wechselmedium geladen werden und wird benutzt, um Fragen zu beantworten, die während des Installationsprozesses auftreten.
it: L'Installatore &debian; supporta le installazioni automatizzate tramite dei file di preconfigurazione. Un file di preconfigurazione può essere caricato dalla rete o da un supporto rimovibile ed è usato per rispondere alle domande che sarebbero normalmente poste durante il processo d'installazione.
nl: Het installatiesysteem van &debian; ondersteunt het automatiseren van installaties via preconfiguratiebestanden. Een preconfiguratiebestand kan ingeladen worden over het netwerk of uit verwijderbare media en kan gebruikt worden om antwoorden te geven op de vragen die tijdens het installatieproces gesteld worden.

source: Full documentation on preseeding including a working example that you can edit is in <xref linkend="appendix-preseed"/>.
ca: Podeu trobar la documentació completa per a fer precarrega, incloent un exemple funcional que podeu editar, a <xref linkend="appendix-preseed"/>.
de: Eine vollständige Dokumentation über das Voreinstellen inklusive einer funktionsfähigen Beispieldatei, die Sie sich anpassen können, finden Sie im <xref linkend="appendix-preseed"/>.
it: La documentazione completa sulla preconfigurazione comprende anche un esempio funzionante, che è possibile modificare, si trova in <xref linkend="appendix-preseed"/>.
nl: Volledige documentatie over vooraf ingestelde antwoorden (preseeding genoemd) met inbegrip van een werkzaam voorbeeld dat u kunt bewerken, is te vinden in <xref linkend="appendix-preseed"/>.
