Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: NewWorld PowerMacs support booting from a network or an ISO9660 CD-ROM, as well as loading ELF binaries directly from the hard disk. These machines will boot Linux directly via <command>yaboot</command>, which supports loading a kernel and RAMdisk directly from an ext2 partition, as well as dual-booting with MacOS. Hard disk booting of the installer is particularly appropriate for newer machines without floppy drives. <command>BootX</command> is not supported and must not be used on NewWorld PowerMacs.
ca: Els PowerMacs NewWorld suporten arrencar des d'una xarxa o un CD-ROM ISO9660, així com carregar els binaris ELF directament des del disc dur. Aquestes màquines arrenquen directament Linux utilitzant <command>yaboot</command>, que suporta la càrrega d'un nucli i un disc RAM directament des d'una partició ext2, així com l'arrencada dual amb MacOS. Arrencar l'instal·lador des de disc dur és apropiat particularment per a màquines noves sense disquetera. El <command>BootX</command> no està suportat i no s'hauria d'utilitzar a PowerMacs NewWorld.
de: NewWorld-PowerMacs unterstützen das Booten per Netzwerk oder von einer ISO9660-CD-ROM, können aber auch ELF-Binär-Dateien direkt von der Festplatte laden. Diese Maschinen starten Linux direkt über <command>yaboot</command>, das einen Kernel und eine RAM-Disk von einer EXT2-Partition laden kann. Ebenso ist <command>yaboot</command> dual-boot-fähig mit MacOS. Den Installer von Festplatte zu booten ist auf neueren Maschinen ohne Diskettenlaufwerk die am ehesten geeignete Methode. <command>BootX</command> wird hier nicht unterstützt und sollte auf NewWorld-PowerMacs nicht benutzt werden.
it: I PowerMac NewWorld gestiscono l'avvio dalla rete, da un CD-ROM ISO9660 e anche leggendo direttamente i binari ELF dal disco fisso. Queste macchine avvieranno direttamente Linux con <command>yaboot</command> che supporta il caricamento del kernel e del ramdisk da una partizione ext2 e gestisce anche l'avvio di due sistemi operativi con MacOS. L'avvio da disco fisso dell'installatore è particolarmente indicato per le macchine più recenti che non hanno il lettore per i dischetti. <command>BootX</command> non è supportato e non deve essere usato sui PowerMac NewWorld.
nl: NewWorld Macs ondersteunen het opstarten vanaf het netwerk of van een ISO9660 CD, evenals het rechtstreeks laden van binaire ELF-bestanden van de harde schijf. Deze machines kunnen Linux rechtstreeks starten via <command>yaboot</command>. Dat ondersteunt het rechtstreeks laden van een kernel en een RAM-schijf vanaf een ext2-partitie en het ondersteunt ook een dual-boot systeem met MacOS. Het opstarten van het installatiesysteem vanaf harde schijf is in het bijzonder geschikt voor nieuwere machines zonder diskettestation. <command>BootX</command> wordt niet ondersteund en moet op NewWorld PowerMacs niet gebruikt worden.

source: <emphasis>Copy</emphasis> (not move) the following four files which you downloaded earlier from the &debian; archives, onto the root level of your hard drive (this can be accomplished by <keycap>option</keycap>-dragging each file to the hard drive icon).
ca: <emphasis>Copieu</emphasis> (no mogueu) els quatre fitxers següents que heu descarregat anteriorment des de l'arxiu de &debian;, a l'arrel del vostre disc dur (açò podria aconseguir-se amb <keycap>option</keycap>-arrossegar cada fitxer a la icona del disc dur).
de: <emphasis>Kopieren</emphasis> (nicht verschieben) Sie die folgenden vier Dateien, die Sie bereits vorher von einem &debian;-Archiv heruntergeladen haben, in das Root-Verzeichnis Ihrer Festplatte: (Sie können dies auch erledigen, indem Sie jede Datei per Maus auf das Festplatten-Icon fallen lassen und dabei die <keycap>Option</keycap>-Taste gedrückt halten.)
it: <emphasis>Copiare</emphasis> (non spostare) i seguenti quattro file, che devono essere preventivamente scaricati dagli archivi &debian;, nella directory principale del disco fisso (questo si può fare trascinando ciascun file sull'icona del disco mentre si tiene premuto <keycap>option</keycap>).
nl: <emphasis>Kopieer</emphasis> (niet verplaatsen) de volgende vier bestanden die u eerder downloadde van de &debian; archieven, naar de hoofdmap van uw harde schijf (dit kunt u doen door de <keycap>option</keycap>-toets ingedrukt te houden en elk bestand naar het icoontje van de harde schijf te slepen).

source: Make a note of the partition number of the MacOS partition where you place these files. If you have the MacOS <command>pdisk</command> program, you can use the <command>L</command> command to check for the partition number. You will need this partition number for the command you type at the Open Firmware prompt when you boot the installer.
ca: Anoteu el nombre de la partició del MacOS on poseu aquests fitxers. Si teniu el programa de MacOS <command>pdisk</command>, podeu fer servir l'ordre <command>L</command> per comprovar el nombre de la partició. Necessitareu aquest nombre de partició per l'ordre que escriureu a la sol·licitud de l'Open Firmware quan arrenqueu l'instal·lador.
de: Notieren Sie sich die Partitionsnummer der MacOS-Partition, auf der Sie die Dateien abgespeichert haben. Wenn Sie das MacOS-Programm <command>pdisk</command> installiert haben, können Sie mittels der Tastenfunktion <command>L</command> die Partitionsnummer herausfinden. Sie benötigen diese Nummer, wenn Sie den Boot-Befehl am OpenFirmware-Prompt eingeben, um den Installer zu starten.
it: Prendere nota del numero della partizione MacOS su cui si copiano questi file. Se si dispone del programma MacOS <command>pdisk</command> si può usare il comando <command>L</command> per ottenere il numero della partizione. Questo numero è necessario per il comando da dare al prompt di Open Firmware per avviare l'installatore.
nl: Noteer het partitienummer van de MacOS-partitie waarop u deze bestanden plaatst. Indien u het programma <command>pdisk</command> van MacOS gebruikt, kunt u daarvan het commando <command>L</command> gebruiken om het partitienummer te controleren. U zult dit partitienummer nodig hebben voor het commando dat u aan de prompt van Open Firmware intypt wanneer u het installatiesysteem opstart.

source: To boot the installer, proceed to <xref linkend="boot-newworld"/>.
ca: Per arrencar l'instal·lador, continueu a <xref linkend="boot-newworld"/>.
de: Um jetzt den Installer zu booten, machen Sie in <xref linkend="boot-newworld"/> weiter.
it: Per avviare l'installatore procedere con <xref linkend="boot-newworld"/>.
nl: Om het installatiesysteem op te starten, moet u te werk gaan zoals beschreven in <xref linkend="boot-newworld"/>.

source: Preparing Files for TFTP Net Booting
ca: Preparació dels fitxers per a l'arrencada en xarxa TFTP
de: Dateien vorbereiten für TFTP-Netzwerk-Boot
it: Preparazione dei file per l'avvio TFTP da rete
nl: Bestanden klaarmaken om over het netwerk op te starten met TFTP

source: If your machine is connected to a local area network, you may be able to boot it over the network from another machine, using TFTP. If you intend to boot the installation system from another machine, the boot files will need to be placed in specific locations on that machine, and the machine configured to support booting of your specific machine.
ca: Si teniu una màquina connectada a una xarxa d'àrea local, podeu arrencar-la des d'una altra màquina de la xarxa fent servir TFTP. Si voleu arrencar el sistema d'instal·lació des d'una altra màquina, els fitxers d'arrencada hauran de col·locar-se a llocs específics d'aquesta, la qual ha de configurar-se a fi de permetre l'arrencada de la vostra.
de: Wenn Ihr Rechner mit einem Netzwerk (Local Area Network, LAN) verbunden ist, sind Sie vielleicht in der Lage, über das Netzwerk per TFTP von einem anderen Rechner aus zu booten. Wenn Sie dies vorhaben, müssen die Boot-Dateien in speziellen Verzeichnissen auf diesem entfernten Rechner abgelegt werden und der Rechner muss für das Booten speziell Ihrer Maschine konfiguriert werden.
it: Se la propria macchina è connessa a una rete locale allora è possibile avviarla tramite TFTP da un'altra macchina. Se si vuole avviare il sistema d'installazione da un'altra macchina è necessario che i file d'avvio siano contenuti in particolari directory di questa macchina e che sia configurata per gestire l'avvio della propria macchina.
nl: Indien uw machine verbonden is met een lokaal netwerk, kunt u ze misschien over het netwerk vanaf een andere machine laten opstarten met TFTP. Indien u van plan bent het installatiesysteem op te starten vanaf een andere machine, moeten de opstartbestanden op een specifieke plaats op die machine geplaatst worden en moet die machine geconfigureerd worden om het opstarten van specifiek uw machine te ondersteunen.

source: You need to set up a TFTP server, and for many machines a DHCP server<phrase condition="supports-rarp">, or RARP server</phrase><phrase condition="supports-bootp">, or BOOTP server</phrase>.
ca: Heu d'instal·lar un servidor TFTP, i en nombroses màquines, cal també un servidor DHCP <phrase condition="supports-rarp">, o un servidor RARP</phrase><phrase condition="supports-bootp">, o un servidor BOOTP</phrase>.
de: Sie müssen einen TFTP-Server einrichten und in vielen Fällen auch einen DHCP-Server<phrase condition="supports-rarp"> oder einen RARP-Server</phrase><phrase condition="supports-bootp"> oder einen BOOTP-Server</phrase>.
it: È necessario attivare un server TFTP e, per più macchine un server DHCP<phrase condition="supports-rarp"> o un server RARP</phrase><phrase condition="supports-bootp"> o un server BOOTP</phrase>.
nl: U moet een TFTP-server opzetten en voor veel machines een DHCP-server<phrase condition="supports-rarp">, of een RARP-server</phrase><phrase condition="supports-bootp"> of een BOOTP-server</phrase>.

source: <phrase condition="supports-rarp">The Reverse Address Resolution Protocol (RARP) is one way to tell your client what IP address to use for itself. Another way is to use the BOOTP protocol.</phrase> <phrase condition="supports-bootp">BOOTP is an IP protocol that informs a computer of its IP address and where on the network to obtain a boot image.</phrase> The DHCP (Dynamic Host Configuration Protocol) is a more flexible, backwards-compatible extension of BOOTP. Some systems can only be configured via DHCP.
ca: <phrase condition="supports-rarp">El protocol de resolució inversa d'adreces (RARP) és una manera d'indicar al vostre client les adreces IP que ha d'emprar. Una altra manera és fer servir el protocol BOOTP.</phrase> <phrase condition="supports-bootp">BOOTP és un protocol IP que indica a l'ordinador la seua pròpia adreça IP i el lloc de la xarxa on obtenir la imatge d'arrencada.</phrase> El DHCP (Protocol de configuració dinàmica d'ordinadors centrals) és una extensió més flexible, i compatible, del BOOTP. Alguns sistemes només es poden configurar fent servir el DHCP.
de: <phrase condition="supports-rarp">Das Reverse-Address-Resolution-Protocol (RARP) ist eine Möglichkeit, dem Client mitzuteilen, welche IP-Adresse er selbst verwenden soll. Ein anderer Weg wäre, das BOOTP-Protokoll zu verwenden.</phrase> <phrase condition="supports-bootp">BOOTP ist ein IP-Protokoll, das einem Computer seine IP-Adresse mitteilt und wo er im Netzwerk ein Boot-Image findet.</phrase> Das Dynamic-Host-Configuration-Protocol (DHCP) ist eine flexiblere, rückwärts-kompatible Erweiterung von BOOTP. Einige Systeme können nur per DHCP konfiguriert werden.
it: <phrase condition="supports-rarp">Il RARP (Reverse Address Resolution Protocol) è un metodo per comunicare ai client quale indirizzo IP usare. In alternativa è possibile usare il protocollo BOOTP.</phrase> <phrase condition="supports-bootp">BOOTP è un protocollo IP che comunica a un computer qual è il proprio indirizzo IP e dove può recuperare dalla rete un'immagine per l'avvio.</phrase> Il DHCP (Dynamic Host Configuration Protocol) è una estensione più flessibile ma compatibile all'indietro di BOOTP. Alcuni sistemi possono essere configurati solo tramite DHCP.
nl: <phrase condition="supports-rarp">Het Reverse Address Resolution Protocol (RARP) is een manier om uw cliënt te laten weten welk IP-adres hij voor zichzelf moet gebruiken. Een andere manier is om het BOOTP-protocol te gebruiken.</phrase> <phrase condition="supports-bootp">BOOTP is een IP-protocol dat een computer zijn IP-adres geeft en hem zegt waar op het netwerk hij een opstart-image kan krijgen.</phrase> Het DHCP (Dynamic Host Configuration Protocol) is een meer flexibele en neerwaarts compatibele uitbreiding van BOOTP. Sommige systemen kunnen enkel via DHCP geconfigureerd worden.

source: For PowerPC, if you have a NewWorld Power Macintosh machine, it is a good idea to use DHCP instead of BOOTP. Some of the latest machines are unable to boot using BOOTP.
ca: Per als PowerPC, si teniu una màquina NewWorld Power Macintosh, és bona idea emprar el DHCP en lloc del BOOTP. Algunes de les màquines més noves no poden arrencar si empreu el BOOTP.
de: Auf PowerPCs &ndash; wenn Sie einen NewWorld-PowerMac haben &ndash; ist es eine gute Idee, DHCP statt BOOTP zu benutzen. Einige der Maschinen der letzten Generationen können nicht per BOOTP starten.
it: Su PowerPC, se si possiede una macchina Power Macintosh NewWorld, è consigliabile usare DHCP anziché BOOTP. Alcune delle macchine più recenti non sono capaci di fare l'avvio usando BOOTP.
nl: Het is bij PowerPC best om DHCP in plaats van BOOTP te gebruiken, als u over een NewWorld Power Macintosh machine beschikt. Sommige van de meest recente machines kunnen niet opstarten met behulp van BOOTP.

source: Some older HPPA machines (e.g. 715/75) use RBOOTD rather than BOOTP. There is an <classname>rbootd</classname> package available in &debian;.
ca: Algunes màquines HPPA més antigues (p.ex. 715/75) usen l'RBOOTD en lloc del BOOTP. Hi ha un paquet <classname>rbootd</classname> a l'abast en &debian;.
de: Einige ältere HPPA-Maschinen (wie z.B. 715/75) funktionieren eher mit RBOOTD als mit BOOTP. Ein <classname>rbootd</classname>-Paket ist in &debian; verfügbar.
it: Alcune delle macchine HPPA più vecchie (p.e. 715/75) usano RBOOTD anziché BOOTP, in &debian; è disponibile il pacchetto <classname>rbootd</classname>.
nl: Sommige oudere HPPA machines (bijv. 715/75) gebruiken RBOOTD in plaats van BOOTP. In &debian; kunt u een <classname>rbootd</classname> pakket vinden.

source: The Trivial File Transfer Protocol (TFTP) is used to serve the boot image to the client. Theoretically, any server, on any platform, which implements these protocols, may be used. In the examples in this section, we shall provide commands for SunOS 4.x, SunOS 5.x (a.k.a. Solaris), and GNU/Linux.
ca: El protocol de transferència trivial de fitxers (TFTP) s'empra per posar a disposició del client la imatge d'arrencada. En teoria, es pot usar qualsevol servidor de qualsevol plataforma que implemente aquests protocols. Els exemples d'aquesta secció ofereixen instruccions per al SunOS 4.x, el SunOS 5.x (àlies Solaris) i el GNU/Linux.
de: Das Trivial-File-Transfer-Protocol (TFTP) wird benutzt, um dem Client das Boot-Image zur Verfügung zu stellen. Theoretisch könnte jeder Server auf jeder Plattform benutzt werden, der diese Protokolle implementiert. In den Beispielen in diesem Abschnitt geben wir Kommandos für SunOS 4.x, SunOS 5.x (a.k.a. Solaris) und GNU/Linux an.
it: Il TFTP (Trivial File Transfer Protocol) è usato per fornire l'immagine di avvio al client. Teoricamente si può usare un qualsiasi server, su qualsiasi architettura che implementi questo protocollo. Negli esempi di questa sezione sono presentati i comandi per SunOS 4.x, SunOS 5.x (noti come Solaris) e GNU/Linux.
nl: Het Trivial File Transfer Protocol (TFTP) wordt gebruikt om het opstart-image aan te leveren aan de cliënt. In theorie kan elke server op gelijk welk platform die in staat is om deze protocollen te gebruiken, gebruikt worden. In de voorbeelden in dit gedeelte zullen we de commando's demonstreren voor SunOS 4.x, SunOS 5.x (ook Solaris genoemd) en GNU/Linux.

source: For a &debian-gnu; server we recommend <classname>tftpd-hpa</classname>. It's written by the same author as the <classname>syslinux</classname> bootloader and is therefore least likely to cause issues. A good alternative is <classname>atftpd</classname>.
ca: Per a un servidor &debian-gnu; es recomana <classname>tftpd-hpa</classname>. Ha estat escrit pel mateix autor del carregador d'arrencada <classname>syslinux</classname> i és per tant el que menys problemes hauria de donar. Una bona alternativa és <classname>atftpd</classname>.
de: Für einen &debian-gnu;-Server empfehlen wir <classname>tftpd-hpa</classname>. Es wurde vom gleichen Autor geschrieben wie der <classname>syslinux</classname>-Bootloader und daher ist die Wahrscheinlichkeit, dass er Probleme verursacht, hierbei wohl am geringsten. Eine gute Alternative ist <classname>atftpd</classname>.
it: Su un server &debian-gnu; è raccomandato <classname>tftpd-hpa</classname>. È scritto dallo stesso autore del bootloader <classname>syslinux</classname> e quindi è poco probabile che crei dei problemi. Una buona alternativa è <classname>atftpd</classname>.
nl: Voor een &debian-gnu;-server bevelen we <classname>tftpd-hpa</classname> aan. Het werd geschreven door de auteur die ook de opstartlader <classname>syslinux</classname> schreef en het is daarom het minst waarschijnlijk dat er zich problemen zullen voordoen. Een goed alternatief is <classname>atftpd</classname>.

source: Setting up RARP server
ca: Configuració d'un servidor RARP
de: Einen RARP-Server einrichten
it: Attivazione di un server RARP
nl: Een RARP-server opzetten

source: To set up RARP, you need to know the Ethernet address (a.k.a. the MAC address) of the client computers to be installed. If you don't know this information, you can <phrase arch="sparc"> pick it off the initial OpenPROM boot messages, use the OpenBoot <userinput>.enet-addr</userinput> command, or </phrase> boot into <quote>Rescue</quote> mode (e.g., from the rescue floppy) and use the command <userinput>ip addr show dev eth0</userinput>.
ca: Per configurar el RARP, necessitareu l'adreça Ethernet (és a dir l'adreça MAC) dels clients on instal·lar-se. Si no sabeu aquesta informació, podeu <phrase arch="sparc">agafar-la dels missatges d'arrencada de l'OpenPROM, utilitzar l'ordre OpenBoot <userinput>.enet-addr</userinput>, o </phrase> arrencar amb el mode de <quote>recuperació</quote> (és a dir des del disquet de recuperació) i utilitzar l'ordre <userinput>ip addr show dev eth0</userinput>.
de: Um RARP einzurichten, benötigen Sie die Ethernet-Adresse (a.k.a. die MAC-Adresse) des Clients, der gestartet werden soll. Wenn Ihnen diese Informationen nicht bekannt sind, können Sie<phrase arch="sparc"> sie aus den OpenPROM-Boot-Meldungen auslesen, den OpenBoot-Befehl <userinput>.enet-addr</userinput> benutzen oder</phrase> in den <quote>Rescue</quote>-Modus booten (z.B. mittels einer Rettungsdiskette) und dort das Kommando <userinput>ip addr show dev eth0</userinput> verwenden.
it: Per impostare un server RARP è necessario conoscere l'indirizzo Ethernet (noto anche come indirizzo MAC) dei computer client da installare. Se non si conoscono queste informazioni è possibile <phrase arch="sparc">leggerlo nei primi messaggi durante l'avvio di OpenPROM, usare il comando <userinput>.enet-addr</userinput> di OpenBoot oppure</phrase> avviare in modalità <quote>Ripristino</quote> (p.e. da un dischetto di ripristino) e usare il comando <userinput>ip addr show dev eth0</userinput>.
nl: Om RARP op te zetten, moet u het Ethernet-adres (ook MAC-adres genoemd) kennen van de cliëntcomputers die geïnstalleerd moeten worden. Indien u niet over deze informatie beschikt, kunt u ze <phrase arch="sparc"> oppikken uit de initiële opstartberichten van OpenPROM, het OpenBoot commando <userinput>.enet-addr</userinput> gebruiken of </phrase> opstarten in <quote>Rescue</quote>-modus (reparattiemodus) (bijv. met een reparatiediskette) en het commando <userinput>ip addr show dev eth0</userinput> gebruiken.

source: On a RARP server system using a Linux kernel or Solaris/SunOS, you use the <command>rarpd</command> program. You need to ensure that the Ethernet hardware address for the client is listed in the <quote>ethers</quote> database (either in the <filename>/etc/ethers</filename> file, or via NIS/NIS+) and in the <quote>hosts</quote> database. Then you need to start the RARP daemon. Issue the command (as root): <userinput>/usr/sbin/rarpd -a</userinput> on most Linux systems and SunOS 5 (Solaris 2), <userinput>/usr/sbin/in.rarpd -a</userinput> on some other Linux systems, or <userinput>/usr/etc/rarpd -a</userinput> in SunOS 4 (Solaris 1).
ca: A un servidor RARP que utilitze un nucli de Linux o Solaris/SunOS, podeu utilitzar l'ordre <command>rarpd</command>. Assegureu-vos que l'adreça física Ethernet del client és a la base de dades <quote>ethers</quote> (o bé al fitxer <filename>/etc/ethers</filename>, o via NIS/NIS+) i a la base de dades <quote>hosts</quote>. Necessitareu aleshores iniciar el dimoni RARP. Executeu (com a root) l'ordre: <userinput>/usr/sbin/rarpd -a</userinput> a la majoria dels sistemes Linux i SunOS 5 (Solaris 2), <userinput>/usr/sbin/in.rarpd -a</userinput> a altres sistemes Linux o bé <userinput>/usr/etc/rarpd -a</userinput> al SunOS 4 (Solaris 1).
de: Auf einem RARP-Server, der unter Linux oder Solaris/SunOS läuft, benutzen Sie das Programm <command>rarpd</command>. Sie müssen sicherstellen, dass die Ethernet-Hardware-Adresse des Clients in der <quote>ethers</quote>-Datenbank aufgelistet ist (entweder in der Datei <filename>/etc/ethers</filename> oder per NIS/NIS+) sowie in der <quote>hosts</quote>-Datenbank. Dann starten Sie den RARP-Daemon. Benutzen Sie auf den meisten Linux-Systemen und unter SunOS 5 (Solaris 2) folgenden Befehl (als root): <userinput>/usr/sbin/rarpd -a</userinput>; auf einigen Linux-Systemen könnte es auch <userinput>/usr/sbin/in.rarpd -a</userinput> sein und unter SunOS 4 (Solaris 1) <userinput>/usr/etc/rarpd -a</userinput>.
it: Su un server RARP con kernel Linux oppure con Solaris/SunOS, usare il programma <command>rarpd</command>. Assicurarsi che l'indirizzo Ethernet del client sia elencato nel database <quote>ethers</quote> (nel file <filename>/etc/ethers</filename> o tramite NIS/NIS+) e nel database <quote>hosts</quote>. Poi si deve avviare il demone RARP eseguendo (da root): <userinput>/usr/sbin/rarpd -a</userinput> per la maggior parte dei sistemi Linux e SunOS 5 (Solaris 2), <userinput>/usr/sbin/in.rarpd -a</userinput> per alcuni sistemi Linux oppure <userinput>/usr/etc/rarpd -a</userinput> per SunOS 4 (Solaris 1).
nl: Op een RARP serversysteem met een Linux-kernel of Solaris/SunOS gebruikt u het programma <command>rarpd</command>. Vergewis u ervan dat het Ethernet hardwareadres van de cliënt opgenomen is in de <quote>ethers</quote> databank (ofwel in het bestand <filename>/etc/ethers</filename> of via NIS/NIS+) en in de <quote>hosts</quote> databank. Dan moet u de RARP achtergronddienst starten. Geef (als systeembeheerder) het commando: <userinput>/usr/sbin/rarpd -a</userinput> op de meeste Linux-systemen en op SunOS 5 (Solaris 2), <userinput>/usr/sbin/in.rarpd -a</userinput> op sommige andere Linux-systemen of <userinput>/usr/etc/rarpd -a</userinput> op SunOS 4 (Solaris 1).

source: Setting up a DHCP server
ca: Configurar un servidor DHCP
de: Einen DHCP-Server einrichten
it: Attivazione di un server DHCP
nl: Een DHCP-server opzetten
