Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: Writing Disk Images with <command>suntar</command>
ca: Gravar les imatges amb <command>suntar</command>
de: Disk-Images schreiben mit <command>suntar</command>
it: Scrivere le immagini dei dischi con <command>suntar</command>
nl: Schijf-images schrijven met <command>suntar</command>

source: Obtain <command>suntar</command> from <ulink url="&url-powerpc-suntar;"> </ulink>. Start the <command>suntar</command> program and select <quote>Overwrite Sectors...</quote> from the <userinput>Special</userinput> menu.
ca: Descarregueu <command>suntar</command> des de <ulink url="&url-powerpc-suntar;"> </ulink>. Executeu el <command>suntar</command> i seleccioneu <quote>Overwrite Sectors...</quote> des del menú <userinput>Special</userinput>.
de: Laden Sie sich <command>suntar</command> von <ulink url="&url-powerpc-suntar;"> </ulink> herunter. Starten Sie <command>suntar</command> und wählen Sie <quote>Overwrite Sectors...</quote> aus dem <userinput>Special</userinput>-Menü.
it: Procurarsi <command>suntar</command> da <ulink url="&url-powerpc-suntar;"></ulink>. Avviare il programma <command>suntar</command> e scegliere <quote>Overwrite Sectors...</quote> dal menu <userinput>Special</userinput>.
nl: Download <command>suntar</command> van <ulink url="&url-powerpc-suntar;"> </ulink>. Start het programma <command>suntar</command> en selecteer <quote>Overwrite Sectors... (Sectoren overschrijven)</quote> in het menu <userinput>Special (Extra)</userinput>.

source: Insert the floppy disk as requested, then hit &enterkey; (start at sector 0).
ca: Inseriu el disquet com es demana, i premeu &enterkey; (comença al sector 0).
de: Legen Sie die Diskette wie aufgefordert ein und drücken Sie dann &enterkey; (Start at Sector 0).
it: Inserire, come richiesto, un dischetto e poi premere &enterkey; (inizia dal settore 0).
nl: Steek zoals gevraagd de diskette in het station en druk op &enterkey; (start at sector 0 - begin bij sector 0).

source: Select the <filename>root.bin</filename> file in the file-opening dialog.
ca: Trieu el fitxer <filename>root.bin</filename> al diàleg d'obrir fitxers.
de: Wählen Sie in dem Dateiauswahl-Dialog <filename>root.bin</filename> aus.
it: Scegliere il file <filename>root.bin</filename> nella finestra di dialogo di selezione del file da aprire.
nl: Selecteer het bestand <filename>root.bin</filename> in het dialoogvenster 'bestand openen'.

source: After the floppy has been created successfully, select <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. If there are any errors writing the floppy, simply toss that floppy and try another.
ca: Desprès de generar el disquet, trieu <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. Si hi ha errors escrivint al disquet, llenceu el disquet i proveu amb un altre.
de: Nachdem die Diskette erfolgreich erstellt wurde, wählen Sie <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. Falls es beim Beschreiben der Floppy Fehlermeldungen gab, werfen Sie sie weg und probieren Sie eine andere.
it: Una volta che il dischetto è stato creato con successo, scegliere <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. Se si verificano degli errori durante la scrittura sul dischetto, buttare quel dischetto e provare con un altro.
nl: Nadat de diskette succesvol aangemaakt werd, selecteert u <menuchoice> <guimenu>File (Bestand)</guimenu> <guimenuitem>Eject (Uitwerpen)</guimenuitem> </menuchoice>. Indien er zich bij het schrijven van de diskette fouten voordoen, werp de diskette dan gewoon weg en probeer met een andere.

source: Before using the floppy you created, <emphasis>set the write protect tab</emphasis>! Otherwise if you accidentally mount it in MacOS, MacOS will helpfully ruin it.
ca: Abans d'utilitzar el disquet que heu preparat, <emphasis>protegiu el disquet contra escriptura amb la pestanya</emphasis>! Si no ho feu i munteu accidentalment al MacOS, probablement l'espatllarà.
de: Bevor Sie die erstellte Diskette benutzen, <emphasis>setzen Sie den Schreibschutz</emphasis>! Andernfalls wird sie möglicherweise zerstört, falls sie unter MacOS versehentlich ins Dateisystem eingebunden wird.
it: Prima di usare i dischetti appena creati <emphasis>spostare la linguetta per proteggere il dischetto dalla scrittura</emphasis>! Altrimenti, se accidentalmente si monta il dischetto sotto MacOS, MacOS lo rovinerà.
nl: Voor u de aangemaakte diskette gaat gebruiken, doet u er goed aan <emphasis>het lipje om de diskette tegen schrijven te beveiligen, te sluiten</emphasis>! Anders zal MacOS u graag helpen ze te verknoeien als u ze per ongeluk in MacOS aankoppelt.

source: Preparing Files for USB Memory Stick Booting
ca: Preparació dels fitxers per arrencar amb el llapis de memòria USB
de: Dateien vorbereiten für das Booten von einem USB-Memory-Stick
it: Preparazione dei file per l'avvio da chiavetta USB
nl: Bestanden klaar maken om van een USB-geheugenstick op te starten

source: To prepare the USB stick, you will need a system where GNU/Linux is already running and where USB is supported. With current GNU/Linux systems the USB stick should be automatically recognized when you insert it. If it is not you should check that the usb-storage kernel module is loaded. When the USB stick is inserted, it will be mapped to a device named <filename>/dev/sdX</filename>, where the <quote>X</quote> is a letter in the range a-z. You should be able to see to which device the USB stick was mapped by running the command <command>dmesg</command> after inserting it. To write to your stick, you may have to turn off its write protection switch.
ca: Per preparar el llapis USB, necessitareu un sistema amb GNU/Linux que suporti dispositius USB. Els sistemes GNU/Linux actuals normalment reconeixen automàticament els llapis USB així que es connecten. Si no és el cas, hauríeu de comprovar que s'ha carregat el mòdul «usb-storage» del nucli. Quan connecteu el llapis USB, aquest estarà representat per un dispositiu anomenat <filename>/dev/sdX</filename>, on la <quote>X</quote> és una lletra en minúscules (a-z). Hauríeu de poder veure de quin dispositiu es tracta més exactament executant l'ordre <command>dmesg</command> després de connectar-lo. Per escriure-hi, és possible que calgui desactivar la protecció d'escriptura del llapis USB.
de: Um den USB-Stick vorzubereiten, benötigen Sie ein System, auf dem GNU/Linux bereits läuft und das USB unterstützt. Auf aktuellen GNU/Linux-Systemen sollte der USB-Stick automatisch erkannt werden, sobald Sie ihn einstecken. Falls nicht, sollten Sie sicherstellen, dass das usb-storage-Kernelmodul geladen ist. Beim Einstecken wird dem USB-Stick ein Gerät namens <filename>/dev/sdX</filename> zugewiesen, wobei <quote>X</quote> ein Buchstabe im Bereich zwischen a und z ist. Es sollte Ihnen möglich sein zu erkennen, welches Gerät dem Stick zugewiesen wurde, indem Sie den Befehl <command>dmesg</command> ausführen, nachdem der USB-Stick eingesteckt wurde. Um den Stick zu beschreiben, müssen Sie eventuell noch mit dem entsprechenden Schalter am Stick den Schreibschutz deaktivieren (falls Ihr Stick solch einen Schalter hat).
it: Per preparare la chiavetta USB è necessario un sistema GNU/Linux con supporto USB già funzionante. Con gli attuali sistemi GNU/Linux la chiavetta USB dovrebbe essere riconosciuta non appena inserita. Se questo non accade, controllare che il modulo del kernel usb-storage sia stato caricato. All'inserimento, la chiavetta USB viene mappata su un device con nome <filename>/dev/sdX</filename>, dove <quote>X</quote> è una lettera nell'intervallo a-z. È possibile vedere su quale device è stata mappata la chiavetta USB usando il comando <command>dmesg</command> dopo averla inserita. Per scrivere sulla chiavetta potrebbe essere necessario disattivare la protezione dalla scrittura.
nl: Om een USB-stick klaar te maken, heeft u een systeem nodig waarop GNU/Linux reeds actief is en dat USB ondersteunt. Op de huidige GNU/Linux-systemen zou de USB-stick automatisch herkend moeten worden als u hem in de USB-aansluiting plaatst. Als dat niet gebeurt moet u nagaan of de kernel-module usb-storage geladen is. Als u de USB-stick in de aansluiting plaatst, zal hij herkend worden als een apparaat met als naam <filename>/dev/sdX</filename>, waarbij de <quote>X</quote> een letter is uit het bereik a-z. U kunt nagaan als welk apparaat de USB-stick herkend werd, door het commando <command>dmesg</command> uit te voeren nadat u de stick in de aansluiting plaatste. Om naar uw stick te kunnen schrijven, kan het nodig zijn om het schakelaartje dat hem tegen schrijven beveiligd, op uit te zetten.

source: The procedures described in this section will destroy anything already on the device! Make very sure that you use the correct device name for your USB stick. If you use the wrong device the result could be that all information on for example a hard disk could be lost.
ca: Aneu amb compte, tots els procediments que es descriuen en aquesta secció destruiran tot el que hi hagi al dispositiu. Assegureu-vos que esteu utilitzant el nom de dispositiu corresponent al llapis USB. Si utilitzeu un nom de dispositiu incorrecte podeu arribar a perdre les dades de, per exemple, el disc dur principal.
de: Die in diesem Abschnitt beschriebenen Vorgehensweisen werden alle Daten zerstören, die sich bereits auf dem Gerät befinden! Vergewissern Sie sich, dass Sie den korrekten Gerätenamen (nämlich den Ihres USB-Sticks) verwenden. Wenn Sie einen falschen Namen verwenden, könnte dies dazu führen, dass Sie z.B. alle Daten auf Ihrer Festplatte verlieren!
it: La procedura descritta in questa sezione distrugge qualunque cosa sia presente sul device, fare attenzione a usare il nome corretto per il device della chiavetta USB. Se si usa il device sbagliato, potrebbe accadere, per esempio, di perdere tutte le informazioni su un disco fisso.
nl: De procedures die in dit deel beschreven worden zullen alles wat al op het apparaat staat, verwijderen! Vergewis u er dus heel goed van dat u de correcte apparaatnaam gebruikt voor uw USB-stick. Indien u de verkeerde apparaatnaam gebruikt, kan het resultaat zijn dat alle informatie op bijvoorbeeld een harde schijf, verloren gaat.

source: Preparing a USB stick using a hybrid CD or DVD image
ca: Preparar una memòria USB fent servir una imatge híbrida CD o DVD
de: Einen USB-Stick vorbereiten mit einem Hybrid-CD- oder -DVD-Image
it: Preparazione di una chiavetta USB con un'immagine ibrida di CD o DVD
nl: Een USB-stick klaar maken met een hybride CD- of DVD-image

source: Debian CD and DVD images can now be written directly to a USB stick, which is a very easy way to make a bootable USB stick. Simply choose a CD or DVD image (such as the netinst, CD-1, DVD-1, or netboot) that will fit on your USB stick. See <xref linkend="official-cdrom"/> to get a CD or DVD image.
ca: Les imatges en CD i DVD de Debina es poden escriure directament a una memòria USB, que resulta ésser un sistema molt senzill d'obtenir una memòria USB arrencable. Seleccioneu una imatge en CD o DVD (ja sigui la d'instal·lació per xarxa, «netinst», CD-1, DVD-1 o la d'arrencada per xarxa, «netboot») per a posar-la en la vostra memòria USB. Vegeu <xref linkend="official-cdrom"/> per a obtenir una imatge en CD o DVD.
de: Debian-CD- und -DVD-Images können jetzt direkt auf einen USB-Stick geschrieben werden, was ein sehr einfacher Weg ist, einen bootfähigen USB-Stick zu erstellen. Wählen Sie einfach ein CD- oder DVD-Image, das auf Ihren Stick passt (z.B. das netinst-, CD-1-, DVD-1- oder netboot-Image). Auf <xref linkend="official-cdrom"/> finden Sie Informationen darüber, wie Sie sich ein CD- oder DVD-Image besorgen.
it: Adesso è possibile scrivere le immagini dei CD o DVD Debian direttamente sulla chiavetta USB, questo è un metodo estremamente semplice per creare una chiavetta USB dalla quale è possibile avviare il sistema. È sufficiente scegliere un'immagine (netinst, CD-1, DVD-1 oppure netboot) di dimensione adatta alla capacità della chiavetta USB. Si veda <xref linkend="official-cdrom"/> per procurarsi l'immagine di un CD o DVD.
nl: Debian CD- en DVD-images kunnen nu rechtstreeks naar een USB-stick geschreven worden, wat een erg gemakkelijke manier is om een opstartbare USB-stick aan te maken. Kies gewoon een CD- of DVD-image (zoals het netinst, CD-1, DVD-1 of netboot-image) dat past op uw USB-stick. Ga naar <xref linkend="official-cdrom"/> om een CD- of DVD-image op te halen.

source: Alternatively, for very small USB sticks, only a few megabytes in size, you can download the <filename>mini.iso</filename> image from the <filename>netboot</filename> directory (at the location mentioned in <xref linkend="where-files"/>).
ca: Una altra opció, per a memòries USB molt petites, només d'alguns megabits de capacitat, és descarregar la imatge <filename>mini.iso</filename> des del directori <filename>netboot</filename> (a l'adreça citada a <xref linkend="where-files"/>).
de: Alternativ können Sie bei sehr kleinen USB-Sticks, die nur ein paar Megabyte groß sind, das <filename>mini.iso</filename>-Image aus dem <filename>netboot</filename>-Verzeichnis herunterladen (<xref linkend="where-files"/> gibt nähere Informationen, wo Sie dies finden).
it: In alternativa per le chiavette USB estremamente piccole, con capacità di pochi megabyte, è possibile scaricare l'immagine <filename>mini.iso</filename> dalla directory <filename>netboot</filename> (nella posizione specificata in <xref linkend="where-files"/>).
nl: Als een alternatieve mogelijkheid voor zeer kleine USB-sticks van slechts enkele megabytes groot, kunt u het <filename>mini.iso</filename>-image uit de <filename>netboot</filename>-map downloaden (op de in <xref linkend="where-files"/> vermelde plaats).

source: The CD or DVD image you choose should be written directly to the USB stick, overwriting its current contents. For example, when using an existing GNU/Linux system, the CD or DVD image file can be written to a USB stick as follows, after having made sure that the stick is unmounted: <informalexample><screen> <prompt>#</prompt> <userinput>cp <replaceable>debian.iso</replaceable> /dev/<replaceable>sdX</replaceable></userinput> <prompt>#</prompt> <userinput>sync</userinput> </screen></informalexample> Information about how to do this on other operating systems can be found in the <ulink url="&url-debian-cd-faq-write-usb;">Debian CD FAQ</ulink>.
de: Das CD- oder DVD-Image, das Sie ausgewählt haben, sollte direkt auf den USB-Stick geschrieben werden, wobei die vorher vorhandenen Daten überschrieben werden. Auf einem vorhandenen GNU/Linux-System kann das Image wie folgt auf den USB-Stick geschrieben werden (nachdem Sie sichergestellt haben, dass der Stick nicht im Dateisystem eingebunden ist): <informalexample><screen> <prompt>#</prompt> <userinput>cp <replaceable>debian.iso</replaceable> /dev/<replaceable>sdX</replaceable></userinput> <prompt>#</prompt> <userinput>sync</userinput> </screen></informalexample> Informationen dazu, wie Sie dies auf anderen Betriebssystemen erledigen, finden Sie in der <ulink url="&url-debian-cd-faq-write-usb;">Debian CD FAQ</ulink>.
it: È possibile scrivere l'immagine di un CD o DVD direttamente sulla chiavetta USB sovrascrivendone il contenuto attuale. Per esempio, con un sistema GNU/Linux, è possibile scrivere il file con l'immagine del CD o DVD sulla chiavetta USB eseguendo, dopo essersi assicurati che la chiavetta non è montata: <informalexample><screen> <prompt>#</prompt> <userinput>cp <replaceable>debian.iso</replaceable> /dev/<replaceable>sdX</replaceable></userinput> <prompt>#</prompt> <userinput>sync</userinput> </screen></informalexample> È possibile trovare informazioni su come fare questa operazione con altri sistemi operativi nelle <ulink url="&url-debian-cd-faq-write-usb;">FAQ di Debian CD</ulink>.
nl: Het CD- of DVD-image dat u koos, moet rechtstreeks naar de USB-stick geschreven worden. Daarbij wordt de huidige inhoud ervan overschreven. Bijvoorbeeld, als u een bestaand GNU/Linux-systeem gebruikt, kan het imagebestand van de CD of de DVD op de volgende manier naar een USB-stick geschreven worden, nadat u er zich eerst van vergewist heeft dat de stick niet aangekoppeld is: <informalexample><screen> <prompt>#</prompt> <userinput>cp <replaceable>debian.iso</replaceable> /dev/<replaceable>sdX</replaceable></userinput> <prompt>#</prompt> <userinput>sync</userinput> </screen></informalexample> Informatie over hoe dit op andere besturingssystemen moet gebeuren, is te vinden in de <ulink url="&url-debian-cd-faq-write-usb;">Debian CD FAQ</ulink>.

source: The image must be written to the whole-disk device and not a partition, e.g. /dev/sdb and not /dev/sdb1. Do not use tools like <command>unetbootin</command> which alter the image.
ca: La imatge s'ha d'escriure en un disc sencer i no en una partició, p. ex. /dev/sdb and not /dev/sdb1. No faceu servir eines del tipus <command>unetbootin</command> que modifiquen la imatge.
de: Das Image muss auf das vollständige Gerät geschrieben werden, nicht auf eine einzelne Partition, also z.B. auf /dev/sdb, nicht auf /dev/sdb1. Nutzen Sie keine Werkzeuge wie <command>unetbootin</command>, da diese das Image verändern.
it: L'immagine deve essere scritta sul device del disco e non su una partizione, cioè su /dev/sdb e non su /dev/sdb1. Non usare strumenti come <command>unetbootin</command> poiché modificano l'immagine.
nl: Het image moet geschreven worden op het volledige schijfapparaat en niet op en partitie, bijvoorbeeld /dev/sdb en niet /dev/sdb1. Gebruik geen gereedschap zoals <command>unetbootin</command> dat aan het image veranderingen aanbrengt.

source: Simply writing the CD or DVD image to USB like this should work fine for most users. The other options below are more complex, mainly for people with specialised needs.
ca: Escrivint la imatge CD o DVD en una memòria USB hauria d'ésser suficient per a la majoria d'usuaris. Les altres opcions descrites a continuació, són més complexes i van dirigides a aquelles persones amb exigències especials.
de: Einfach das CD- oder DVD-Image wie hier gezeigt auf USB zu schreiben sollte für die meisten Benutzer funktionieren. Die anderen unten erwähnten Optionen sind komplexer und hauptsächlich für Leute mit speziellen Bedürfnissen gedacht.
it: La semplice scrittura dell'immagine del CD o DVD sulla USB dovrebbe funzionare correttamente per la maggior parte degli utenti. Le altre possibilità descritte in seguito sono più complesse e particolarmente adatte a chi ha necessità particolari.
nl: Voor de meeste gebruikers zou het op deze manier eenvoudig wegschrijven van een CD- of DVD-image naar USB goed moeten werken. De hierna volgende andere mogelijkheden zijn complexer en hoofdzakelijk bedoeld voor mensen met specifieke behoeftes.

source: The hybrid image on the stick does not occupy all the storage space, so it may be worth considering using the free space to hold firmware files or packages or any other files of your choice. This could be useful if you have only one stick or just want to keep everything you need on one device.
ca: La imatge híbrida en una memòria USB no ocupa tota la capacitat disponible, de manera que pot valer la pena fer servir l'espai lliure per a fitxers de microprogramari («firmware») o paquets o altres fitxers de la vostra elecció. Vos pot ésser útil si només disposau d'una memòria USB o bé voleu fer servir la memòria per altres coses.
de: Das Hybrid-Image auf dem Stick beansprucht nicht dem vollständigen Speicherplatz, daher können Sie in Betracht ziehen, den freien Platz zu verwenden, um Firmware-Dateien oder Pakete bzw. andere Dateien Ihrer Wahl abzulegen. Dies könnte nützlich sein, wenn Sie nur einen USB-Stick haben oder einfach alles, was Sie benötigen, auf einem Datenträger zusammenhalten möchten.
it: L'immagine ibrida sulla chiavetta non occupa tutto lo spazio disponibile quindi potrebbe essere interessante usare lo spazio libero per i file con il firmware, per dei pacchetti oppure per altri file. Questo può essere utile se si dispone di una sola chiavetta USB oppure se si vuole tenere tutto ciò che serve in un solo dispositivo.
nl: Het hybride image op de stick neemt niet alle opslagruimte in beslag. Het kan dus de moeite waard zijn om in overweging te nemen om de vrije ruimte te gebruiken om er firmwarebestanden of -pakketten op te plaatsen of desgewenst andere bestanden. Dit kan nuttig zijn indien u slechts één stick heeft of alles wat u nodig heeft op één apparaat wilt houden.

source: Create a second, FAT partition on the stick, mount the partition and copy or unpack the firmware onto it. For example:
ca: Generau una segona partició FAT en la memòria USB, monteu la partició i copiau o descomprimiu el microprogramari en ella. Per exemple:
de: Sie erstellen dazu eine zweite FAT-Partition auf dem Stick, binden die Partition ein und kopieren oder entpacken die Firmware/Dateien dorthin. Zum Beispiel:
it: Creare sulla chiavetta una seconda partizione FAT, montare la partizione e copiare o spacchettare il firmware al suo interno. Per esempio:
nl: Maak een tweede FAT-partitie aan op de stick, koppel de partitie aan en kopieer of pak de firmware ernaartoe uit. Bijvoorbeeld:

source: # mount /dev/<replaceable>sdX2</replaceable> /mnt # cd /mnt # tar zxvf <replaceable>/path/to/</replaceable>firmware.tar.gz # cd / # umount /mnt
ca: # mount /dev/<replaceable>sdX2</replaceable> /mnt # cd /mnt # tar zxvf <replaceable>adreça a</replaceable>firmware.tar.gz # cd / # umount /mnt
de: # mount /dev/<replaceable>sdX2</replaceable> /mnt # cd /mnt # tar zxvf <replaceable>/pfad/zur/</replaceable>firmware.tar.gz # cd / # umount /mnt
it: # mount /dev/<replaceable>sdX2</replaceable> /mnt # cd /mnt # tar zxvf <replaceable>/percorso/di/</replaceable>firmware.tar.gz # cd / # umount /mnt
nl: # mount /dev/<replaceable>sdX2</replaceable> /mnt # cd /mnt # tar zxvf <replaceable>/pad/naar/</replaceable>firmware.tar.gz # cd / # umount /mnt

source: You might have written the <filename>mini.iso</filename> to the USB stick. In this case the second partition doesn't have to be created as, very nicely, it will already be present. Unplugging and replugging the USB stick should make the two partitions visible.
ca: És possible que el <filename>mini.iso</filename> estigui escrit en la memòria USB. En aquest cas, la segona partició no s'ha de generar atès que ja estarà present. Desconnectant i tornant a connectar la memòria USB es podrà fer visibles les dues particions.
de: Falls Sie das <filename>mini.iso</filename>-Image auf den USB-Stick kopiert haben, muss die zweite Partition nicht mehr erstellt werden, da sie praktischerweise bereits vorhanden ist. Ziehen Sie den Stick heraus und stecken Sie ihn neu ein, dann sollten zwei Partitionen sichtbar sein.
it: Se fosse stato necessario scrivere <filename>mini.iso</filename> sulla chiavetta USB, la seconda partizione non deve essere creata perché, molto probabilmente, è già presente. Scollegare e poi ricollegare la chiavetta USB per rendere visibili le due partizioni.
nl: Misschien heeft u de <filename>mini.iso</filename> naar de USB geschreven. In dat geval moet de tweede partitie niet gecreëerd worden, omdat ze al aanwezig zal zijn, wat erg handig is. De USB-stick uit de aansluiting halen en ze er terug insteken, zou de twee partities zichtbaar moeten maken.

source: Manually copying files to the USB stick
ca: Copiar manualment els fitxers en la memòria USB
de: Dateien manuell auf den USB-Stick kopieren
it: Copia manuale dei file sulla chiavetta USB
nl: Handmatig bestanden naar de USB-stick kopiëren
