Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: Some systems attempt to automatically mount a floppy disk when you place it in the drive. You might have to disable this feature before the workstation will allow you to write a floppy in <emphasis>raw mode</emphasis>. Unfortunately, how to accomplish this will vary based on your operating system. <phrase arch="sparc"> On Solaris, you can work around volume management to get raw access to the floppy. First, make sure that the floppy is auto-mounted (using <command>volcheck</command> or the equivalent command in the file manager). Then use a <command>dd</command> command of the form given above, just replace <filename>/dev/fd0</filename> with <filename>/vol/rdsk/<replaceable>floppy_name</replaceable></filename>, where <replaceable>floppy_name</replaceable> is the name the floppy disk was given when it was formatted (unnamed floppies default to the name <filename>unnamed_floppy</filename>). On other systems, ask your system administrator. </phrase>
ca: Alguns sistemes proven de muntar automàticament el disquet quan l'introduïu a la disquetera. Podríeu haver de deshabilitar aquesta funcionalitat perquè l'ordinador puga escriure el disquet <emphasis>en pla (raw mode)</emphasis>. La manera de fer això varia segons el sistema operatiu emprat. <phrase arch="sparc">En Solaris, ho podeu fer saltant-vos la gestió de volums. Primer, assegureu-vos que el disquet s'ha auto-muntat (empreu <command>volcheck</command> o l'ordre equivalent, en el gestor de fitxers). Després empreu una ordre <command>dd</command> de la forma explicada anteriorment, tot reemplaçant <filename>/dev/fd0</filename> amb <filename>/vol/rdsk/<replaceable>nom-del-disquet</replaceable></filename>, on <replaceable>nom-del-disquet</replaceable> és el nom del disquet indicat quan fou formatat (els disquets sense nom tenen per defecte el nom <filename>unnamed_floppy</filename>). En altres sistemes, demaneu-hi a l'administrador del sistema.</phrase>
de: Einige Systeme versuchen automatisch, die Diskette einzubinden, wenn sie eingelegt wird. Sie müssen diese Funktion unter Umständen deaktivieren, bevor der Rechner Ihnen erlaubt, eine Diskette im <emphasis>Roh-Modus</emphasis> zu beschreiben. Bedauerlicherweise hängt es von Ihrem Betriebssystem ab, wie Sie dies erledigen. <phrase arch="sparc"> Auf Solaris-Maschinen können Sie das Volume Management umgehen, um Roh-Zugriff auf die Diskette zu bekommen. Stellen Sie dazu zunächst sicher, dass die Diskette automatisch eingebunden wurde (benutzen Sie dafür den Befehl <command>volcheck</command> oder das entsprechende Äquivalent im Dateimanager). Führen Sie dann einen <command>dd</command>-Befehl wie oben angegeben aus; ersetzen Sie dabei <filename>/dev/fd0</filename> durch <filename>/vol/rdsk/<replaceable>diskettenname</replaceable></filename>, wobei <replaceable>diskettenname</replaceable> der Name der Diskette ist, der beim Formatieren festgelegt wurde (unbenannte Disketten haben den Standardnamen <filename>unnamed_floppy</filename>). Auf anderen Systemen fragen Sie Ihren Systemadministrator. </phrase>
it: Alcuni sistemi tentano di montare automaticamente il dischetto appena lo si inserisce nel lettore; è opportuno disattivare questa funzione in modo da poter scrivere sul dischetto in modalità <emphasis>raw</emphasis>. Sfortunatamente come fare questa operazione varia a seconda del proprio sistema operativo. <phrase arch="sparc"> Su Solaris si può aggirare la gestione del volume per avere l'accesso diretto al dischetto. Per prima cosa assicurarsi che il dischetto sia stato montato automaticamente (usando <command>volcheck</command> o il comando equivalente del file manager) poi usare il comando <command>dd</command> come in precedenza sostituendo <filename>/dev/fd0</filename> con <filename>/vol/rdsk/<replaceable>nome_dischetto</replaceable></filename>, dove <replaceable>nome_dischetto</replaceable> è il nome del dischetto scelto al momento della formattazione (i dischetti senza nome prendono come nome <filename>unnamed_floppy</filename>). Su altri sistemi chiedere al proprio amministratore. </phrase>
nl: Sommige systemen trachten een diskette automatisch aan te koppelen als u ze in het station steekt. Het kan zijn dat u deze functionaliteit moet uitschakelen vooraleer het werkstation u zal toelaten om in <emphasis>ruwe modus</emphasis> op een diskette te schrijven. Hoe u dit kunt doen, zal jammer genoeg afhangen van uw besturingssysteem. <phrase arch="sparc"> Op Solaris kunt u schijfbeheer omzeilen om ruwe toegang tot de diskette te krijgen. Vergewis er u eerst van dat de diskette automatisch aangekoppeld is (gebruik het commando <command>volcheck</command> of het equivalent ervan in bestandsbeheer). Gebruik dan het commando <command>dd</command> volgens de hierboven aangegeven vorm. U moet alleen <filename>/dev/fd0</filename> vervangen door <filename>/vol/rdsk/<replaceable>diskette_naam</replaceable></filename>, waarbij <replaceable>diskette_naam</replaceable> de naam is die aan de diskette gegeven werd bij het formatteren (diskettes waaraan geen naam gegeven werd, hebben standaard de naam <filename>unnamed_floppy</filename>). Voor andere systemen moet u het aan uw systeembeheerder vragen. </phrase>

source: If writing a floppy on powerpc Linux, you will need to eject it. The <command>eject</command> program handles this nicely; you might need to install it.
ca: Si s'escriu un disquet en un Linux «powerpc», caldrà extraure'l. El programa <command>eject</command> ho fa, això; potser l'haureu d'instal·lar.
de: Wenn Sie eine Diskette auf einem PowerPC-Linux beschreiben, müssen Sie sie danach aus dem Laufwerk auswerfen. Dies erledigt der Befehl <command>eject</command> vortrefflich; möglicherweise müssen Sie Ihn erst installieren.
it: Per scrivere un dischetto da Linux/powerpc è necessario prima espellerlo. Il programma <command>eject</command> gestisce questa funzione in modo corretto; è consigliabile installarlo.
nl: Indien u een diskette schrijft op een powerpc Linux, zult u ze moeten uitwerpen. Het programma <command>eject</command> handelt dit goed af. Misschien zult u het moeten installeren.

source: Writing Disk Images From DOS, Windows, or OS/2
ca: Escriure imatges de disquet des de DOS, Windows o OS/2
de: Disk-Images schreiben unter DOS, Windows oder OS/2
it: Scrittura delle immagini dei dischi da DOS, Windows o OS/2
nl: Schijf-images schrijven met DOS, Windows of OS/2

source: If you have access to an i386 or amd64 machine, you can use one of the following programs to copy images to floppies.
ca: Si teniu accés a una màquina i386 o amd64, podeu usar un dels següents programes per a copiar imatges a disquets.
de: Wenn Sie Zugang zu einem i386- oder amd64-Rechner haben, können Sie eines der folgenden Programme benutzen, um Images auf die Disketten zu schreiben:
it: Se si ha accesso a una macchina i386 o amd64 si può usare uno dei seguenti programmi per copiare le immagini sui dischetti.
nl: Indien u toegang heeft tot een i386- of een amd64-computer, kunt u een van de volgende programma's gebruiken om images naar diskettes te kopiëren.

source: The <command>rawrite1</command> and <command>rawrite2</command> programs can be used under MS-DOS. To use these programs, first make sure that you are booted into DOS. Trying to use these programs from within a DOS box in Windows, or double-clicking on these programs from the Windows Explorer is <emphasis>not</emphasis> expected to work.
ca: Els programes <command>rawrite1</command> i <command>rawrite2</command> es poden usar a MS-DOS. Per usar aquests programes, primer assegureu-vos que esteu arrencant DOS. Intentar usar aquests programes des de dins d'una finestra DOS a Windows o clicant dues vegades sobre aquests programes des de Windows Explorer <emphasis>no</emphasis> s'espera que funcioni.
de: Die Programme <command>rawrite1</command> und <command>rawrite2</command> können unter MS-DOS genutzt werden. Um sie zu verwenden, stellen Sie zunächst sicher, dass Sie DOS gebootet haben. Zu versuchen, diese Programme in einer DOS-Box unter Windows zu nutzen oder sie im Windows-Explorer per Doppelklick zu starten, wird wahrscheinlich <emphasis>nicht</emphasis> funktionieren.
it: Su MS-DOS si possono usare i programmi <command>rawrite1</command> e <command>rawrite2</command>. Prima di usarli assicurarsi di aver avviato DOS. Provando a usare questi programmi dall'interno di una finestra DOS su Windows o facendo doppio clic su questi programmi da Windows Explorer <emphasis>non</emphasis> aspettarsi che funzionino.
nl: De programma's <command>rawrite1</command> en <command>rawrite2</command> kunnen onder MS-DOS gebruikt worden. Om deze programma's te gebruiken moet u er zich eerst van vergewissen dat u onder DOS opgestart bent. Als u deze programma's tracht te gebruiken vanuit een DOS-venster in Windows of door op deze programma's te dubbelklikken in de Windows verkenner, moet u <emphasis>niet</emphasis> verwachten dat dit zal werken.

source: The <command>rwwrtwin</command> program runs on Windows 95, NT, 98, 2000, ME, XP and probably later versions. To use it you will need to unpack diskio.dll in the same directory.
ca: El programa <command>rwwrtwin</command> funciona a Windows 95, NT, 98, 2000, ME, XP i probablement versions posteriors. Per usar-lo necessitareu desempaquetar diskio.dll en el mateix directori.
de: Das Programm <command>rwwrtwin</command> läuft unter Windows 95, NT, 98, 2000, ME, XP und vielleicht auch unter späteren Versionen. Um es zu nutzen, müssen Sie die Datei diskio.dll in das gleiche Verzeichnis entpacken.
it: Il programma <command>rwwrtwin</command> funziona su Windows 95, NT, 98, 2000, ME, XP e probabilmente anche sulle versioni successive. Per usarlo è necessario scompattare diskio.dll nella stessa directory.
nl: Het programma <command>rwwrtwin</command> werkt onder Windows 95, NT, 98, 2000, ME, XP en wellicht recentere versies. Om het te gebruiken zult u diskio.dll in dezelfde map moeten uitpakken.

source: These tools can be found on the Official &debian; CD-ROMs under the <filename>/tools</filename> directory.
ca: Aquestes eines es poden trobar als CD-ROM oficials de &debian; dins del directori <filename>/tools</filename>.
de: Sie finden diese Werkzeuge auf der offiziellen &debian;-CD-ROM im Verzeichnis <filename>/tools</filename>.
it: Questi programmi possono essere trovati sui CD-ROM ufficiali &debian; nella directory <filename>/tools</filename>.
nl: Deze gereedschappen kunt u vinden op de officiële &debian; CD's onder de map <filename>/tools</filename>.

source: Writing Disk Images From MacOS
ca: Gravar imatges de disc des de MacOS
de: Disk-Images schreiben unter MacOS
it: Scrittura delle immagini dei dischi da MacOS
nl: Schijf-images schrijven met MacOS

source: An AppleScript, <application>Make &debian; Floppy</application>, is available for burning floppies from the provided disk image files. It can be downloaded from <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. To use it, just unstuff it on your desktop, and then drag any floppy image file to it. You must have Applescript installed and enabled in your extensions manager. Disk Copy will ask you to confirm that you wish to erase the floppy and proceed to write the file image to it.
ca: Hi ha una seqüència d'Apple <application>Make &debian; Floppy</application> per gravar disquets des dels fitxers d'imatge de disc. Es pot descarregar des de <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. Utilitzeu-lo, i descomprimiu-lo al vostre escriptori, i aleshores arrossegueu qualsevol fitxer d'imatge dels disquets al disquet. Heu de tenir la seqüència d'Apple instal·lada i activada al vostre gestor d'extensions. Al fer «Disk Copy» us demanarà que confirmeu que voleu esborrar el disquet i continuar gravant el fitxer de la imatge.
de: Es gibt ein Applescript (<application>Make Debian Floppy</application>), um die vorhandenen Disk-Image-Dateien auf Diskette zu schreiben. Es kann von <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink> heruntergeladen werden. Um es zu verwenden, legen Sie es auf dem Desktop ab; dann können Sie einfach die Image-Datei mit der Maus anfassen und darauf fallen lassen. Sie müssen Applescript installiert und im Extensions-Manager aktiviert haben. Sie werden von Disk Copy auffordert, zu bestätigen, dass die Diskette gelöscht und die Image-Datei darauf geschrieben werden soll.
it: È disponibile un AppleScript, <application>Make &debian; Floppy</application>, per creare i dischetti dai file immagine forniti. Può essere scaricato da <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. Per usarlo è sufficiente copiarlo sul desktop e poi trascinarci sopra ciascun file immagine. È necessario che AppleScript sia installato e attivato dal gestore delle estensioni. Disk Copy chiede conferma prima di cancellare il dischetto e di procedere alla scrittura del file immagine.
nl: Er bestaat een AppleScript, <application>Make &debian; Floppy</application>, om diskettes te branden met de ter beschikking gestelde schijf-imagebestanden. Het kan gedownload worden van <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. Om het te gebruiken moet u het uitladen (unstuff) op uw bureaublad. Daarna moet u er een diskette-imagebestand naartoe slepen. Applescript moet geïnstalleerd zijn en in de extension manager, het uitbreidingenbeheer, geactiveerd zijn. De toepassing Disk Copy zal u vragen om te bevestigen dat u de diskette wilt wissen en het imagebestand er naartoe schrijven.

source: You can also use the MacOS utility <command>Disk Copy</command> directly, or the freeware utility <command>suntar</command>. The <filename>root.bin</filename> file is an example of a floppy image. Use one of the following methods to create a floppy from the floppy image with these utilities.
ca: Podeu utilitzar la utilitat de MacOS <command>Disk Copy</command> directament, o la utilitat gratuïta <command>suntar</command>. El fitxer <filename>root.bin</filename> és un exemple d'imatge per disquets. Utilitzeu aquestes utilitats amb un dels dos mètodes següents per crear un disquet des de la imatge del disquet.
de: Sie können auch das MacOS-Werkzeug <command>Disk Copy</command> direkt nutzen oder das Freeware-Programm <command>suntar</command>. Die Datei <filename>root.bin</filename> ist ein Beispiel für ein Disketten-Image. Verwenden Sie eine der folgenden Methoden, um die Diskette zu beschreiben:
it: Si può anche usare direttamente il programma per MacOS <command>Disk Copy</command> oppure il programma freeware <command>suntar</command>. Per esempio, <filename>root.bin</filename> è un file immagine. Usare uno dei seguenti metodi per creare un dischetto dal file immagine con questi programmi.
nl: U kunt ook rechtstreeks het hulpprogramma <command>Disk Copy</command> van MacOS gebruiken of het freewareprogramma <command>suntar</command>. Het bestand <filename>root.bin</filename> is een voorbeeld van een diskette-image. Gebruik een van de volgende methodes om een diskette te maken van het diskette-image met deze hulpprogramma's.

source: Writing Disk Images with <command>Disk Copy</command>
ca: Gravar imatges de disc amb <command>Disk Copy</command>
de: Disk-Images schreiben mit <command>Disk Copy</command>
it: Scrivere le immagini dei dischi con <command>Disk Copy</command>
nl: Schijf-images schrijven met <command>Disk Copy</command>

source: If you are creating the floppy image from files which were originally on the official &debian-gnu; CD, then the Type and Creator are already set correctly. The following <command>Creator-Changer</command> steps are only necessary if you downloaded the image files from a &debian; mirror.
ca: Si esteu preparant la imatge del disquet des dels fitxers que estan originalment al CD de &debian-gnu;, aleshores el «Type and Creator» estan configurats correctament. Els passos següents de <command>Creator-Changer</command> són tan sols necessaris si descarregueu els fitxers d'imatge des d'un rèplica de &debian;.
de: Wenn Sie die Diskette mit Original-Dateien von der offiziellen &debian-gnu;-CD beschreiben, sind Typ und Ersteller der Dateien bereits passend eingestellt. Die folgenden Schritte zum Ändern des Erstellers mit <command>Creator-Changer</command> sind nur nötig, wenn Sie die Image-Dateien von einem &debian;-Spiegel-Server heruntergeladen haben.
it: Se si stanno creando i dischetti dai file immagine che sono sul CD &debian-gnu; ufficiale allora <quote>Type</quote> e <quote>Creator</quote> sono già impostati correttamente. I prossimi passaggi con <command>Creator-Changer</command> sono necessari solo se si sono scaricati i file immagine da uno dei mirror &debian;.
nl: Indien u de diskette-image maakt van bestanden die zich oorspronkelijk op de officiële &debian-gnu; CD bevonden, dan zijn Type en Creator reeds correct ingesteld. De volgende stappen met <command>Creator-Changer</command> zijn enkel nodig als u de imagebestanden downloadde van een &debian; spiegelserver.

source: Obtain <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> and use it to open the <filename>root.bin</filename> file.
ca: Descarregueu <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> i utilitzeu-lo per obrir el fitxer <filename>root.bin</filename>.
de: Besorgen Sie sich <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> und öffnen Sie damit die Datei <filename>root.bin</filename>.
it: Procurarsi <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> e usarlo per aprire il file <filename>root.bin</filename>.
nl: Download <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> en open er het bestand <filename>root.bin</filename> mee.

source: Change the Creator to <userinput>ddsk</userinput> (Disk Copy), and the Type to <userinput>DDim</userinput> (binary floppy image). The case is sensitive for these fields.
ca: Canvieu el «Creator» a <userinput>ddsk</userinput> («Disk Copy»), i el «Type» a <userinput>DDim</userinput> (imatge binària del disquet). Aneu amb compte ja que en aquests camps es distingeix entre majúscules i minúscules.
de: Ändern Sie den Ersteller auf <userinput>ddsk</userinput> (Disk Copy) und den Typ auf <userinput>DDim</userinput> (Binary-Floppy-Image). Achten Sie hierbei auf Groß-/Kleinschreibung.
it: Modificare <quote>Creator</quote> con <userinput>ddsk</userinput> (Disk Copy) e <quote>Type</quote> con <userinput>DDim</userinput> (immagine di dischetto binaria). Questi campi considerano come differenti i caratteri in maiuscolo da quelli in minuscolo.
nl: Verander de waarde van Creator naar <userinput>ddsk</userinput> (Disk Copy) en die van Type naar <userinput>DDim</userinput> (binair diskette-image). De waarde van deze velden is hoofdlettergevoelig.

source: <emphasis>Important:</emphasis> In the Finder, use <userinput>Get Info</userinput> to display the Finder information about the floppy image, and <quote>X</quote> the <userinput>File Locked</userinput> check box so that MacOS will be unable to remove the boot blocks if the image is accidentally mounted.
ca: <emphasis>Important:</emphasis> Al «Finder», utilitzeu <userinput>Get Info</userinput> per mostrar la informació del «Finder» per a la imatge del disquet, i poseu <quote>X</quote> al quadre de verificació <userinput>File Locked</userinput> per que el MacOS pugui esborrar els blocs d'arrencada si la imatge es munta accidentalment.
de: <emphasis>Wichtig:</emphasis> Nutzen Sie <userinput>Get Info</userinput> im Finder, um die Finder-Dateiinformationen über das Disketten-Image anzuzeigen, und aktivieren Sie die <userinput>File Locked</userinput>-Checkbox, so dass MacOS die Boot-Blocks nicht entfernen kann, wenn das Image versehentlich ins Dateisystem eingebunden wird.
it: <emphasis>Importante:</emphasis> Nel Finder usare <userinput>Get Info</userinput> per visualizzare le informazioni Finder sull'immagine del dischetto e spuntare la casella <userinput>File Locked</userinput> in modo da impedire a MacOS di rimuovere i blocchi di avvio nel caso che l'immagine venga accidentalmente montata.
nl: <emphasis>Belangrijk:</emphasis> gebruik in de Finder (bestandsbeheer) <userinput>Get Info</userinput> (Info tonen) om de informatie van de Finder over het diskette-image te zien en plaats een <quote>X</quote> in het keuzevakje bij <userinput>File Locked</userinput> (Bestand vergrendeld), zodat MacOS niet in staat is om de opstartblokken te verwijderen als het image per ongeluk aangekoppeld wordt.

source: Obtain <command>Disk Copy</command>; if you have a MacOS system or CD it will very likely be there already, otherwise try <ulink url="&url-powerpc-diskcopy;"></ulink>.
ca: Descarregueu <command>Disk Copy</command>; si teniu un sistema MacOS o CD serà molt probable que el tingueu ja; en altre cas, proveu <ulink url="&url-powerpc-diskcopy;"></ulink>.
de: Besorgen Sie sich das Programm <command>Disk Copy</command>; wenn Sie ein MacOS-System oder eine solche CD besitzen, haben Sie <command>Disk Copy</command> wahrscheinlich schon; ansonsten versuchen Sie es auf <ulink url="&url-powerpc-diskcopy;"></ulink>.
it: Procurarsi <command>Disk Copy</command>; se si dispone di un sistema MacOS o del CD molto probabilmente è già presente, altrimenti si veda <ulink url="&url-powerpc-diskcopy;"></ulink>.
nl: Download <command>Disk Copy</command>. Indien u een MacOS-systeem of een MacOS-CD heeft, zult u het wellicht daarop al aantreffen. Anders kunt het ophalen van <ulink url="&url-powerpc-diskcopy;"></ulink>.

source: Run <command>Disk Copy</command>, and select <menuchoice> <guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>, then select the <emphasis>locked</emphasis> image file from the resulting dialog. It will ask you to insert a floppy, then ask if you really want to erase it. When done it should eject the floppy.
ca: Executeu <command>Disk Copy</command>, i seleccioneu <menuchoice> <guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>, i aleshores seleccioneu la imatge de l'arxiu <emphasis>blocat</emphasis> al diàleg resultant. Us demanarà que inseriu un disquet, i si voleu realment esborrar-lo. Quan estigui acabat, expulsarà el disquet.
de: Starten Sie <command>Disk Copy</command> und dann <menuchoice><guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>; wählen Sie im folgenden Dialog die <emphasis>schreibgeschützte</emphasis> Image-Datei. Sie werden aufgefordert, eine Diskette einzulegen und nochmals gefragt, ob Sie diese wirklich löschen wollen. Wenn alles erledigt ist, wird die Diskette ausgeworfen.
it: Lanciare <command>Disk Copy</command> e scegliere <menuchoice> <guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>, poi selezionare il file immagine <emphasis>bloccato</emphasis> nella successiva finestra di dialogo. Prima verrà chiesto di inserire un dischetto e poi se si vuole davvero cancellarlo. Quando ha finito dovrebbe far uscire il dischetto.
nl: Start het programma <command>Disk Copy</command> en selecteer <menuchoice> <guimenu>Utilities (Hulpprogramma's)</guimenu> <guimenuitem>Make a Floppy (Een diskette maken)</guimenuitem> </menuchoice> en selecteer in het dialoogvenster het <emphasis>vergrendelde</emphasis> imagebestand. Het programma zal u vragen om een diskette in het station te steken en u dan vragen of u ze echt wilt wissen. De diskette wordt uitgeworpen als het programma klaar is.
