Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: Mount the partition (<userinput>mount /dev/<replaceable>sdX1</replaceable> /mnt</userinput>) and copy the following installer image files to the stick: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> or <filename>linux</filename> (kernel binary) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (initial ramdisk image) </para></listitem> </itemizedlist> You can choose between either the text-based or the graphical version of the installer. The latter can be found in the <filename>gtk</filename> subdirectory. If you want to rename the files, please note that <classname>syslinux</classname> can only process DOS (8.3) file names.
ca: Munteu la partició (<userinput>mount /dev/<replaceable>sdX1</replaceable> /mnt</userinput>) i copieu els següents fitxers de la imatge de l'instal·lador al llapis: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> o <filename>linux</filename> (imatge del nucli) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (imatge inicial del disc RAM) </para></listitem> </itemizedlist> Podeu escollir entre la versió normal de l'instal·lador o la seua versió gràfica. Podeu trobar la darrera al subdirectori <filename>gtk</filename>. Si voleu reanomenar els fitxers, tingueu en compte que <classname>syslinux</classname> només pot processar noms de fitxer de DOS (8.3).
de: Binden Sie die Partition ins Dateisystem ein (<userinput>mount /dev/sdX1 /mnt</userinput>) und kopieren Sie die folgenden Installer-Image-Dateien auf den Stick: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> oder <filename>linux</filename> (Kernel-Binär-Datei) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (Initial-RAM-Disk-Image) </para></listitem> </itemizedlist> Sie können wählen zwischen dem textbasierten und dem grafischen Installer. Letzteren finden Sie im <filename>gtk</filename>-Unterverzeichnis. Wenn Sie die Dateien umbenennen möchten, beachten Sie, dass <classname>syslinux</classname> nur Dateinamen im DOS-(8.3)Format verarbeiten kann.
it: Montare la partizione (<userinput>mount /dev/<replaceable>sdX1</replaceable> /mnt</userinput>) e copiare i seguenti file con l'immagine dell'installatore sulla chiavetta: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> o <filename>linux</filename> (kernel) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (immagine del ramdisk iniziale) </para></listitem> </itemizedlist> È possibile sceglie se usare la versione dell'installatore testuale o quella grafica. Quest'ultima può essere trovata nella sottodirectory <filename>gtk</filename>. Se si vuole rinominare questi file ricordarsi che <command>syslinux</command> può gestire solo nomi di file in formato DOS (8.3).
nl: Koppel de partitie aan (<userinput>mount /dev/<replaceable>sdX1</replaceable> /mnt</userinput>) en kopieer de volgende imagebestanden van het installatiesysteem naar de stick: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> of <filename>linux</filename> (het binaire kernelbestand) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (het initiële ramschijf-image) </para></listitem> </itemizedlist> U kunt ofwel de tekstuele of de grafische versie van het installatiesysteem kiezen. Die laatste vindt u in de onderliggende map <filename>gtk</filename>. Indien u de bestanden wenst te hernoemen, moet u er rekening mee houden dat <classname>syslinux</classname> enkel met bestandsnamen van het type DOS (8.3) kan werken.

source: Next you should create a <filename>syslinux.cfg</filename> configuration file, which at a bare minimum should contain the following line (change the name of the kernel binary to <quote><filename>linux</filename></quote> if you used a <filename>netboot</filename> image): <informalexample><screen> default vmlinuz initrd=initrd.gz </screen></informalexample> For the graphical installer you should add <userinput>vga=788</userinput> to the line. Other parameters can be appended as desired.
ca: A continuació heu de generar un fitxer de configuració <filename>syslinux.cfg</filename> que haurà de contenir com a mínim les dues línies següents (canvieu-hi el nom del nucli binari a <quote><filename>linux</filename></quote> si heu emprat una imatge <filename>netboot</filename>): <informalexample><screen> default vmlinuz initrd=initrd.gz </screen></informalexample> Per a emprar l'instal·lador gràfic heu d'afegir <userinput>vga=788</userinput> a la segona línia. Es poden afegir altres paràmetres si ho desitjau.
de: Als nächstes sollten Sie eine Konfigurationsdatei <filename>syslinux.cfg</filename> erstellen, die mindestens die folgende Zeile enthält: <informalexample><screen> default vmlinuz initrd=initrd.gz </screen></informalexample> (Verwenden Sie als Name für die Kernel-Binärdatei <quote><filename>linux</filename></quote>, wenn Sie ein <filename>netboot</filename>-Image benutzt haben.) Falls Sie den grafischen Installer verwenden möchten, sollten Sie der Zeile <userinput>vga=788</userinput> hinzufügen. Auf Wunsch können weitere Parameter angegeben werden.
it: Poi è necessario creare il file di configurazione <filename>syslinux.cfg</filename>, deve contenere almeno la riga seguente (modificare il nome del kernel in <quote><filename>linux</filename></quote> se si usa l'immagine <filename>netboot</filename>): <informalexample><screen> default vmlinuz initrd=initrd.gz </screen></informalexample> Per utilizzare l'installatore grafico è necessario aggiungere <userinput>vga=788</userinput> alla riga; è possibile aggiungere anche altri parametri.
nl: Daarna moet u een configuratiebestand <filename>syslinux.cfg</filename> aanmaken. Dit moet als absolute minimum de volgende regel bevatten (verander de naam van het binaire bestand van de kernel in <quote><filename>linux</filename></quote> als u een <filename>netboot</filename>-image gebruikte): <informalexample><screen> default vmlinuz initrd=initrd.gz </screen></informalexample> Voor het grafische installatiesysteem moet u <userinput>vga=788</userinput> aan de regel toevoegen. Andere parameters kunnen desgewenst toegevoegd worden.

source: To enable the boot prompt to permit further parameter appending, add a <userinput>prompt 1</userinput> line.
ca: Per habilitat l'indicador d'arrencada per a permetre afegir paràmetres addicionals, afegiu la línia <userinput>prompt 1</userinput>.
de: Um den Boot-Prompt zu aktivieren und so weitere Anpassungen der Parameter zuzulassen, fügen Sie eine Zeile mit dem Inhalt <userinput>prompt 1</userinput> hinzu.
it: Per attivare il prompt di avvio e permettere l'inserimento di altri parametri aggiungere una riga con <userinput>prompt 1</userinput>.
nl: Om van de opstartprompt gebruik te kunnen maken om nog andere parameters toe te voegen, voegt u een regel <userinput>prompt 1</userinput> toe.

source: If you used an <filename>hd-media</filename> image, you should now copy the ISO file of a &debian; ISO image<footnote> <para> You can use either a netinst or a full CD image (see <xref linkend="official-cdrom"/>). Be sure to select one that fits. Note that the <quote>netboot <filename>mini.iso</filename></quote> image is not usable for this purpose. </para> </footnote> onto the stick. When you are done, unmount the USB memory stick (<userinput>umount /mnt</userinput>).
ca: Si heu emprat una imatge <filename>hd-media</filename>, ara heu de copiar una imatge ISO de &debian;<footnote> <para> Podeu emprar una imatge «netinst» o una de CD complet (vegeu <xref linkend="official-cdrom"/>). Assegureu-vos d'emprar-ne una que hi càpiga. Adoneu-vos que la imatge <quote>netboot <filename>mini.iso</filename></quote> no és vàlida per a aquest propòsit.</para> </footnote> al llapis. Quan hàgeu acabat, desmunteu el llapis de memòria USB (<userinput>umount /mnt</userinput>).
de: Wenn Sie ein <filename>hd-media</filename>-Image benutzt haben, sollten Sie jetzt noch die ISO-Datei eines &debian;-ISO-Images<footnote> <para> Sie können dafür ein Netinst- oder ein Komplett-CD-Image verwenden (siehe <xref linkend="official-cdrom"/>). Stellen Sie sicher, dass das Image Ihrer Wahl auf den Stick passt. Beachten Sie, dass das <quote>netboot <filename>mini.iso</filename></quote>-Image für diesen Zweck nicht geeignet ist. </para> </footnote> auf den Stick kopieren. Danach lösen Sie die Einbindung der Partition wieder (<userinput>umount /mnt</userinput>).
it: Se si è utilizzato un'immagine <filename>hd-media</filename>, adesso si deve copiare il file di un'immagine ISO &debian;<footnote> <para> È possibile usare una qualsiasi tra le immagini netinst o di un CD completo (vedere <xref linkend="official-cdrom"/>). Assicurarsi di sceglierne una che entra nella chiavetta. Notare che l'immagine <quote>netboot <filename>mini.iso</filename></quote> non può essere usata per questo scopo. </para> </footnote> sulla chiavetta. Una volta finita la copia, smontare la chiavetta USB (<userinput>umount /mnt</userinput>).
nl: Indien u een <filename>hd-media</filename>-image gebruikte, moet u nu het ISO-bestand van een &debian; ISO-image kopiëren<footnote> <para>U kunt ofwel een netinst- of een volledige CD-image gebruiken (zie <xref linkend="official-cdrom"/>). Zorg ervoor er een te selecteren dat er op past. Merk op dat u het <quote>netboot <filename>mini.iso</filename></quote>-image hiervoor niet kunt gebruiken. </para> </footnote> naar de stick. Koppel de USB geheugenstick af wanneer u klaar bent (<userinput>umount /mnt</userinput>).

source: Most USB sticks do not come pre-configured in such a way that Open Firmware can boot from them, so you will need to repartition the stick. On Mac systems, run <userinput>mac-fdisk /dev/<replaceable>sdX</replaceable></userinput>, initialise a new partition map using the <userinput>i</userinput> command, and create a new partition of type Apple_Bootstrap using the <userinput>C</userinput> command. (Note that the first "partition" will always be the partition map itself.) Then type <informalexample><screen> $ hformat /dev/<replaceable>sdX2</replaceable> </screen></informalexample> Take care that you use the correct device name for your USB stick. The <command>hformat</command> command is contained in the <classname>hfsutils</classname> &debian; package.
ca: La major part dels llapis USB no venen preconfigurats de manera que «Open Firmware» pugui arrencar des d'ells, per això caldrà refer les particions. En els sistemes Mac, utilitzeu el <userinput>mac-fdisk /dev/<replaceable>sdX</replaceable></userinput>, inicialitzau una nova partició fent servir l'ordre <userinput>i</userinput> i generau una nova partició de tipus «Apple_Bootstrap» fent servir l'ordre <userinput>C</userinput>. (Recordau que la primera partició sempre serà la taula de particions). A continuació escriviu <informalexample><screen> $ hformat /dev/<replaceable>sdX2</replaceable> </screen></informalexample> Posau atenció que feu servir el nom de dispositiu correcte per la vostra memòria USB. L'ordre <command>hformat</command> està al paquet &debian; <classname>hfsutils</classname>
de: Die meisten USB-Sticks sind nicht derart vorkonfiguriert, dass OpenFirmware davon booten kann, so dass Sie den Stick neu partitionieren müssen. Auf Mac-Systemen führen Sie <userinput>mac-fdisk /dev/<replaceable>sdX</replaceable></userinput> aus, erzeugen mit dem Befehl <userinput>i</userinput> eine neue Partitionstabelle und dann eine neue Partition des Typs Apple_Bootstrap (mit dem Befehl <userinput>C</userinput>). Bedenken Sie, dass die erste <quote>Partition</quote> immer die Partitionstabelle selbst ist. Geben Sie dann ein: <informalexample><screen> $ hformat /dev/<replaceable>sdX2</replaceable> </screen></informalexample> Sorgen Sie dafür, dass Sie den richtigen Gerätenamen des USB-Sticks verwenden. Der Befehl <command>hformat</command> ist im &debian;-Paket <classname>hfsutils</classname> enthalten.
it: La maggior parte delle chiavette USB viene venduta con una configurazione da cui Open Firmware non può avviare la macchina, quindi è necessario ripartizionare la chiavetta. Sui sistemi Mac, usando <userinput>mac-fdisk /dev/<replaceable>sdX</replaceable></userinput>, si deve inizializzare una nuova mappa delle partizioni usando il comando <userinput>i</userinput> e poi creare una nuova partizione di tipo Apple_Bootstrap con il comando <userinput>C</userinput> (notare che la prima partizione è la mappa delle partizioni stessa). Poi eseguire <informalexample><screen> $ hformat /dev/<replaceable>sdX2</replaceable> </screen></informalexample> Fare attenzione a usare il nome di device della chiavetta USB. Il comando <command>hformat</command> è contenuto nel pacchetto &debian; <classname>hfsutils</classname>.
nl: De meeste USB-sticks zijn vooraf niet op zo'n manier geconfigureerd dat Open Firmware er van kan opstarten. U zult dus de stick opnieuw moeten indelen. Op Mac-systemen moet u het commando <userinput>mac-fdisk /dev/<replaceable>sdX</replaceable></userinput> gebruiken, een nieuwe 'partition map' (partitiekaart) initialiseren met het commando <userinput>i</userinput> en een nieuwe partitie van het type Apple_Bootstrap aanmaken met het commando <userinput>C</userinput>. (Merk op dat de eerste "partitie" altijd de partitiekaart zelf zal zijn.) Typ dan <informalexample><screen> $ hformat /dev/<replaceable>sdX2</replaceable> </screen></informalexample> Let er goed op om de juiste apparaatnaam te gebruiken voor uw USB-stick. Het commando <command>hformat</command> vindt u in het &debian; pakket <classname>hfsutils</classname>.

source: In order to start the kernel after booting from the USB stick, we will put a boot loader on the stick. The <command>yaboot</command> boot loader can be installed on an HFS filesystem and can be reconfigured by just editing a text file. Any operating system which supports the HFS file system can be used to make changes to the configuration of the boot loader.
ca: Per iniciar el nucli després d'arrencar des del dispositiu USB, afegirem un carregador d'arrencada al dispositiu. El carregador d'arrencada <command>yaboot</command> es pot instal·lar al sistema de fitxers HFS i es pot reconfigurar editant tan sols un fitxer de text. Qualsevol sistema operatiu que suporte el sistema de fitxer HFS es pot utilitzar per fer els canvis a la configuració del carregador d'arrencada.
de: Um den Kernel zu starten, nachdem wir vom USB-Stick gebootet haben, werden wir einen Bootloader auf dem Stick ablegen. Der Bootloader <command>yaboot</command> kann auf einem HFS-Dateisystem installiert werden und wird über eine Textdatei konfiguriert. Jedes Betriebssystem, das das HFS-Dateisystem unterstützt, kann verwendet werden, um die Konfiguration des Bootloaders zu verändern.
it: Per far partire il kernel dopo aver fatto l'avvio da una chiavetta USB è necessario mettere un bootloader sulla chiavetta. Su un filesystem HFS è possibile installare il bootloader <command>yaboot</command> che può essere riconfigurato con la semplice modifica di un file di testo. Qualsiasi sistema operativo con supporto per il filesystem HFS può essere usato per fare delle modifiche alla configurazione del bootloader.
nl: Om na het opstarten vanaf de USB-stick de kernel te starten, zullen we een opstartlader op de stick plaatsen. De opstartlader <command>yaboot</command> kan op een HFS-bestandssysteem geïnstalleerd worden en kan geconfigureerd worden door gewoon een tekstbestand te bewerken. Elk besturingssysteem met ondersteuning voor het HFS-bestandssysteem kan gebruikt worden om de configuratie van de opstartlader aan te passen.

source: The normal <command>ybin</command> tool that comes with <command>yaboot</command> does not yet understand USB storage devices, so you will have to install <command>yaboot</command> by hand using the <classname>hfsutils</classname> tools. Type <informalexample><screen> $ hmount /dev/<replaceable>sdX2</replaceable> $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Again, take care that you use the correct device name. The partition must not be otherwise mounted during this procedure. This procedure writes the boot loader to the partition, and uses the HFS utilities to mark it in such a way that Open Firmware will boot it. Having done this, the rest of the USB stick may be prepared using the normal Unix utilities.
ca: L'eina normal <command>ybin</command> que ve amb <command>yaboot</command> no pot utilitzar dispositius d'emmagatzemament USB, així que haureu d'instal·lar <command>yaboot</command> manualment utilitzant les eines de <classname>hfsutils</classname>. Escriviu <informalexample><screen> $ hmount /dev/<replaceable>sdX2</replaceable> $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Altra vegada, aneu amb compte d'utilitzar el nom de dispositiu correcte. La partició no s'hauria de muntar en aquest procediment. Aquest procediment escriu el carregador d'arrencada a la partició, i fa ús de les utilitats HFS per marcar-la de manera que l'Open Firmware la pugui arrencar. Fent açò, la resta del dispositiu USB es podria preparar per fer ús de les utilitats Unix normals.
de: Das normale <command>ybin</command>-Werkzeug, das bei <command>yaboot</command> dabei ist, unterstützt USB-Speicher-Geräte nicht, deshalb müssen wir <command>yaboot</command> von Hand mit den <classname>hfsutils</classname>-Programmen installieren. Geben Sie ein: <informalexample><screen> $ hmount /dev/<replaceable>sdX2</replaceable> $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Hier nochmals die Warnung, den richtigen Gerätenamen zu verwenden. Die Partition darf für diese Prozedur nicht anderweitig ins Dateisystem eingebunden sein. Es wird hierbei der Bootloader auf die Partition geschrieben und mittels der HFS-Programme passend gekennzeichnet, so dass OpenFirmware ihn startet. Nachdem dies erledigt ist, sollten die restliche Vorbereitungen am USB-Stick mit den normalen Unix-Programmen vorgenommen werden.
it: La normale versione del programma <command>ybin</command> contiene una versione di <command>yaboot</command> che non riconosce i dispositivi di memorizzazione USB, quindi è necessario installare manualmente <command>yaboot</command> usando le <classname>hfsutils</classname>. Eseguire <informalexample><screen> $ hmount /dev/<replaceable>sdX2</replaceable> $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Di nuovo fare attenzione a usare il nome corretto del device. La partizione non deve essere montata durante questa procedura dato che scrive il bootloader sulla partizione e usa le utilità per HFS per effettuare le impostazioni necessarie per l'avvio da Open Firmware. Finita questa fase, il resto della preparazione della chiavetta USB può essere completata usando le comuni utilità Unix.
nl: Het normale gereedschap <command>ybin</command> dat bij <command>yaboot</command> zit, kan nog niet overweg met USB-opslagapparaten. U zult <command>yaboot</command> dus handmatig moeten installeren met de <classname>hfsutils</classname> gereedschappen. Typ <informalexample><screen> $ hmount /dev/<replaceable>sdX2</replaceable> $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Nogmaals, zorg ervoor om de juiste apparaatnaam te gebruiken. Tijdens deze procedure moet de partitie overigens niet aangekoppeld zijn. Deze procedure schrijft de opstartlader naar de partitie en gebruikt de HFS-hulpprogramma's om ze zodanig te markeren dat Open Firmware ze kan opstarten. Nadat dit afgewerkt is, kunt u de rest van de voorbereiding van de USB-stick uitvoeren met behulp van de normale Unix-hulpprogramma's.

source: Mount the partition (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>) and copy the following installer image files to the stick:
ca: Munteu la partició (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>) i copieu els fitxers de l'instal·lador següents al llapis USB:
de: Hängen Sie die Partition ins Dateisystem ein (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>) und kopieren Sie die folgenden Installer-Image-Dateien auf den Stick:
it: Montare la partizione (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>) e copiare i seguenti file dall'archivio Debian sulla chiavetta:
nl: Koppel de partitie aan (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>) en kopieer de volgende image-bestanden van het installatiesysteem naar de stick:

source: <filename>vmlinux</filename> (kernel binary)
ca: <filename>vmlinux</filename> (binari del nucli)
de: <filename>vmlinux</filename> (Kernel-Binär-Datei)
it: <filename>vmlinux</filename> (kernel)
nl: <filename>vmlinux</filename> (binair kernel-bestand)

source: <filename>initrd.gz</filename> (initial ramdisk image)
ca: <filename>initrd.gz</filename> (imatge inicial del disc RAM)
it: <filename>initrd.gz</filename> (immagine del ramdisk iniziale)
nl: <filename>initrd.gz</filename> (initieel ramschijf-image)

source: <filename>yaboot.conf</filename> (yaboot configuration file)
ca: <filename>yaboot.conf</filename> (fitxer de configuració del yaboot)
de: <filename>yaboot.conf</filename> (Yaboot-Konfigurationsdatei)
it: <filename>yaboot.conf</filename> (file di configurazione di yaboot)
nl: <filename>yaboot.conf</filename> (configuratiebestand voor yaboot)

source: <filename>boot.msg</filename> (optional boot message)
ca: <filename>boot.msg</filename> (missatge opcional d'arrencada)
de: <filename>boot.msg</filename> (optionale Boot-Meldungen)
it: <filename>boot.msg</filename> (messaggio opzionale di avvio)
nl: <filename>boot.msg</filename> (facultatieve opstartmelding)
