Repository: aspschn/d-i
Catalog: installation-guide/po/*/install-methods.po
Languages: ca, de, it, nl

source: By contrast, setting up BOOTP with ISC <command>dhcpd</command> is really easy, because it treats BOOTP clients as a moderately special case of DHCP clients. Some architectures require a complex configuration for booting clients via BOOTP. If yours is one of those, read the section <xref linkend="dhcpd"/>. Otherwise you will probably be able to get away with simply adding the <userinput>allow bootp</userinput> directive to the configuration block for the subnet containing the client in <filename>/etc/dhcp/dhcpd.conf</filename>, and restart <command>dhcpd</command> with <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.
ca: Per altra banda, configurar el BOOTP amb el <command>dhcpd</command> d'ISC és molt fàcil, ja que considera els clients BOOTP com un cas un poc especial de clients de DHCP. A algunes arquitectures necessitareu d'una configuració complexa per arrencar els clients via BOOTP. Si aquest és el vostre cas, llegiu la secció <xref linkend="dhcpd"/>. Altrament, ho aconseguireu afegint la directiva <userinput>allow bootp</userinput> al bloc de configuració per la xarxa que conté el client al fitxer <filename>/etc/dhcp/dhcpd.conf</filename>, i reiniciant el <command>dhcpd</command> amb <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.
de: Im Unterschied dazu ist es wirklich einfach, den ISC-<command>dhcpd</command> einzurichten, da dieser BOOTP-Clients gewissermaßen als Spezialfall von DHCP-Clients behandelt. Einige Architekturen erfordern eine komplexe Konfiguration, um Clients per BOOTP zu starten. Wenn Sie solch einen Fall haben, lesen Sie <xref linkend="dhcpd"/>. Andernfalls könnte es vielleicht ausreichen, in der Datei <filename>/etc/dhcp/dhcpd.conf</filename> den Eintrag <userinput>allow bootp</userinput> zu dem Abschnitt hinzuzufügen, der das Subnetz konfiguriert, zu dem Ihr Client gehört. Danach muss der <command>dhcpd</command> mit <userinput>/etc/init.d/isc-dhcp-server restart</userinput> neu gestartet werden.
it: Al contrario l'impostazione di BOOTP con <command>dhcpd</command> di ISC è veramente semplice poiché tratta i client BOOTP come un caso moderatamente speciale dei client DHCP. Alcune architetture richiedono una complessa configurazione dei client per l'avvio con BOOTP, se si possiede una di queste leggere la sezione <xref linkend="dhcpd"/>. In caso contrario per proseguire è sufficiente aggiungere la direttiva <userinput>allow bootp</userinput> al blocco di configurazione della subnet a cui appartiene il client in <filename>/etc/dhcp/dhcpd.conf</filename> e riavviare <command>dhcpd</command> usando <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.
nl: Daartegenover is het instellen van BOOTP met ISC <command>dhcpd</command> echt gemakkelijk, omdat het BOOTP-cliënten behandelt als een enigszins bijzondere soort van DHCP-cliënten. Voor sommige architecturen is een complexe configuratie nodig om cliënten via BOOTP op te starten. Indien uw architectuur daar één van is, moet u het onderdeel <xref linkend="dhcpd"/> lezen. Anders zal het wellicht volstaan om in het bestand <filename>/etc/dhcp/dhcpd.conf</filename> gewoon de opdracht <userinput>allow bootp</userinput> toe te voegen aan het configuratieblok dat betrekking heeft op het subnet waartoe uw cliënt behoort, en <command>dhcpd</command> opnieuw te starten met het commando <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.

source: Enabling the TFTP Server
ca: Habilitació del servidor TFTP
de: Den TFTP-Server aktivieren
it: Attivazione di un server TFTP
nl: De TFTP-server werkzaam maken

source: To get the TFTP server ready to go, you should first make sure that <command>tftpd</command> is enabled.
ca: Per a posar en marxa el servidor TFTP, assegureu-vos primer que teniu activat el <command>tftpd</command>.
de: Um den TFTP-Server einzurichten, sollten Sie als Erstes sicherstellen, dass <command>tftpd</command> aktiv ist.
it: Per avere un server TFTP pronto all'uso è necessario assicurarsi che <command>tftpd</command> sia attivo.
nl: Opdat de TFTP-server klaar voor de dienst zou zijn, moet u eerst controleren of <command>tftpd</command> geactiveerd is.

source: In the case of <classname>tftpd-hpa</classname> there are two ways the service can be run. It can be started on demand by the system's <classname>inetd</classname> daemon, or it can be set up to run as an independent daemon. Which of these methods is used is selected when the package is installed and can be changed by reconfiguring the package.
ca: En el cas de <classname>tftpd-hpa</classname> hi ha dues formes d'executar el servei. Pot ser iniciat sota demanda pel dimoni <classname>inetd</classname> del sistema o es pot configurar per a executar com un dimoni independent. El mètode a emprar és seleccionat en instal·lar el paquet i pot ser canviat reconfigurant aquest.
de: Im Falle von <classname>tftpd-hpa</classname> gibt es zwei Wege, wie der Dienst zum Laufen gebracht werden kann. Er kann bei Bedarf vom <classname>inetd</classname>-Daemon des Systems gestartet werden oder er kann eingerichtet werden, als eigenständiger Daemon zu laufen. Welche der beiden Methoden verwendet wird, wird bei der Installation des Pakets ausgewählt und kann auch später geändert werden, indem das Paket rekonfiguriert wird.
it: Il servizio <classname>tftpd-hpa</classname> può funzionare in due modalità. Può essere avviato su richiesta dal demone di sistema <classname>inetd</classname> oppure come demone indipendente. La scelta della modalità di esecuzione è fatta durante l'installazione del pacchetto e può essere modificata riconfigurando il pacchetto.
nl: In het geval van <classname>tftpd-hpa</classname> kan de dienst op twee manieren functioneren. Hij kan op vraag van de achtergronddienst <classname>inetd</classname> van het systeem geactiveerd worden, of hij kan ingesteld worden om als een onafhankelijke achtergronddienst te werken. Welke van beide methodes gebruikt wordt, wordt ingesteld bij het installeren van het pakket en kan gewijzigd worden door het pakket opnieuw te configureren.

source: Historically, TFTP servers used <filename>/tftpboot</filename> as directory to serve images from. However, &debian-gnu; packages may use other directories to comply with the <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink>. For example, <classname>tftpd-hpa</classname> by default uses <filename>/srv/tftp</filename>. You may have to adjust the configuration examples in this section accordingly.
ca: Històricament, els servidors TFTP utilitzen el directori <filename>/tftpboot</filename> per servir les imatges. Per altra banda, els paquets de &debian-gnu; poden utilitzar altres directoris per complir amb l'<ulink url="&url-fhs-home;">Estàndard de la Jerarquia del Sistema de Fitxers</ulink>. Per exemple, el <classname>tftpd-hpa</classname> utilitza per defecte <filename>/srv/tftp</filename>. Es possible que hagueu d'ajustar els exemples de configuració d'aquesta secció en conseqüència.
de: Früher haben TFTP-Server das Verzeichnis <filename>/tftpboot</filename> genutzt, um Images bereitzustellen. Allerdings verwenden Server aus &debian-gnu;-Paketen unter Umständen andere Verzeichnisse, um den <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink> (Festlegungen, an welcher Stelle im Dateisystem bestimmte Daten abgespeichert werden sollten) zu erfüllen. Zum Beispiel nutzt <classname>tftpd-hpa</classname> standardmäßig <filename>/srv/tftp</filename>. Sie müssen also eventuell die Konfigurationsbeispiele aus diesem Kapitel entsprechend an Ihre Situation anpassen.
it: Storicamente i server TFTP hanno usato <filename>/tftpboot</filename> come directory dalla quale servire le immagini. Invece, i pacchetti &debian-gnu; potrebbero usare una directory diversa in modo da essere conformi al <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink>. Per esempio <classname>tftpd-hpa</classname> usa <filename>/srv/tftp</filename>; potrebbe essere necessario modificare gli esempi presenti in questa sezione in base alla propria configurazione.
nl: Lange tijd gebruikten TFTP-servers <filename>/tftpboot</filename> als map van waaruit images aangeboden werden. Nochtans kunnen pakketten van &debian-gnu; andere mappen gebruiken om te beantwoorden aan de standaard van de <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink>. <classname>tftpd-hpa</classname> bijvoorbeeld gebruikt standaard <filename>/srv/tftp</filename>. Misschien zult u de configuratievoorbeelden uit dit onderdeel dienovereenkomstig moeten aanpassen.

source: All <command>in.tftpd</command> alternatives available in &debian; should log TFTP requests to the system logs by default. Some of them support a <userinput>-v</userinput> argument to increase verbosity. It is recommended to check these log messages in case of boot problems as they are a good starting point for diagnosing the cause of errors.
ca: Totes les alternatives de l'<command>in.tftpd</command> que hi ha a &debian; per defecte haurien d'enregistrar les peticions TFTP al registre del sistema. Algunes d'elles suporten un paràmetre <userinput>-v</userinput> per mostrar una sortida més detallada. Es recomana que comproveu aquests missatges registrats en el cas que patiu problemes d'arrencada com a punt d'inici al diagnòstic de la causa dels problemes.
de: Alle in &debian; verfügbaren <command>in.tftpd</command>-Alternativen sollten standardmäßig Protokolleinträge aller TFTP-Anfragen in das System-Log schreiben. Einige unterstützen das Argument <userinput>-v</userinput>, um die Ausführlichkeit der Einträge zu erhöhen. Es wird empfohlen, im Falle von Boot-Problemen diese Logeinträge zu kontrollieren; sie sind ein guter Anfang, um der Fehlerursache auf die Spur zu kommen.
it: Tutte le versioni di <command>in.tftpd</command> disponibili in &debian; registrano le richieste TFTP sul log di sistema e alcune versioni supportano l'opzione <userinput>-v</userinput> per aumentare la verbosità. In caso di problemi d'avvio, si raccomanda di verificare i messaggi nel log poiché sono un ottimo punto di partenza per la diagnosi della causa degli errori.
nl: Alle in &debian; aanwezige <command>in.tftpd</command> alternatieven zouden TFTP-verzoeken standaard moeten registreren in de systeemlogbestanden. Sommige onder hen hebben een argument <userinput>-v</userinput> waarmee de hoeveelheid gegeven informatie kan verhoogd worden. Het wordt aangeraden om deze logberichten na te kijken in geval van opstartproblemen omdat ze een goed beginpunt zijn voor het diagnosticeren van de oorzaak van problemen.

source: If you intend to install &debian; on an SGI machine and your TFTP server is a GNU/Linux box running Linux 2.4, you'll need to set the following on your server: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> to turn off Path MTU discovery, otherwise the SGI's PROM can't download the kernel. Furthermore, make sure TFTP packets are sent from a source port no greater than 32767, or the download will stall after the first packet. Again, it's Linux 2.4.X tripping this bug in the PROM, and you can avoid it by setting <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> to adjust the range of source ports the Linux TFTP server uses.
ca: Si aneu a instal·lar &debian; en una màquina SGI i el servidor TFTP empra GNU/Linux amb Linux 2.4, heu de posar això al servidor: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> per desactivar la funcionalitat Path MTU discovery, altrament la PROM de SGI no podrà descarregar el nucli. A més, assegureu-vos que els paquets TFTP s'envien des d'un port origen no major que el 32767, o la descàrrega s'estancarà després del primer paquet. Per evitar aquest error de la PROM amb el Linux 2.4.X, feu el següent, <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> a fi d'ajustar el rang de ports origen que empra el servidor TFTP de Linux.
de: Wenn Sie vorhaben, &debian; auf einer SGI-Maschine zu installieren, und Ihr TFTP-Server ist ein GNU/Linux-Rechner mit Linux 2.4, müssen Sie <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> auf dem Server ausführen, um <quote>Path MTU Discovery</quote> auszuschalten, andernfalls kann der PROM des SGI den Kernel nicht herunterladen. Außerdem müssen Sie sicherstellen, dass TFTP-Pakete von einem Quellport nicht höher als 32767 verschickt werden, sonst wird der Download nach dem ersten Paket stoppen. Es ist wieder der Linux-Kernel 2.4.x, der diesen Fehler im PROM auslöst, aber Sie können dies vermeiden, indem Sie <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> ausführen; dies stellt den Bereich der Quellports ein, den der Linux-TFTP-Server benutzt.
it: Se si intende installare &debian; su una macchina SGI e il server TFTP è su una macchina GNU/Linux con Linux 2.4 è necessario eseguire comando seguente sul server: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> per disattivare il Path MTU discovery, in caso contrario la PROM delle SGI non può scaricare il kernel. Inoltre, assicurarsi che i pacchetti TFTP siano inviati da una porta inferiore alla 32767 altrimenti il trasferimento si interromperà dopo il primo pacchetto. Anche questo bug della PROM può essere aggirato con Linux 2.4.X eseguendo il comando seguente <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> per regolare l'intervallo delle porte sorgente usate sul server TFTP Linux.
nl: Indien u van plan bent om &debian; op een SGI-machine te installeren en uw TFTP-server een GNU/Linux-computer is met Linux 2.4, zult u op uw server het volgende moeten instellen: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> Dit is om Path MTU discovery (het onderling bepalen van de maximale grootte van over de netwerkverbinding verzonden pakketten) uit te zetten, anders kan het PROM van de SGI de kernel niet downloaden. Daarenboven moet u ervoor zorgen dat de TFTP-pakketten niet verzonden worden van een poort die groter is dan 32767, anders zal het downloaden stoppen na het eerste pakket. Opnieuw is het Linux 2.4.X dat struikelt over deze bug in het PROM en u kunt dit vermijden door de spreidingsbreedte van de poorten die door de Linux TFTP-server gebruikt kunnen worden, aan te passen door het volgende in te stellen: <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample>

source: Move TFTP Images Into Place
ca: Posar les imatges del TFTP al seu lloc
de: Die TFTP-Images an ihren Platz befördern
it: Posizionamento delle immagini TFTP
nl: De TFTP-images op hun plaats zetten

source: Next, place the TFTP boot image you need, as found in <xref linkend="where-files"/>, in the <command>tftpd</command> boot image directory. You may have to make a link from that file to the file which <command>tftpd</command> will use for booting a particular client. Unfortunately, the file name is determined by the TFTP client, and there are no strong standards.
ca: Després, col·loqueu la imatge d'arrencada TFTP que us calga, i que figura a <xref linkend="where-files"/>, al directori d'imatges d'arrencada del <command>tftpd</command>. Haureu de fer un enllaç des d'aquest fitxer al fitxer que emprarà el <command>tftpd</command> per arrencar un client determinat. Malauradament, el nom del fitxer el determina el client TFTP i no hi existeix cap norma ben establerta.
de: Als nächstes legen Sie die TFTP-Boot-Images, die Sie benötigen und die Sie wie in <xref linkend="where-files"/> beschrieben bekommen können, im <command>tftpd</command>-Bootimage-Verzeichnis ab. Sie müssen unter Umständen einen Link von diesem Image auf die Datei anlegen, die <command>tftpd</command> benutzt, um einen speziellen Client zu booten. Bedauerlicherweise hängt der Name dieser Datei von dem TFTP-Client ab und es gibt dabei keine festen Standards.
it: Spostare le immagini TFTP di cui si ha bisogno (come descritto in <xref linkend="where-files"/>) nella directory delle immagini di avvio per TFTP. Potrebbe essere necessario fare un link da questa directory al file che <command>tftpd</command> dovrà utilizzare per l'avvio di un particolare client. Sfortunatamente il nome del file è stabilito dal client TFTP e non esiste uno standard.
nl: Plaats vervolgens het TFTP boot-image dat u nodig heeft en dat te vinden is in <xref linkend="where-files"/>, in de map van <command>tftpd</command> voor opstart-images. Eventueel moet u een koppeling maken van dat bestand naar het bestand dat <command>tftpd</command> zal gebruiken om een specifieke cliënt op te starten. Spijtig genoeg wordt de bestandsnaam bepaald door de TFTP-cliënt en zijn er geen duidelijke standaarden.

source: On NewWorld Power Macintosh machines, you will need to set up the <command>yaboot</command> boot loader as the TFTP boot image. <command>Yaboot</command> will then retrieve the kernel and RAMdisk images via TFTP itself. You will need to download the following files from the <filename>netboot/</filename> directory:
ca: En màquines NewWorld Power Macintosh, heu d'establir el carregador d'arrencada <command>yaboot</command> com a imatge d'arrencada TFTP. Amb això el <command>yaboot</command> enviarà les imatges del nucli i el RAMdisk a través del TFTP mateix. Necessitareu descarregar els fitxers següents des del directori <filename>netboot/</filename>:
de: Auf NewWorld-PowerMacs müssen Sie den <command>yaboot</command>-Bootloader als TFTP-Bootimage einstellen. <command>yaboot</command> wird dann selbst das Kernel- und RAM-Disk-Image per TFTP abrufen. Sie müssen die folgenden Dateien aus dem <filename>netboot/</filename>-Verzeichnis herunterladen:
it: Sulle macchine Power Machintosh NewWorld è necessario configurare il bootloader <command>yaboot</command> come immagine di avvio TFTP. Sarà poi <command>yaboot</command> a recuperare le immagini del kernel e del ramdisk sempre tramite TFTP. È necessario scaricare i seguenti file dalla directory <filename>netboot/</filename>:
nl: Op NewWorld Power Macintosh machines zult u de opstartlader <command>yaboot</command> moeten instellen als het TFTP opstart-image. <command>Yaboot</command> zelf zal dan de images van de kernel en de RAM-schijf ophalen via TFTP. U zult de volgende bestanden moeten downloaden van de map <filename>netboot/</filename>:

source: For PXE booting, everything you should need is set up in the <filename>netboot/netboot.tar.gz</filename> tarball. Simply extract this tarball into the <command>tftpd</command> boot image directory. Make sure your dhcp server is configured to pass <filename>pxelinux.0</filename> to <command>tftpd</command> as the filename to boot. For UEFI machines, you will need to pass an appropriate EFI boot image name (such as <filename>/debian-installer/amd64/bootnetx64.efi</filename>).
de: Alles was Sie benötigen, um per PXE zu booten, ist bereits in dem <filename>netboot/netboot.tar.gz</filename>-Tarball eingerichtet. Entpacken Sie den Tarball einfach in das <command>tftpd</command>-Bootimage-Verzeichnis. Stellen Sie sicher, dass der DHCP-Server konfiguriert ist, <filename>pxelinux.0</filename> als zu bootende Datei zum <command>tftpd</command> weiterzuleiten. Für UEFI-Rechner müssen Sie den Namen eines passenden UEFI-Boot-Images (wie <filename>/debian-installer/amd64/bootnetx64.efi</filename>) angeben.
it: Tutte le operazioni necessarie per l'avvio con PXE sono già state preparate in <filename>netboot/netboot.tar.gz</filename>. Estrarre questo tarball nella directory delle immagini di avvio <command>tftpd</command> e assicurarsi che il server dhcp sia configurato per passare <filename>pxelinux.0</filename> come nome del file da avviare a <command>tftpd</command>. Su macchine UEFI è necessario passare il nome di un'immagine di avvio EFI (quale <filename>/debian-installer/amd64/bootnetx64.efi</filename>).
nl: Alles wat u nodig heeft voor het opstarten via PXE is ingesteld in het tararchief <filename>netboot/netboot.tar.gz</filename>. U moet dit archief gewoon uitpakken in de <command>tftpd</command>-map voor opstart-images. Zorg ervoor dat uw dhcp-server ingesteld staat om <filename>pxelinux.0</filename> door te geven aan <command>tftpd</command> als de naam van het opstartbestand. Voor UEFI-machines zult u de naam van een passend EFI-opstartimage moeten opgeven (zoals <filename>/debian-installer/amd64/bootnetx64.efi</filename>).

source: For PXE booting, everything you should need is set up in the <filename>netboot/netboot.tar.gz</filename> tarball. Simply extract this tarball into the <command>tftpd</command> boot image directory. Make sure your dhcp server is configured to pass <filename>/debian-installer/ia64/elilo.efi</filename> to <command>tftpd</command> as the filename to boot.
ca: Per a arrencar amb PXE, només cal l'arxiu tar <filename>netboot/netboot.tar.gz</filename>. Extraieu-lo al directori d'imatge d'arrencada <command>tftpd</command>. Assegureu-vos que el servidor dhcp està configurat per passar <filename>/debian-installer/ia64/elilo.efi</filename> al <command>tftpd</command> com a nom del fitxer d'arrencada.
de: Um per PXE zu booten, müssen Sie nur den <filename>netboot/netboot.tar.gz</filename>-Tarball einrichten. Entpacken Sie den Tarball einfach in das <command>tftpd</command>-Bootimage-Verzeichnis. Stellen Sie sicher, dass der DHCP-Server konfiguriert ist, <filename>/debian-installer/ia64/elilo.efi</filename> als zu bootende Datei zum <command>tftpd</command> weiterzuleiten.
it: Per l'avvio PXE tutte le operazioni necessarie sono già state fatte in <filename>netboot/netboot.tar.gz</filename>. Estrarre questo tarball nella directory delle immagini di avvio di <command>tftpd</command>, assicurarsi che il server dhcp sia configurato per passare <filename>/debian-installer/ia64/elilo.efi</filename> come file da avviare a <command>tftpd</command>.
nl: Alles wat u nodig heeft voor het opstarten via PXE zou moeten voorbereid zijn in het tararchief <filename>netboot/netboot.tar.gz</filename>. U moet dit archief gewoon uitpakken in de map van <command>tftpd</command> voor opstart-images. Zorg ervoor dat uw dhcp-server ingesteld staat om <filename>/debian-installer/ia64/elilo.efi</filename> door te geven aan <command>tftpd</command> als de naam van het opstartbestand.

source: SPARC TFTP Booting
ca: Arrencada TFTP de l'SPARC
de: TFTP-Boot von SPARC-Systemen
it: Avvio di macchine SPARC con TFTP
nl: Opstarten via TFTP met SPARC
