Repository: aspschn/d-i
Catalog: packages/cdrom-checker/debian/po/*.po
Languages: kn, ro, ug

source: Check CD-ROM integrity?
kn: ಸಿ ಡಿ ರೊಮ್ ನ ಸಮಗ್ರತೆಯನ್ನು ಪರಿಶೀಲಿಸಿ?
ro: Verificați integritatea CD-ului?
ug: CD-ROM نىڭ مۇكەممەللىكىنى تەكشۈرەمسىز؟

source: Warning: this check depends on your hardware and may take some time.
kn: ಎಚ್ಚರಿಕೆ: ಈ ಪರೀಶೀಲನೆಯು ನಿಮ್ಮ ಯಂತ್ರಾಂಶವನ್ನು ಅವಲಂಬಿಸಿರುತ್ತದೆ ಮತ್ತು ಕೆಲ ಕಾಲ ತೆಗೆದುಕೊಳ್ಳಬಹುದು.
ro: Atenție: acestă verificare depinde de componentele mașinii dumneavoastră și s-ar putea să dureze ceva timp.
ug: ئاگاھلاندۇرۇش: تەكشۈرۈش قاتتىق دېتال ئىقتىدارى بىلەن مۇناسىۋەتلىك، ئۇزاقراق ۋاقىت كېتىشى مۇمكىن.

source: Insert a Debian CD-ROM
kn: ಡೆಬಿಯನ್ ಸಿ ಡಿ ರೊಮ್ ಅನ್ನು ತುರುಕಿ
ro: Introduceți un CD Debian
ug: Debian نۇر دىسكىسىنى قىستۇرۇڭ

source: Please insert one of the official Debian CD-ROMs into the drive before continuing.
kn: ದಯಮಾಡಿ ಮುಂದುವರೆಯುವ ಮುನ್ನ ಯಾವುದಾದರೊಂದು ಅಧಿಕೃತ ಡೆಬಿಯನ್ ಗಣಕಮುದ್ರಿಕೆಯನ್ನು ಡ್ರೈವಿನೊಳಗೆ ಹಾಕಿ.
ro: Vă rugăm să introduceți un CD oficial Debian în unitate înainte de a continua.
ug: ئورنىتىشنى داۋاملاشتۇرۇشتىن ئىلگىرى Debian نۇر دىسكىسىنى قوزغاتقۇچقا قىستۇرۇڭ.

source: Failed to mount CD-ROM
kn: ಸಿ ಡಿ ರೊಮ್ ಅನ್ನು ಆರೋಹಿಸುವಲ್ಲಿ ವಿಫಲಗೊಂಡಿದೆ
ro: Eșec la montarea CD-ului
ug: CD-ROM نى ئېگەرلەش مەغلۇپ بولدى

source: The CD-ROM ${CDROM} could not be mounted correctly. Please check the media and cables, and try it again.
kn: ${CDROM} ಗಣಕಮುದ್ರಿಕೆಯನ್ನು ಸರಿಯಾಗಿ ಏರಿಸಲು ಸಾಧ್ಯವಾಗಿಲ್ಲ. ದಯಮಾಡಿ ಮಾಧ್ಯಮ ಹಾಗು ಕೇಬಲ್ಲುಗಳನ್ನು ಪರೀಕ್ಷಿಸಿ ಮತ್ತು ಮರುಪ್ರಯತ್ನಿಸಿ.
ro: CD-ul ${CDROM} nu a putut fi montat corect. Vă rugăm să verificați CD-ul și cablurile, apoi încercați din nou.
ug: ${CDROM} CD-ROM نى توغرا ئېگەرلىيەلمىدى. ۋاسىتە ۋە كابېلنى تەكشۈرۈپ قايتا سىناڭ.

source: No valid Debian CD-ROM
kn: ಮಾನ್ಯವಾದ ಡೆಬಿಯನ್ ಸಿಡಿ ರಾಂ ಕಂಡುಬಂದಿಲ್ಲ‌.
ro: CD Debian invalid
ug: ئىناۋەتسىز Debian نۇر دىسكىسى

source: The CD-ROM you have inserted is not a valid Debian CD-ROM. Please change the disk.
kn: ನೀವು ಹಾಕಿದ ಗಣಕಮುದ್ರಿಕೆಯು ಡೆಬಿಯನ್ನಿನ ಅಧಿಕೃತ ಗಣಕಮುದ್ರಿಕೆಯಲ್ಲ. ದಯಮಾಡಿ ಡಿಸ್ಕನ್ನು ಬದಲಾಯಿಸಿ.
ro: CD-ul introdus nu este un CD Debian valid. Vă rugăm să schimbați discul.
ug: قىستۇرغان نۇر دىسكا Debian نىڭ ئىناۋەتلىك دىسكىسى ئەمەس، دىسكىنى ئالماشتۇرۇڭ.

source: Failed to open checksum file
kn: checksum ಕಡತವನ್ನು ತೆರೆಯುವಲ್ಲಿ ವಿಫಲಗೊಂಡಿದೆ
ro: Eșec la deschiderea fișierului cu sumele de control
ug: تەكشۈرۈش يىغىندا ھۆججىتى(checksum file)نى ئېچىش مەغلۇپ بولدى

source: Opening the MD5 file on the CD-ROM failed. This file contains the checksums of the files located on the CD-ROM.
kn: ಗಣಕಮುದ್ರಿಕೆಯಲ್ಲಿನ MD5 ಕಡತವನ್ನು ತೆರೆಯುವಲ್ಲಿ ವಿಫಲವಾಗಿದೆ. ಈ ಕಡತವು ಗಣಕಮುದ್ರಿಕೆಯ ಮೇಲಿನ ಕಡತಗಳ ಪರೀಕ್ಷಣಾಮೊತ್ತವನ್ನು ಹೊಂದಿದೆ.
ro: Deschiderea fișierului MD5 de pe CD a eșuat. Acest fișier conține sumele de control ale fișierelor aflate pe CD.
ug: CD-ROM دىكى MD5 ھۆججەتنى ئېچىش مەغلۇپ بولدى. بۇ ھۆججەت CD-ROM دىكى بارلىق ھۆججەتلەرنىڭ تەكشۈرۈش يىغىندىسىنى ئۆز ئىچىگە ئالغان.

source: Integrity test successful
kn: ಸಮಗ್ರತಾ ಪರೀಕ್ಷೆ ಯಶಸ್ವಿಗೊಂಡಿದೆ
ro: Test de integritate reușit
ug: مۇكەممەللىكنى تەكشۈرۈش مۇۋەپپەقىيەتلىك بولدى

source: The CD-ROM integrity test was successful. The CD-ROM is valid.
kn: ಗಣಕಮುದ್ರಿಕೆಯ ಸಮಗ್ರತೆಯ ಪರೀಕ್ಷೆ ಯಶಸ್ವಿಯಾಗಿದೆ. ಗಣಕಮುದ್ರಿಕೆಯ ಸರಿಯಾಗಿದೆ.
ro: CD-ul a trecut testul de integritate. CD-ul este valid.
ug: CD-ROM مۇكەممەللىكىنى تەكشۈرۈش مۇۋەپپەقىيەتلىك تاماملاندى. بۇ CD-ROM ئىناۋەتلىك.

source: Integrity test failed
kn: ಸಮಗ್ರತಾ ಪರೀಕ್ಷೆಯು ವಿಫಲಗೊಂಡಿದೆ.
ro: Test de integritate eșuat
ug: مۇكەممەللىكىنى تەكشۈرۈش مەغلۇپ بولدى

source: The ${FILE} file failed the MD5 checksum verification. Your CD-ROM or this file may have been corrupted.
kn: ${FILE} ಕಡತವು MD5 ಪರೀಕ್ಷಣಾಮೊತ್ತ ಪರಿಶೀಲನೆಯಲ್ಲಿ ವಿಫಲವಾಗಿದೆ. ನಿಮ್ಮ ಗಣಕಮುದ್ರಿಕೆ ಅಥವಾ ಈ ಕಡತವು ಹಾಳಾಗಿರಬಹುದು.
ro: Fișierul ${FILE} nu a trecut de verificarea sumei de control MD5. CD-ul sau acest fișier ar putea fi corupt.
ug: ${FILE} ھۆججەتنىڭ MD5 تەكشۈرۈش يىغىندىسىنى دەلىللەش مەغلۇپ بولدى. CD-ROM ئىڭىز ياكى بۇ ھۆججەت بۇزۇلغان بولۇشى مۇمكىن.

source: Check the integrity of another CD-ROM?
kn: ಬೇರೊಂದು ಅಡಕ ತಟ್ಟೆಯ ಸಮಗ್ರತೆಯನ್ನು ಪರೀಕ್ಷಿಸುವುದೇ?
ro: Verificați integritatea altui CD?
ug: باشقا بىر CD-ROM نىڭ مۇكەممەللىكىنى تەكشۈرەمسىز؟

source: Insert Debian boot CD-ROM
kn: ಡೆಬಿಯನ್ ಸಿ ಡಿ ರೊಮ್ ಅನ್ನು ತುರುಕಿ
ro: Introduceți CD-ul Debian de pornire
ug: Debian نىڭ قوزغىتىش نۇر دىسكىسىنى قىستۇرۇڭ

source: Please make sure you have inserted the Debian boot CD-ROM to continue with the installation.
kn: ದಯಮಾಡಿ ಅನುಸ್ಥಾಪನೆಯನ್ನು ಮುಂದುವರೆಸಲು ನೀವು ಡೆಬಿಯನ್ ಬೂಟ್ ಗಣಕಮುದ್ರಿಕೆಯನ್ನು ಹಾಕಿರುವಿರಾ ಎಂಬುದನ್ನು ಖಾತ್ರಿಪಡಿಸಿ.
ro: Vă rugăm să vă asigurați că ați introdus CD-ul Debian de pornire, pentru a continua instalarea.
ug: قىستۇرغىنىڭىزنىڭ Debian قوزغىتىش دىسكىسى ئىكەنلىكىنى جەزملەپ ئاندىن ئورنىتىشنى داۋاملاشتۇرۇڭ.

source: Checking CD-ROM integrity
kn: ಸಿ ಡಿ ರೊಮ್ ನ ಸಮಗ್ರತೆಯನ್ನು ಪರಿಶೀಲಿಸಲಾಗುತ್ತಿದೆ
ro: Se verifică integritatea CD-ului
ug: CD-ROM نىڭ مۇكەممەللىكىنى تەكشۈرۈۋاتىدۇ

source: Checking file: ${FILE}
kn: ಕಡತವನ್ನು :${FILE} ಪರಿಶೀಲಿಸಲಾಗುತ್ತಿದೆ
ro: Se verifică fișierul: ${FILE}
ug: ھۆججەت تەكشۈرۈۋاتىدۇ:${FILE}

source: Check the CD-ROM(s) integrity
kn: ಅಡಕ ತಟ್ಟೆಯ ಸಮಗ್ರತೆಯನ್ನು ಪರೀಕ್ಷಿಸಿ
ro: Verifică integritatea CD-ului (CD-urilor)
ug: CD-ROM نىڭ مۇكەممەللىكىنى تەكشۈر
