Repository: aspschn/d-i
Catalog: packages/cdrom-detect/debian/po/*.po
Languages: kn

source: Load CD-ROM drivers from removable media?
kn: ತೆಗೆಯಬಹುದಾದ ಮಾಧ್ಯಮಗಳಿಂದ CD-ROM ಚಾಲಕ ತಂತ್ರಾಂಶಗಳನ್ನು ತುಂಬಬಹುದೆ?

source: No common CD-ROM drive was detected.
kn: ಸಾಮಾನ್ಯವಾದ‌ ಸಿಡಿ-ರಾಂ ಕಂಡುಬಂದಿಲ್ಲ‌.

source: You may need to load additional CD-ROM drivers from removable media, such as a driver floppy. If you have such media available now, insert it, and continue. Otherwise, you will be given the option to manually select CD-ROM modules.
kn: ನೀವು ಹೆಚ್ಚುವರಿ CD-ROM ಚಾಲಕ ತಂತ್ರಾಂಶಗಳನ್ನು ಕಳಚಬಲ್ಲ ಮಾಧ್ಯಮದಿಂದ, ಉದಾಹರಣೆಗೆ ಚಾಲಕ ಫ್ಲಾಪಿ, ತುಂಬಬೇಕಾದೀತು. ನಿಮ್ಮಲ್ಲಿ ಇಂತಹ ಮಾಧ್ಯಮ ಈಗ ಲಭ್ಯವಿದ್ದರೆ ಅದನ್ನು ಒಳಹಾಕಿ ಮುಂದುವರೆಯಿರಿ. ಇಲ್ಲವಾದಲ್ಲಿ ನಿಮಗೆ ಸ್ವತಃ CD-ROM ಘಟಕಗಳನ್ನು ಆಯ್ಕೆ ಮಾಡಲು ಅವಕಾಶ ನೀಡಲಾಗುತ್ತದೆ.

source: Detecting hardware to find CD-ROM drives
kn: ಗಣಕದ ಯಂತ್ರಾಂಶಗಳನ್ನು ಸಿ ಡಿ ಡ್ರೈವ್ಗಳಿಗಾಗಿ ಹುಡುಕಲಾಗುತ್ತಿದೆ

source: Manually select a CD-ROM module and device?
kn: ಸ್ವತಃ ಸಿಡಿ-ರಾಂ ಘಟಕ ಹಾಗು ಸಾಧನವನ್ನು ಆಯ್ಕೆಮಾಡಿ?

source: Your CD-ROM drive may be an old Mitsumi or another non-IDE, non-SCSI CD-ROM drive. In that case you should choose which module to load and the device to use. If you don't know which module and device are needed, look for some documentation or try a network installation instead of a CD-ROM installation.
kn: ನಿಮ್ಮ ಗಣಕಮುದ್ರಿಕೆ ಡ್ರೈವ್ ಹಳೆಯ ಮಿತ್ಸುಮಿ ಅಥವಾ ಬೇರೊಂದು IDEಯಲ್ಲದ, SCSIಯಲ್ಲದ ಗಣಕಮುದ್ರಿಕೆ ಡ್ರೈವ್ ಆಗಿರಬೇಕು. ಹಾಗಾದ ಪಕ್ಷದಲ್ಲಿ ನೀವು ಯಾವ ವಿಭಾಗವನ್ನು ತುಂಬಬೇಕು ಮತ್ತು ಯಾವ್ ಉಪಕರಣವನ್ನು ಬಳಸುವುದೆಂದು ಆಯ್ಕೆ ಮಾಡಬೇಕು. ಅದು ನಿಮಗೆ ತಿಳಿಯದಿದ್ದರೆ ಸಹಾಯ ಮಾಹಿತಿಯಲ್ಲಿ ಹುಡುಕಿ ಅಥವಾ ಗಣಕಮುದ್ರಿಕೆಯ ಅನುಸ್ಥಾಪನೆಯ ಬದಲಾಗಿ ಜಾಲಬಂಧ ಅನುಸ್ಥಾಪನೆಯನ್ನು ಪ್ರಯತ್ನಿಸಿ.

source: Retry mounting the CD-ROM?
kn: ಅಡಕ ತಟ್ಟೆಯನ್ನು ಏರಿಸಲು ಮರುಪ್ರಯತ್ನಿಸುವುದೆ?

source: Your installation CD-ROM couldn't be mounted. This probably means that the CD-ROM was not in the drive. If so you can insert it and try again.
kn: ನಿಮ್ಮ ಅನುಸ್ಥಾಪನ ಗಣಕಮುದ್ರಿಕೆಯನ್ನು ಅರೋಹಿಸಲಾಗುತ್ತಿಲ್ಲ. ಪ್ರಾಯಶಃ ನಿಮ್ಮ ಗಣಕಮುದ್ರಿಕೆ ಡ್ರೈವ್ ಒಳಗಿಲ್ಲ. ಹಾಗಿದ್ದಲ್ಲಿ ಮುದ್ರಿಕೆಯನ್ನು ಒಳಗೆ ಹಾಕಿ, ನಂತರ ಪ್ರಯತ್ನಿಸಿ.

source: Module needed for accessing the CD-ROM:
kn: ಗಣಕಮುದ್ರಿಕೆಯನ್ನು ಉಪಯೋಗಿಸಲು ತಂತ್ರಾಂಶಭಾಗದ ಅಗತ್ಯವಿದೆ:

source: The automatic detection didn't find a CD-ROM drive. You can try to load a specific module if you have an unusual CD-ROM drive (that is neither IDE nor SCSI).
kn: ಸ್ವಯಂಚಾಲಿತ ಪತ್ತೆಹಚ್ಚುವಿಕೆ ಗಣಕಮುದ್ರಿಕೆ ಸಾಧನವನ್ನು ಹುಡುಕಲಿಲ್ಲ. ನಿಮ್ಮ ಗಣಕಮುದ್ರಿಕೆ ಸಾಧನ ಅಸಾಮಾನ್ಯದ್ದಾಗಿದ್ದಲ್ಲಿ(ಅಂದರೆ,IDE ಹಾ SCSI ಏತರ) ನಿಶ್ಚಿತ ತಂತ್ರಾಂಶ ಭಾಗವನ್ನು ಉಪಯೋಗಿಸಿ ಮರುಪ್ರಯತ್ನ ಮಾಡಿ.

source: Device file for accessing the CD-ROM:
kn: .ಗಣಾಕಮುದ್ರಿಕೆಯನ್ನು ಪ್ರವೇಷಿಸಲು ಅಗತ್ಯವಿರುವ ಸಾಧನ ಕಡತ

source: In order to access your CD-ROM drive, please enter the device file that should be used. Non-standard CD-ROM drives use non-standard device files (such as /dev/mcdx).
kn: ನಿಮ್ಮ ಗಣಕಮುದ್ರಿಕೆಸಾಧನವನ್ನು ಪ್ರವೇಷಿಸಲು ಅಗತ್ಯವಿರುವ ಸಾಧನ ಕಡತವನ್ನು ಲಭ್ಯ ಮಾಡಿ. ಸ್ಟಾಂಡರ್ಡೇತರ ಗಣಕಮುದ್ರಿಕೆಸಾಧನಗಳು ಸ್ಟಾಂಡರ್ಡೇತರ ಸಾಧನ ಕಡತಗಳನ್ನು ಬಳಸುತ್ತವೆ(/ಡಿಇವಿ/ಎಮ್ ಸಿ ಡಿ ಎಕ್ಸ್)

source: You may switch to the shell on the second terminal (ALT+F2) to check the available devices in /dev with "ls /dev". You can return to this screen by pressing ALT+F1.
kn: ನೀವು ಎರಡನೆ ಟರ್ಮಿನಲ್ ಮೇಲೆ ಶೆಲ್ ಒಳಗೆ ಹೋಗಿ (ALT+F2) /dev ಯೊಳಗಿನ ಸಾಧನಗಳ ಲಭ್ಯತೆಯನ್ನು "ls/dev" ಮೂಲಕ ಅರಿಯಬಹುದು.

source: Scanning CD-ROM
kn: ಅಡಕ ತಟ್ಟೆಯನ್ನು ಶೋಧಿಸಲಾಗುತ್ತಿದೆ

source: Scanning ${DIR}...
kn: ${DIR}ಯನ್ನು ಶೋಧಿಸಲಾಗುತ್ತಿದೆ....

source: CD-ROM detected
kn: ಸಿಡಿ ರಾಂ ಅನ್ನು ಶೋಧಿಸಲ್ಪಟ್ಟಿದೆ

source: The CD-ROM autodetection was successful. A CD-ROM drive has been found and it currently contains the CD ${cdname}. The installation will now continue.
kn: ಸಿಡಿ ರಾಂ ನ ಸ್ವಯಂ ತಪಾಸಣೆ ಫಲವಾಗಿದೆ. ಒಂದು ಸಿಡಿ ರಾಂ ಶೋಧಿಸಲ್ಪಟ್ಟಿದೆ ಮತ್ತು ಅದರಲ್ಲಿ ಈಗ ${cdname} ಎಂಬ ಹೆಸರಿನ ಸಿಡಿಯು ಇದೆ. ಅನುಸ್ಥಾಪನೆಯು ಮುಂದುವರೆಯುವುದು.

source: Incorrect CD-ROM detected
kn: ಸರಿಯಲ್ಲದ ಸಿಡಿ ರಾಂ ಶೋಧಿಸಲ್ಪಟ್ಟಿದೆ

source: The CD-ROM drive contains a CD which cannot be used for installation.
kn: ಸಿಡಿ ರಾಂ ನಲ್ಲಿರುವ ಸಿಡಿಯನ್ನು ಅನುಸ್ಥಾಪನೆಗೆ ಉಪಯೋಗಿಸಲು ಆಗುವುದಿಲ್ಲ‌

source: Please insert a suitable CD to continue with the installation.
kn: ಅನುಸ್ಥಾಪನೆಯನ್ನು ಮುಂದುವರಿಸಲು ದಯವಿಟ್ಟು ಸರಿಯಾದ ಸಿಡಿಯನ್ನು ಸೇರಿಸಿ.

source: Error reading Release file
kn: ಬಿಡುಗಡೆ ಕಡತ‌ ದೋಶದಿಂದ ಕೂಡಿದೆ

source: The CD-ROM does not seem to contain a valid 'Release' file, or that file could not be read correctly.
kn: ಸಿಡಿ ರಾಂ ನಲ್ಲಿ ಚಲಾವಣೆಯಿಲ್ಲದ‌ 'ಬಿಡುಗಡೆ' ಕಡತ‌ ಅಥವಾ ಆ ಕಡತ‌ವನ್ನು ಸರಿಯಾಗಿ ಓದಲು ಆಗುತ್ತಿಲ್ಲ‌

source: You may try to repeat CD-ROM detection but, even if it does succeed the second time, you may experience problems later in the installation.
kn: ಗಣಕಮುದ್ರಿಕೆ ಸಾಧನವನ್ನು ಪತ್ತೆಹಚ್ಚುವ ಕ್ರಿಯೆಯನ್ನು ಮುಂದುವರಿಸಬಹುದು ಆದರೆ, ಎರಡನೇ ಬಾರಿಯು ಫಲಿಸದಿದ್ದಲ್ಲಿ ಅನುಸ್ಥಾಪಿಸುವಾಗ ತೊಂದರೆ ಉಂಟಾಗಬಹುದು

source: Unmounting and ejecting CD-ROM...
kn: ಸಿ ಡಿ ರೋಮ್ ಅನ್ನು ಆರೋಹಣೆಯಿಂದ ತೆಗೆದು, ಹೊರಕಳುಸುತ್ತಿದೆ

source: Detect and mount CD-ROM
kn: ಸಿಡಿ-ರಾಮ್ ಪತ್ತೆ ಹಚ್ಚಿ ಹಾಗು ಮೇಲೆರಿಸಿ
