Repository: aspschn/d-i
Catalog: packages/rescue/debian/po/*.po
Languages: cy, tg

source: Rescue mode
cy: Defnyddio'r modd achub
tg: Ҳолати наҷотдиҳӣ

source: Enter rescue mode
cy: Defnyddio'r modd achub
tg: Гузаштан ба реҷаи наҷотдиҳӣ

source: No partitions found
cy: Ni chanfuwyd rhaniadau
tg: Ягон қисми диск ёфт нашудааст

source: The installer could not find any partitions, so you will not be able to mount a root file system. This may be caused by the kernel failing to detect your hard disk drive or failing to read the partition table, or the disk may be unpartitioned. If you wish, you may investigate this from a shell in the installer environment.
cy: Methodd y sefydlydd i ganfod unrhyw raniadau, felly ni fydd yn gallu clymu system ffeilio wraidd. Fe allai hynny gael ei achosi gan y cnewyllyn yn methu canfod eich disg galed neu methu darllen y tabl rhaniadau, neu falle nad oes rhaniadau ar y disg. Os hoffech, fe allwch chi ymchwilio hyn o gragen yn amgylchedd y sefydlydd.
tg: Насбкунанда натавонист ягон қисми дискро пайдо намояд, барои ҳамин шумо наметавонед низоми файлии root-ро васл намоед. Ин метавонад аз он сабаб ба вуҷуд ояд, ки ҳаста драйви диски сахти шуморо пайдо карда натавонист, ё ки ҷадвали қисмбандиро хонда натавонист, ё ки диск қисмбандӣ нашудааст. Агар шумо хоҳед, шумо метавонед инро аз восити муҳити насбкунанда таҳқиқ намоед.

source: Assemble RAID array
cy: Adeiladu arae RAID
tg: Ҷамъ кардани қатори RAID

source: Do not use a root file system
cy: Peidio defnyddio system ffeiliau gwraidd
tg: Истифода накардани низоми файлии root

source: Device to use as root file system:
cy: Y ddyfais i'w glymu fel y system ffeiliau gwraidd:
tg: Дастгоҳ барои истифода ҳамчун низоми файлии root:

source: Enter a device you wish to use as your root file system. You will be able to choose among various rescue operations to perform on this file system.
cy: Mewnosodwch ddyfais yr ydych am ddefnyddio fel ei system ffeil gwraidd. Byddwch yn medru dewis rhwng gwahanol wasanaethau achub i weithredu ar y system ffeil yma.
tg: Дастгоҳеро ворид намоед, ки бояд ҳамчун низоми решагии шумо истифода шавад. Шумо метавонед дар байни амалиётҳои гуногуни барқароркунӣ, ки дар ин низоми файлӣ иҷро мешаванд, интихоб намоед.

source: If you choose not to use a root file system, you will be given a reduced choice of operations that can be performed without one. This may be useful if you need to correct a partitioning problem.
cy: Os nad ydych chi'n dewis system ffeilio graidd, fe fyddwch yn cael dewis llai o weithredoedd allwch wneud hebddo. Fe all hyn fod yn ddefnyddiol os ydych yn ceisio cywiro problem rhaniadau.
tg: Агар шумо интихоб намоед, ки низоми файлии решагиро истифода набаред, ба шумо интихоби камтари амалиётҳо дода мешавад, ки метавонанд бе низоми файлии решагӣ иҷро шаванд. Ин метавонад он гоҳ фоиданок бошад, ки агар ба шумо лозим шавад, ки мушкилии қисмбандиро ислоҳ намоед.

source: No such device
cy: Nid yw'r ddyfais yn bodoli
tg: Чунин дастгоҳ мавҷуд нест

source: The device you entered for your root file system (${DEVICE}) does not exist. Please try again.
cy: Nid yw'r ddyfais a roddoch ar gyfer eich system ffeiliau gwraidd (${DEVICE}) yn bodoli. Ceisiwch eto.
tg: Дастгоҳе, ки шумо барои низоми файлии роҳандозии худ (${DEVICE}) ворид кардед, вуҷуд надорад. Лутфан, амалро такрор намоед.

source: Mount failed
cy: Methwyd clymu
tg: Васлкунӣ қатъ шудааст

source: An error occurred while mounting the device you entered for your root file system (${DEVICE}) on /target.
cy: Roedd gwall wrth glymu'r dyfais a roddoch ar gyfer eich system ffeiliau gwraidd (${DEVICE}) ar /target.
tg: Ҳангоми васлкунии дастгоҳи воридшудаи шумо барои низоми файлии решагии (${DEVICE}) дар /target хато ба вуҷуд омадааст.

source: Please check the syslog for more information.
cy: Edrychwch ar y syslog am fwy o wybodaeth.
tg: Барои маълумоти бештар, лутфан, syslog-ро санҷед.

source: Rescue operations
cy: Gweithredoedd achub
tg: Амалҳои наҷотдиҳӣ

source: Rescue operation failed
cy: Methodd y weithred achub
tg: Амали наҷотдиҳӣ қатъ шуд

source: The rescue operation '${OPERATION}' failed with exit code ${CODE}.
cy: Methodd y weithred achub "${OPERATION}" gyda'r côd gadael ${CODE}.
tg: Амалиёти барқароршавии "${OPERATION}" бо рамзи хатои ${CODE} бо нокомӣ дучор шуд.

source: Execute a shell in ${DEVICE}
cy: Gweithredu cragen yn ${DEVICE}
tg: Иҷро кардани восит дар ${DEVICE}

source: Execute a shell in the installer environment
cy: Gweithredu cragen yn amgylchedd y sefydlydd
tg: Иҷро кардани восит дар муҳити насбкунанда

source: Choose a different root file system
cy: Dewiswch system ffeilio graidd
tg: Интихоби низоми файлии дигари root

source: Reboot the system
cy: Ailgychwyn y system
tg: Низомро бозоғозӣ намоед

source: Executing a shell
cy: Gweithredu cragen
tg: Иҷрокунии восит

source: After this message, you will be given a shell with ${DEVICE} mounted on "/". If you need any other file systems (such as a separate "/usr"), you will have to mount those yourself.
cy: Yn dilyn y neges hwn, cewch gragen ar ${DEVICE} wedi ei osod ar "/". Os ydych angen unrhyw system ffeiliau ychwanegol (fel "/usr" ar wahan), fe fydd yn rhaid i chi glymu rheiny eich hun.
tg: Баъд аз ин паём, ба шумо восит бо ${DEVICE}, ки дар "/" васл шудааст, дода мешавад. Агар ба шумо ягон низомҳои файлии дигар лозим бошанд (ба мисли "/usr"-и алоҳида), шумо бояд онҳоро мустақилона васл намоед.

source: Error running shell in /target
cy: Gwall yn rhedeg cragen yn /target
tg: Ҳангоми иҷрокунии восит дар /target хато ба вуҷуд омад

source: A shell (${SHELL}) was found on your root file system (${DEVICE}), but an error occurred while running it.
cy: Canfuwyd cragen (${SHELL}) ar eich system ffeiliau gwraidd (${DEVICE}), ond digwyddodd gwall wrth ei redeg.
tg: Дар низоми решагии файлии шумо (${DEVICE}) восити (${SHELL}) ёфт шуд, аммо ҳангоми иҷрокунии он хато ба вуҷуд омад.

source: No shell found in /target
cy: Dim cragen wedi ei ganfod yn /target
tg: Ягон восит дар /target ёфт нашуд

source: No usable shell was found on your root file system (${DEVICE}).
cy: Ni chanfuwyd cragen defnyddiadwy ar eich system ffeiliau gwraidd (${DEVICE}).
tg: Ягон восити истифодашаванда дар низоми файлии решагии (${DEVICE})-и шумо ёфт нашуд.

source: Interactive shell on ${DEVICE}
cy: Cragen rhyngweithiol ar ${DEVICE}
tg: Восити интерактивӣ дар ${DEVICE}

source: After this message, you will be given a shell with ${DEVICE} mounted on "/target". You may work on it using the tools available in the installer environment. If you want to make it your root file system temporarily, run "chroot /target". If you need any other file systems (such as a separate "/usr"), you will have to mount those yourself.
cy: Yn dilyn y neges hwn, cewch gragen ar ${DEVICE} wedi ei osod ar "/target". Fe allwch weithio arno gan ddefnyddio'r offer sydd ar gael yn amgylchedd y sefydlydd. Os ydych eisiau ei wneud yn system ffeiliau craidd dros dro, rhedwch "chroot /target". Os ydych angen unrhyw system ffeiliau ychwanegol (fel "/usr" ar wahan), fe fydd yn rhaid i chi glymu rheiny eich hun.
tg: Баъд аз ин паём, ба шумо восит бо ${DEVICE}, ки дар "/target" васл шудааст, дода мешавад. Шумо метавонед тавассути абзорҳое, ки дар муҳити насбкунанда дастрас мебошанд, бо он кор намоед. Агар шумо хоҳед, ки онро муваққатан ҳамчун низоми файлии решагии худ истифода баред, фармони "chroot /target"-ро иҷро намоед. Агар ба шумо ягон низомҳои файлии дигар лозим бошанд (ба мисли "/usr"-и алоҳида), шумо бояд онҳоро мустақилона васл намоед.

source: After this message, you will be given a shell in the installer environment. No file systems have been mounted.
cy: Yn dilyn y neges hwn, cewch gragen yn amgylchedd y sefydlydd. Ni fydd unrhyw system ffeiliau wedi eu clymu.
tg: Баъд аз ин паём, ба шумо восит дар муҳити насбкунанда дода мешавад. Ягон низоми файлӣ васл карда нашуд.

source: Interactive shell in the installer environment
cy: Cragen rhyngweithiol yn amgylchedd y sefydlydd
tg: Восити интерактивӣ дар муҳити насбкунанда

source: Passphrase for ${DEVICE}:
cy: Cyfrinair ar gyfer ${DEVICE}:
tg: Калидвожа барои ${DEVICE}:

source: Please enter the passphrase for the encrypted volume ${DEVICE}.
cy: Mewnosodwch y cyfrinair ar gyfer y gyfrol amgryptedig ${DEVICE}.
tg: Лутфан, калидвожаро барои ҳаҷми рамзгузоришудаи ${DEVICE} ворид намоед.

source: If you don't enter anything, the volume will not be available during rescue operations.
cy: Os na deipiwch unrhyw beth, ni fydd y gyfrol ar gael yn ystod y broses achub.
tg: Агар шумо ягон чизро ворид накунед, ҳаҷм ҳангоми амалиётҳои барқарорсозӣ дастрас намешавад.

source: Automatic
cy: Awtomatig
tg: Худкор

source: Partitions to assemble:
cy: Rhaniadau i adeiladu:
tg: Қисмҳои диск барои эҷодкунӣ:

source: Select the partitions to assemble into a RAID array. If you select "Automatic", then all devices containing RAID physical volumes will be scanned and assembled.
cy: Dewiswch y rhaniadau i adeiladu mewn i arae RAID. Os ydych yn dewis "Awtomatig", yna fe fydd yr holl ddyfeisiau sy'n cynnwys cyfrolau corfforol RAID yn cael eu sganio a'u adeiladu:
tg: Қисмҳои дискро интихоб намоед, ки бояд ба қатори RAID эҷод карда шаванд. Агар шумо "Худкор"-ро интихоб намоед, он гоҳ ҳамаи дастгоҳҳое, ки дорои ҳаҷмҳои физикии RAID мебошанд, скан ва эҷод карда мешаванд.

source: Note that a RAID partition at the end of a disk may sometimes cause that disk to be mistakenly detected as containing a RAID physical volume. In that case, you should select the appropriate partitions individually.
cy: Weithiau fe allai rhaniad RAID ar ddiwedd disg achosi'r disg hynny i'w adnabod fel cyfrol corfforol RAID. Yn yr achos hynny, fe ddylech ddewis y rhaniadau perthnasol yn unigol.
tg: Ба қайд гиред, ки қисми диски RAID дар охири диск метавонад баъзан сабаби он гардад, ки диск ҳамчун диски дорои ҳаҷми физикии RAID ташхис карда мешавад. Дар ин ҳолат, шумо бояд қисмҳои диски мувофиқро ба таври мушаххас интихоб намоед.

source: Mount separate ${FILESYSTEM} partition?
cy: Clymu rhaniad ar wahân ${FILESYSTEM}?
tg: Қисми диски алоҳидаи ${FILESYSTEM}-ро васл мекунед?

source: The installed system appears to use a separate ${FILESYSTEM} partition.
cy: Mae'n ymddangos bod y system sefydledig yn defnyddio rhaniad ${FILESYSTEM} ar wahân.
tg: Чунин менамояд, ки низоми насбшуда қисми диски алоҳидаи ${FILESYSTEM}-ро истифода мебарад.

source: It is normally a good idea to mount it as it will allow operations such as reinstalling the boot loader. However, if the file system on ${FILESYSTEM} is corrupt then you may want to avoid mounting it.
tg: Фикри хуб аст, ки агар шумо онро васл намоед, зеро ки он барои амалҳо монанди насбкунии дубораи боркунандаи роҳандозӣ иҷозат медиҳад. Лекин, агар низоми файлӣ дар ${FILESYSTEM} вайрон шавад, он вақт шумо метавонед васлкунии онро рад намоед.
