Repository: aspschn/d-i
Catalog: packages/media-retriever/debian/po/*.po
Languages: bo

source: Scanning removable media
bo: སྤྱོད་བདེ་འཇུག་སྣོད་འཚོལ་བཤེར་བྱེད་པ

source: Cannot read removable media, or no drivers found.
bo: སྤྱོད་བདེ་འཇུག་མཛོད་ཀློག་མི་ཐུབ་པ་དང་སྒུལ་ཆས་མ་རྙེད་པ

source: There was a problem reading data from the removable media. Please make sure that the right media is present. If you continue to have trouble, your removable media might be bad.
bo: སྤྱོད་བདེ་འཇུག་སྣོད་ནས་གྲངས་རྒྱུན་ཀློག་སྐབས་སྐྱོན་ཞིག་ཡོད་པས་འཇུག་སྣོད་དེ་ནང་དུ་བཅུག་ཡོད་པར་དག་ཐེར་བྱེད་རོགས ད་དུང་བཟོ་མ་ཐུབ་ན་ཁྱོད་ཀྱི་འཇུག་སྣོད་ལ་སྐྱོན་ཞིག་ཡོད་སྲིད

source: Load drivers from removable media now?
bo: སྤྱོད་བདེ་བའི་འཇུག་སྣོད་ནས་ད་ལྟ་སྒུལ་ཆས་འཇུག་དགོས་སམ

source: You probably need to load drivers from removable media before continuing with the installation. If you know that the install will work without extra drivers, you can skip this step.
bo: ཕལ་ཆེར་སྒྲིག་འཇུག་མུ་མ་མཐུད་གོང་དུ་སྤྱོད་བདེའི་མཇུག་སྣོད་ནས་སྒུལ་ཆས་འཇུག་དགོས་པ། གལ་སྲིད་ཁྱོད་ཀྱིས་ཟུར་གཏོགས་ཀྱི་སྒུལ་ཆས་མི་དགོས་པ་སྒྲིག་འཇུག་ཐུབ་པ་ཤེས་ན་ཁྱོད་ཀྱིས་རིམ་པ་འདི་མཆོངས་ནས་འགྲོ་ཆོག

source: If you do need to load drivers, insert the appropriate removable media, such as a driver floppy or USB stick before continuing.
bo: གལ་སྲིད་ཁྱོད་ཀྱིས་སྒུལ་ཆས་དེ་དག་འཇུག་དགོས་པར་ཐག་ཆོད་ན་དེ་དང་འབྲེལ་ཡོད་ཀྱི་སྤྱོད་བདེ་མཇུག་སྣོད་ནང་དུ་འཇུག་དགོས དཔེར་ན་སྒུལ་ཆས་floppy ཡང་ན་USB འཇུག་སྣོད་ལྟ་བུ

source: Load drivers from removable media
bo: སྤྱོད་བདེའི་འཇུག་སྣོད་ནས་སྒུལ་ཆས་འཇུག་པ

source: Unknown removable media. Try to load anyway?
bo: རྒྱུས་མེད་པའི་སྤྱོད་བདེའི་འཇུག་སྣོད་ཡིན་པས་གང་ལྟར་འཇུག་ཐུབ་མིན་ལྟ་དགོས་སམ

source: Detected removable media that is not a known driver media. Please make sure that the correct media is inserted. You can still continue if you have an unofficial removable media you want to use.
bo: ཚོར་རྟོགས་བྱུང་བའི་སྤྱོད་བདེའི་འཇུག་སྣོད་དེ་ནི་རྒྱུས་མེད་པའི་སྒུལ་ཆས་འཇུག་སྣོད་རེད། ཁྱོད་ཀྱིས་ཡང་དག་པའི་འཇུག་སྣོད་དེ་མཐུད་ཡོད་པར་དག་ཐེར་བྱེད་རོགས། ཡིན་ནའང་ཁྱོད་ཀྱིས་དཔོན་གནས་ནས་མིན་པའི་འཇུག་སྣོད་ཞིག་སྤྱོད་དགོས་ན་མུ་མཐུད་ཆོག

source: Please insert ${DISK_LABEL} ('${DISK_NAME}') first.
bo: དང་པོ་${DISK_LABEL} (“${DISK_NAME}”)་ནང་དུ་འཇུག་རོགས

source: Due to dependencies between packages, drivers must be loaded in the correct order.
bo: ཐུམ་བུ་བར་དུ་ཁོངས་གཏོགས་ཀྱི་འབྲེལ་བ་ཡོད་པས་སྒུལ་ཆས་རྣམས་ངེས་པར་དུ་གོ་རིམ་བཞིན་ནང་དུ་འཇུག་དགོས

source: Load drivers from another removable media?
bo: སྤྱོད་བདེའི་འཇུག་སྣོད་བཞན་ཞིག་ནས་སྒུལ་ཆས་ནང་དུ་འཇུག་དགོས་སམ

source: To load additional drivers from another removable media, please insert the appropriate removable media, such as a driver floppy or USB stick before continuing.
bo: ཟུར་སྣོན་གྱི་སྒུལ་ཆས་དེ་དག་སྤྱོད་བདེའི་འཇུག་སྣོད་ནས་འཇུག་དགོས་ན་དེ་དང་འབྲེལ་ཡོད་ཀྱི་སྤོར་བདེ་མཇུག་སྣོད་ནང་དུ་འཇུག་དགོས དཔེར་ན་སྒུལ་ཆས་floppy ཡང་ན་USB འཇུག་སྣོད་ལྟ་བུ
