Repository: aspschn/d-i
Catalog: packages/iso-scan/debian/po/*.po
Languages: el

source: Scan hard drives for an installer ISO image
el: Αναζήτηση ενός ειδώλου εγκατάστασης ISO στους σκληρούς δίσκους

source: Detecting hardware to find hard drives
el: Ανίχνευση υλικού για σκληρούς δίσκους

source: Searching drives for an installer ISO image
el: Αναζήτηση ενός ειδώλου εγκατάστασης ISO στους δίσκους

source: Mounting ${DRIVE}...
el: Προσάρτηση του δίσκου ${DRIVE}...

source: Scanning ${DRIVE} (in ${DIRECTORY})...
el: Αναζήτηση στον δίσκο ${DRIVE} (κατάλογος ${DIRECTORY})...

source: Do full disk search for installer ISO image?
el: Να πραγματοποιηθεί αναζήτηση σε ολόκληρο το δίσκο;

source: The quick scan for installer ISO images, which looks only in common places, did not find an installer ISO image. It's possible that a more thorough search will find the ISO image, but it may take a long time.
el: Η γρήγορη αναζήτηση για είδωλα ISO, που πραγματοποιείται μόνο σε ορισμένα πιθανά σημεία, δεν ανίχνευσε κάποιο είδωλο ISO. Πιθανόν μια πιο λεπτομερής αναζήτηση να βρει κάποιο είδωλο ISO, αλλά η διαδικασία θα είναι χρονοβόρα.

source: Failed to find an installer ISO image
el: Η αναζήτηση ενός ειδώλου εγκατάστασης ISO απέτυχε

source: No installer ISO images were found. If you downloaded the ISO image, it may have a bad filename (not ending in ".iso"), or it may be on a file system that could not be mounted.
el: Δε βρέθηκαν εικόνες ISO του εγκαταστάτη. Αν μεταφορτώσατε μια τέτοια εικόνα, είναι πιθανόν να έχει αποθηκευτεί με λάθος όνομα (κάποιο που να μην έχει την κατάληξη ".iso") ή μπορεί να βρίσκεται σε ένα σύστημα αρχείων που δεν ήταν δυνατό να προσαρτηθεί.

source: You'll have to use an alternative installation method, select another device to look for ISO image, or try again after you've fixed it.
el: Θα πρέπει να χρησιμοποιήσετε μιαν εναλλακτική μέθοδο εγκατάστασης, να επιλέξετε μια άλλη συσκευή για να βρείτε μια εικόνα του ISO ή να ξαναπροσπαθήσετε αφού έχετε διορθώσει το πρόβλημα αυτό.

source: While one or more possible ISO images were found, they could not be mounted. The ISO image you downloaded may be corrupt.
el: Αν και βρέθηκαν ένα ή περισσότερα πιθανά είδωλα ISO, ήταν αδύνατη η προσάρτηση. Πιθανόν τα αρχεία ISO που μεταφορτώθηκαν ήταν κατεστραμμένα.

source: No installer ISO image found
el: Δε βρέθηκε είδωλο ISO

source: While one or more possible ISO images were found, they did not look like valid installer ISO images.
el: Αν και βρέθηκαν ένα ή περισσότερα πιθανά είδωλα ISO, δεν ήταν έγκυρα είδωλα εγκατάστασης ISO.

source: Successfully mounted ${SUITE} installer ISO image
el: Η προσάρτηση του ειδώλου εγκατάστασης ISO ${SUITE} ήταν επιτυχής

source: The ISO file ${FILENAME} on ${DEVICE} (${SUITE}) will be used as the installation ISO image.
el: Το είδωλο ISO ${FILENAME} στο ${DEVICE} (${SUITE}) θα χρησιμοποιηθεί για την εγκατάσταση.

source: All detected devices
el: Όλες οι ανιχνευμένες συσκευές

source: Enter device manually
el: Εισάγετε συσκευή με το χέρι

source: Device or partition to search for installation ISO(s):
el: Συσκευή ή κατάτμηση για την αναζήτηση του ISO(s) της εγκατάστασης:

source: You can select a device, manually specify a non-detected device, or rescan available devices (useful for slow USB devices).
el: Μπορείτε να επιλέξετε μια συσκευή, να προσδιορίσετε με το χέρι μια συσκευή που δεν ανιχνεύθηκε ή να ανιχνεύσετε ξανά τις διαθέσιμες συσκευές (χρήσιμο για αργές συσκευές USB).

source: Device name:
el: Όνομα συσκευής:

source: Full search
el: Πλήρης αναζήτηση

source: ISO file to use:
el: Αρχείο ISO για χρήση:

source: One or multiple ISO files have been detected on the selected device(s). Please choose which one you want to use, or ask for a more thorough search.
el: Βρέθηκαν ένα ή περισσότερα αρχεία ISO στις επιλεγμένες συσκευές. Παρακαλώ επιλέξτε αυτό που θέλετε να χρησιμοποιήσετε ή προχωρήστε σε μια πιο συστηματική αναζήτηση.

source: Is ISO file ${FILENAME} the correct image for installation?
el: Είναι το αρχείο ISO ${FILENAME} το σωστό αρχείο για την εγκατάσταση;

source: The ISO file ${FILENAME} on ${DEVICE} (${SUITE}, code ${CODENAME}, self-described as '${DESCRIPTION}') will be used as the installation ISO image.
el: Το αρχείο ISO ${FILENAME} στην συσκευή ${DEVICE} (${SUITE}, κωδική ονομασία ${CODENAME}, που δίνεται ως '${DESCRIPTION}') θα χρησιμοποιηθεί σαν εικόνα ISO της εγκατάστασης.

source: If multiple ISO files exist on the same installer drive, you may select which one you want to use.
el: Αν υπάρχουν περισσότερα από ένα αρχεία ISO στην ίδια συσκευή εγκαταστάτη, μπορείτε να επιλέξετε ποιο θέλετε να χρησιμοποιήσετε.

source: Copy the ISO image into RAM before mounting it?
el: Αντιγραφή της εικόνας ISO στη RAM πριν από την προσάρτηση της;

source: There is enough available memory to be able to copy the ISO image into RAM.
el: Υπάρχει αρκετή διαθέσιμη μνήμη ώστε να μπορεί να αντιγραφεί η εικόνα ISO στην RAM.

source: Choosing this option allows reusing the disk hosting the ISO image. If you don't do it, the disk will be actively used to access the ISO image and it can't be partitioned by the installer.
el: Αυτή η επιλογή επιτρέπει την επαναχρησιμοποίηση του δίσκου που φιλοξενεί την εικόνα ISO. Αν δεν το κάνετε, ο δίσκος θα χρησιμοποιείται ενεργά για πρόσβαση στην εικόνα ISO και μπορεί να διαμερισματοποιηθεί από τον εγκαταστάτη.

source: Note however that if you overwrite the disk containing the ISO image, you should not reboot before the end of the installation as you will not be able to restart the installer since the ISO image will be gone from the hard disk and memory.
el: Σημειώστε, ωστόσο, ότι αν αντικαταστήσετε το δίσκο που περιέχει την εικόνα ISO, δεν θα πρέπει να κάνετε επανεκκίνηση πριν από το τέλος της εγκατάστασης, επειδή δεν θα είστε σε θέση να επανεκκινήσετε τον εγκαταστάτη, μιας και η εικόνα ISO θα έχει εξαφανιστεί από το σκληρό δίσκο και τη μνήμη.

source: Load installer components from an installer ISO
el: Φόρτωση του λογισμικού εγκατάστασης από ένα είδωλο εγκατάστασης ISO
